{"conversation": [{"text": "Hello, please begin by preheating your oven to 400 to 475 degrees Fahrenheit", "evidence": ["Preheat the oven to 400–475 °F (204–246 °C)"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Oh, okay. Why is this so important?", "chosenReferece": "Oh, okay. Why is this so important?", "id": "User", "dialog_act": "ask question"}, {"text": "It is important in order to cook pork chops. If you have boneless center-cut pork chops, a lower temperature at 400 degrees Farenheit would be better. For thicker bone-in chops, please use a higher temperature like 475 degrees Farenheit.", "evidence": ["For boneless center-cut pork chops, set the oven to an even 400 °F (204 °C)", "If you’re preparing thicker bone-in chops, increase the temperature to 475 °F (246 °C) to ensure that they get done all the way through."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, thanks! One other question: After preheating the oven, what should I do? Should I let the pork chops take 10 minutes before cookin", "chosenReferece": "Okay, thanks! One other question: After preheating the oven, what should I do? Should I let the pork chops take 10 minutes before cookin", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, please take the next 10 minutes to season your pork chops using any herbs, spices, or seasonings that you like!", "evidence": ["Season the pork chops to taste", "While the oven is heating up, you can add any herbs, spices, and seasonings that you think will enhance the recipe you’re preparing"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, thanks! I'll season them right now. Let's see, I guess I want 10 minutes to let it set. Thanks! By", "chosenReferece": "Okay, thanks! I'll season them right now. Let's see, I guess I want 10 minutes to let it set. Thanks! By", "id": "User", "dialog_act": "ask to move on"}, {"text": "Have you considered adding kosher salt or black pepper to your pork chops? Have you also considered using minced garlic, parmesan cheese, oregano, red pepper flakes, and a tablespoon of oil?", "evidence": ["You could also keep things simple with a dash of kosher salt and coarse ground black pepper", "sprinkle them with flavorings like minced garlic, parmesan cheese, oregano, or red pepper flakes", "Rub or brush the pork chops with about a tablespoon of oil to help your seasonings stick"], "id": "Agent", "dialog_act": "ask question"}, {"text": "All right, I guess I'll take 2 minutes to put it in. Thanks! By", "chosenReferece": "All right, I guess I'll take 2 minutes to put it in. Thanks! By", "id": "User", "dialog_act": "answer question"}, {"text": "Have you finished seasoning your pork chops?", "evidence": ["Season the pork chops to taste"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yeah, I think I have. Thanks!", "chosenReferece": "Yeah, I think I have. Thanks! Yes, it's important to pre-heat the oven. It will make your food get nice and cooke", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great, please arrange your seasoned pork chops on a baking sheet.", "evidence": ["Arrange the seasoned pork chops on a baking sheet."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I think I have finished rubbing the pork chops. By the way, can I use more than 1 teaspoon of the seasonings? How much?", "chosenReferece": "Okay, I think I have finished rubbing the pork chops. By the way, can I use more than 1 teaspoon of the seasonings? How mu", "id": "User", "dialog_act": "ask question"}, {"text": "You can add or use as little or as much seasoning as you want. You can consider keeping it simple with just a dash of salt and black pepper. I recommend using 1 tablespoon of oil at most", "evidence": ["You could also keep things simple with a dash of kosher salt and coarse ground black pepper"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright, I'm happy with my seasoned pork chops? Does it matter how I lay out my pork chops on the baking sheet?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "Please put the pork chops across the entire baking sheet and separate each one with at least a few inches of space", "evidence": ["Lay out the chops across the entire surface, leaving a few inches of space between each. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, thanks! My oven has finished pre-heating too now. Can we carry on?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask to move on"}, {"text": "Not yet, you may also consider greasing your baking sheet with some olive or canola oil so your pork chops don't stick. Have you considered this?", "evidence": ["Grease the baking sheet with a small amount of olive or canola oil to keep the meat from sticking if you didn’t already coat the pork chops during the seasoning process."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Um, I'll have to think about it. Nah I don't think I need to grease my baking sheet. What's the next step?", "chosenReferece": "Um, I'll have to think about it. Yeah, let's keep going then. Thanks! Oh, man. It'd be great to he", "id": "User", "dialog_act": "ask to move on"}, {"text": "Please slide your baking sheet into the oven on the center rack. Set the timer for 10-15 minutes.", "evidence": ["Cook the pork chops for 10-15 minutes on the first side", "Slide the baking sheet into the oven on the center rack."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I'll check back in 10 minutes.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "other"}, {"text": "It is now 10 minutes, can you please check if the pork is brown lightly around the edges?", "evidence": ["They should begin to brown lightly around the edges after about 10 minutes"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Okay. The pork chops look a little cooked now. It looks a little black though.", "chosenReferece": "Okay. The pork chops look a little cooked now. I'll let you know the next step. Thanks! The chop looks delicious. When will y", "id": "User", "dialog_act": "answer question"}, {"text": "Please clarify if it is black or brown in colour?", "evidence": ["They should begin to brown lightly around the edges after about 10 minutes"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Okay. It's kind of black in colour. Can I have a taste for the pork? Please!", "chosenReferece": "Okay. It's kind of black in colour. Can I have a taste for the pork? Please!", "id": "User", "dialog_act": "ask to move on"}, {"text": "No, please do not taste the pork as you have only cooked one side. Please turn the pork chops over and continue baking for 10 minutes. I also recommend lowering the temperature to 400 degrees Farenheit instead or 375 degrees Farenheit.", "evidence": ["Turn the pork chops and continue baking for 10-15 more minutes."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay. The time for the pork to cook is 10 minutes. Can I make some salad to go with it? Or maybe a baked potato?", "chosenReferece": "Okay. The time for the pork to cook is 30 minutes. Can I make some salad to go with it? Or maybe a baked potato? I", "id": "User", "dialog_act": "ask question"}, {"text": "Yes feel free to make some salad or baked potato while your pork chops cook.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay. That's very helpful. Thanks.", "chosenReferece": "Okay. That's very helpful. Thanks. Bye!", "id": "User", "dialog_act": "other"}, {"text": "Just checking if your pork chops are at an internal temperature of 145 degrees Farenheit?", "evidence": ["Cook the pork chops to an internal temperature of 145 °F (63 °C)"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, they're getting closer. Just checking! They've risen to an internal temperature of 145 degrees Farenheit. Thank you!", "chosenReferece": "Yes, they're getting closer. Just checking! They've risen to an internal temperature of 145 degrees Farenheit. Thank you", "id": "User", "dialog_act": "answer question"}, {"text": "Great, you can now serve your chops and eat it with your baked potato and salad! Enjoy!", "evidence": ["Enjoy baked pork chops fresh out of the oven", "Serve your chops with traditional favorites like cinnamon apples, mashed new potatoes, or rice pilaf."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, thanks! So now the pork chops are done cooking. I can give it a try and enjoy it with the baked potato. Goodbye", "chosenReferece": "Okay, thanks! So now the pork chops are done cooking. I can give it a try and enjoy it with the baked potato. Goodby", "id": "User", "dialog_act": "other"}, {"text": "Thanks for using our service. Leftovers can be stored for 3-4 days!", "evidence": ["Leftovers can be stored in the refrigerator for 3-4 days and reheated in the oven at a medium temperature."], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you. Bye. Goodbye!", "chosenReferece": "Thank you. Bye. Goodbye! The following is a sample conversation between zoiper and kiip.com. The Us", "id": "User"}], "recipe": {"title": "How to Cook Pork Chops", "url": "https://www.wikihow.com/Cook-Pork-Chops", "category": ["Food and Entertaining", "Recipes", "Meat", "Pork", "Pork Chops"], "procedure": [{"summary": "Preheat the oven to 400–475 °F (204–246 °C).", "description": "For boneless center-cut pork chops, set the oven to an even 400 °F (204 °C). If you’re preparing thicker bone-in chops, increase the temperature to 475 °F (246 °C) to ensure that they get done all the way through. If your oven has a convection setting, select it rather than standard bake. Convection baking allows heat to circulate better, which will help your chops cook quicker and more evenly. Make sure frozen chops have had a chance to thaw completely before you begin cooking.", "img": "https://www.wikihow.com/images/thumb/4/4c/Cook-Pork-Chops-Step-1-Version-2.jpeg/v4-460px-Cook-Pork-Chops-Step-1-Version-2.jpeg"}, {"summary": "Season the pork chops to taste.", "description": "While the oven is heating up, you can add any herbs, spices, and seasonings that you think will enhance the recipe you’re preparing. Place the chops on a large serving plate, then sprinkle them with flavorings like minced garlic, parmesan cheese, oregano, or red pepper flakes. You could also keep things simple with a dash of kosher salt and coarse ground black pepper. Rub or brush the pork chops with about a tablespoon of oil to help your seasonings stick.", "img": "https://www.wikihow.com/images/thumb/5/50/Cook-Pork-Chops-Step-2-Version-4.jpg/550px-nowatermark-Cook-Pork-Chops-Step-2-Version-4.jpg"}, {"summary": "Arrange the seasoned pork chops on a baking sheet.", "description": "Lay out the chops across the entire surface, leaving a few inches of space between each. They should have plenty of room to breathe while they cook. Situating the chops too close together may cause them to heat more slowly. Grease the baking sheet with a small amount of olive or canola oil to keep the meat from sticking if you didn’t already coat the pork chops during the seasoning process.", "img": "https://www.wikihow.com/images/thumb/d/d2/Cook-Pork-Chops-Step-3-Version-4.jpg/550px-nowatermark-Cook-Pork-Chops-Step-3-Version-4.jpg"}, {"summary": "Cook the pork chops for 10-15 minutes on the first side.", "description": "Slide the baking sheet into the oven on the center rack. Set a timer to help you keep track of how long the chops have been in the oven. They should begin to brown lightly around the edges after about 10 minutes. A good general rule of thumb when making pork chops is that they need about 7 minutes of cooking time per ⁄2 inch (1.3 cm) of thickness. For especially thick and bone-in cuts, allot an extra 2-5 minutes on each side.", "img": "https://www.wikihow.com/images/thumb/0/07/Cook-Pork-Chops-Step-4-Version-4.jpg/550px-nowatermark-Cook-Pork-Chops-Step-4-Version-4.jpg"}, {"summary": "Turn the pork chops and continue baking for 10-15 more minutes.", "description": "Carefully pull the baking sheet out from the center rack just enough to flip the chops using a fork or pair of tongs. Then, put them back in the oven until they take on a warm brown color and glisten with juice. The chops typically won’t need quite as long on the second side, since they’ll already be partially cooked. For your own protection, always use an insulated oven mitt anytime you remove a dish from a hot oven.", "img": "https://www.wikihow.com/images/thumb/e/e8/Cook-Pork-Chops-Step-5-Version-4.jpg/550px-nowatermark-Cook-Pork-Chops-Step-5-Version-4.jpg"}, {"summary": "Cook the pork chops to an internal temperature of 145 °F (63 °C).", "description": "The best way to avoid confusion about when your dinner is ready is to use a meat thermometer. Slide the tip of the thermometer into the thickest portion of the chop, usually somewhere near the middle, then wait 30 seconds to get an accurate reading. Pork needs to be cooked to an internal temperature of at least 145 °F (63 °C) in order to be eaten safely. Cooking pork can be a little tricky, since it may look done on the outside but be dangerously undercooked in the center.", "img": "https://www.wikihow.com/images/thumb/0/04/Cook-Pork-Chops-Step-6-Version-2.jpeg/v4-460px-Cook-Pork-Chops-Step-6-Version-2.jpeg"}, {"summary": "Enjoy baked pork chops fresh out of the oven.", "description": "Serve your chops with traditional favorites like cinnamon apples, mashed new potatoes, or rice pilaf. For a lower-calorie feast, go with sides like grilled asparagus or steam broccoli. A few sprigs of fresh parsley or a dash of rosemary can add a jolt of bold flavor without increasing the amount of calories in the dish. Leftovers can be stored in the refrigerator for 3-4 days and reheated in the oven at a medium temperature.", "img": "https://www.wikihow.com/images/thumb/f/fd/Cook-Pork-Chops-Step-7-Version-2.jpeg/v4-460px-Cook-Pork-Chops-Step-7-Version-2.jpeg"}]}}