{"conversation": [{"text": "Are you ready to make the sauce?", "evidence": ["Your goal with this sauce should be to gently bring it to a warm temperature and a smooth consistency. "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes but how do I start off?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "The first step is to melt butter over a medium to low heat.", "evidence": ["Melt butter on the stove."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok I've melted the butter, what now?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next you want to add the cream and the Parmesan cheese.", "evidence": ["Stir in the cream and Parmesan cheese"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Just add it or do I need to whisk it or something like that?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "You need to stir as you're adding the ingredients to stop them from burning.", "evidence": ["Gently stir the mixture as you add the ingredients to keep them from burning or sticking."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oh right, well it's starting to smell burnt should I start again?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "A burnt smell means you may have had the heat too high. You only need to simmer it. Start that part again.", "evidence": ["Heat until simmering."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright thanks a lot. The sauce smells ok so it will simmer again. Should I add the tomato concentrate next?", "chosenReferece": "Alright thanks a lot. The sauce smells ok so it will simmer again. Should I add the tomato concentrate next? There's quit", "id": "User", "dialog_act": "ask question"}, {"text": "Oh no, there is no tomato in this sauce, did you misread the ingredients list?", "evidence": ["Add salt and pepper to taste."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I think I did, sorry! Do I add anything else at this stage?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "You can add more than salt and pepper but that's down to you, what did you have in mind?", "evidence": ["You can add whatever seasonings you want, but plain old salt and pepper work great on their own."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I was thinking maybe some garlic powder would be good.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "other"}, {"text": "If you like garlic that's great! Have you added it?", "evidence": ["If you saved the water from the pasta pot, you can use it to thin out a sauce that is too thick and rich."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Hi. A bit. What do I do next? What shall I add next and how much?", "chosenReferece": "Hi. A bit. What do I do next? What shall I add next and how much?", "id": "User", "dialog_act": "ask question"}, {"text": "The next step is up to you but if you think the sauce is too thick you can add some pasta water to it ok?", "evidence": ["If you saved the water from the pasta pot, you can use it to thin out a sauce that is too thick and rich."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "It seems fine to me, not too thick and not too thin.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "other"}, {"text": "Have you tasted the sauce so far? Do you like it?", "evidence": ["When the sauce tastes just how you like it, it's ready to serve."], "id": "Agent", "dialog_act": "ask question"}, {"text": "It tastes really good, I wonder what I can add it to!", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "other"}, {"text": "You can add it to all sorts of food like chicken or green veggies. Sound good to you?", "evidence": ["Alternatively, try using it to lend creamy flavor to your favorite meat and vegetable dishes, including chicken, shrimp, broccoli, and much more."], "id": "Agent", "dialog_act": "ask question"}, {"text": "That sounds great. Thanks for helping me make the sauce!", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "other"}, {"text": "You're welcome. Remember you can use this sauce for almost any kind of dish.", "evidence": ["This sauce's mild flavor is highly versatile, so you can use it for almost any entrée."], "id": "Agent", "dialog_act": "other"}, {"text": "Oh, I'll think about it. Goodbye!", "chosenReferece": "Oh, I'll think about it. Bye. See you. Goodbye! Seems easy enough - I don't think I m", "id": "User", "dialog_act": "other"}], "recipe": {"title": "How to Make Alfredo Sauce", "url": "https://www.wikihow.com/Make-Alfredo-Sauce", "category": ["Food and Entertaining", "Recipes", "Jams Preserves and Condiments", "Sauces"], "procedure": [{"summary": "Melt butter on the stove.", "description": "Use a standard saucepan over medium-low heat. Your goal with this sauce should be to gently bring it to a warm temperature and a smooth consistency. Low, slow cooking is best. This can take patience.", "img": "https://www.wikihow.com/images/thumb/a/af/Make-Alfredo-Sauce-Step-1-Version-3.jpg/v4-460px-Make-Alfredo-Sauce-Step-1-Version-3.jpg"}, {"summary": "Stir in the cream and Parmesan cheese.", "description": "Gently stir the mixture as you add the ingredients to keep them from burning or sticking. Continue stirring to combine. If you can, use fresh-grated Parmesan. The taste difference is noticeable compared to using pre-grated cheese. Fresh cheese also tends to be less vulnerable to \"seizing.\" See below for an explanation.", "img": "https://www.wikihow.com/images/thumb/2/2d/Make-Alfredo-Sauce-Step-2-Version-3.jpg/v4-460px-Make-Alfredo-Sauce-Step-2-Version-3.jpg"}, {"summary": "Heat until simmering.", "description": "Wait until the sauce reaches a gentle boil. Just a few small bubbles will be forming. At this point, start gently stirring until it becomes noticeably thicker. This is usually about eight minutes. Resist the temptation to crank up the heat. Turn it down if you notice your sauce boiling rapidly. Not only can this burn your ingredients and produce an unpleasant bitter taste — it can also make your cheese \"seize\". When cheese is heated too quickly, the proteins in the cheese coil up rather than separating gently. This separates the fat and moisture from the cheese, leaving an unpleasantly hard product that refuses to melt.", "img": "https://www.wikihow.com/images/thumb/4/48/Make-Alfredo-Sauce-Step-3-Version-3.jpg/v4-460px-Make-Alfredo-Sauce-Step-3-Version-3.jpg"}, {"summary": "Add salt and pepper to taste.", "description": "The sauce is ready to season when it's at a pleasantly thick consistency. You can add whatever seasonings you want, but plain old salt and pepper work great on their own. Stir to mix evenly after adding. A few shakes or pinches of each seasoning should do the trick. If you're worried about adding too much, try adding just a single pinch, stirring, and tasting the sauce. Repeat until you're satisfied!", "img": "https://www.wikihow.com/images/thumb/4/4c/Make-Alfredo-Sauce-Step-4-Version-3.jpg/v4-460px-Make-Alfredo-Sauce-Step-4-Version-3.jpg"}, {"summary": "Optionally, use the pasta water to thin the sauce.", "description": "If you saved the water from the pasta pot, you can use it to thin out a sauce that is too thick and rich. The water retains some of the flavor of the pasta, giving the sauce a nice \"bready\" flavor while thinning it. If you accidentally add too much water, just simmer it a little longer to thicken it again.", "img": "https://www.wikihow.com/images/thumb/3/31/Make-Alfredo-Sauce-Step-5-Version-3.jpg/v4-460px-Make-Alfredo-Sauce-Step-5-Version-3.jpg"}, {"summary": "Serve!", "description": "When the sauce tastes just how you like it, it's ready to serve. Spoon steaming portions over your favorite pasta. The recipe in this section should serve about six. Alternatively, try using it to lend creamy flavor to your favorite meat and vegetable dishes, including chicken, shrimp, broccoli, and much more. This sauce's mild flavor is highly versatile, so you can use it for almost any entrée.", "img": "https://www.wikihow.com/images/thumb/9/93/Make-Alfredo-Sauce-Step-6-Version-2.jpg/v4-460px-Make-Alfredo-Sauce-Step-6-Version-2.jpg"}]}}

