{"conversation": [{"text": "Hello, hope you are having a good day! What do you feel like cooking?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I feel like making a pizza. Thanks. Any other suggestions?", "chosenReferece": "I feel like making a pizza. Thanks. Any other suggestions?", "id": "User", "dialog_act": "answer question"}, {"text": "I know a super quick pizza recipe. Do you have bagels?", "evidence": ["pizza bagel", "pizza bagel", "pizza bagel", "pizza bagel", "pizza bagel", "pizza bagel"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I have a couple of bagels, and I'm hungry now. Let's do it.", "chosenReferece": "I have a couple of bagels if that helps. Thanks. Any other suggestions?", "id": "User", "dialog_act": "answer question"}, {"text": "Can you wait for the oven to preheat? I have microwave directions if you want your food faster. It might not be as tasty out of the microwave though.", "evidence": ["Preheat your oven to 375 °F (191 °C)", "This may take a while", "want to use a microwave, skip this step"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Oh, I have a toaster oven that preheats in under 10 minutes. Will baking take a long time? I would like to eat in about 30 minutes!", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "The total baking time is only 10 minutes, so you'll be able to enjoy pizza bagels in about 20 minutes! Start by preheating your toaster oven to 375°F.", "evidence": ["10 minutes in an oven", "Preheat your oven to 375 °F"], "id": "Agent", "dialog_act": "other"}, {"text": "Okay! Ummm, where should I place the oven rack?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "Just make sure there's enough room for a bagel, toppings, and baking sheet on top of the rack. So, try putting the rack somewhere in the bottom half of the oven. You can even make cleanup easier by covering the sheet with aluminum foil!", "evidence": [" baking sheet with aluminum foil ", "bagel face-up on a baking sheet"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it. I have 4 bagels: one is plain, one is blueberry, and the others are asiago.", "chosenReferece": "oh. Okay. Let's do it. I will have 2 bagels, one is pepperoni, the other is sausage. One is spina", "id": "User", "dialog_act": "other"}, {"text": "How many servings do you want to make? The blueberry bagel won't mix well with the savory toppings. I suggest we avoid using it for this recipe.", "evidence": ["Don't use a sweet bagel, like cinnamon raisin. These flavors won’t mix well with the pizza sauce and cheese."], "id": "Agent", "dialog_act": "ask question"}, {"text": "When I'm hungry like this I can eat a lot! I want to make 3 servings. If I don't finish it all, I'll share with my roommate.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "answer question"}, {"text": "Alright, one bagel can be 1-2 servings according to the recipe. Let's bake up one plain and one asiago. If anything the asiago, will be more savory and delicious! You want to start by placing the sliced bagels face-up on your baking sheet.", "evidence": ["A plain bagel is a great choice, but you can also use a savory bagel, such as wheat, everything, or asiago.", "A plain bagel is a great choice, but you can also use a savory bagel, such as wheat, everything, or asiago."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is face-up the cut side up? I'm confused.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "Sorry, about that. I should have been clearer! You should place the cut side up. That's where the toppings will go.", "evidence": ["Make sure that the cut side of each bagel half is facing up", "Spread 1 tablespoon (15 mL) of pizza sauce over each bagel half."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, what do I do next?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask to move on"}, {"text": "Get out the pizza sauce. You're going to want to spread about 1 tablespoon on each slice.", "evidence": ["Spread 1 tablespoon (15 mL) of pizza sauce over each bagel half."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh, no. My tomato sauce is moldy. Can I use bottled pesto sauce instead?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "answer question"}, {"text": "It depends. What other toppings do you want to use with the pesto? I suggest cheese and pepperoni or salami.", "evidence": [" If you don't have pizza sauce, try pasta sauce or herbed tomato sauce.", "You can use other types of cheese", "No pepperoni? Try salami instead! "], "id": "Agent", "dialog_act": "ask question"}, {"text": "I have mozzarella so I'll use that. I don't really like salami or pepperoni with pesto! Maybe I should stick with the cheese.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "answer question"}, {"text": "You don’t have to add the pepperoni or salami if you don’t want to. Do you have leftover chicken? A lot of people enjoy that with pesto!", "evidence": ["You don’t have to add the pepperoni or salami if you don’t want to."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I do have chicken. Good suggestion. Okay, so how much cheese do I use?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "You could add 1 tablespoon of shredded mozzarella to each \"pizza.\" It's up to you and your preferences! You can even add different types of cheese. Do you have other cheese you might want to add?", "evidence": ["Add 1 tablespoon (7.5 g) of shredded mozzarella cheese to each bagel", "You can use more or less cheese if you want, but make sure that you spread it evenly across the top of each bagel half.", " You can use other types of cheese too"], "id": "Agent", "dialog_act": "other"}, {"text": "Oh, yes. I have parmesan. I'm adding that, too.", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "answer question"}, {"text": "Great. Next, add the chicken and we can stick it in the oven. If you really want it to look like a mini pizza, keep the chicken pieces small (under 1 inch).", "evidence": [" If you really want this to look like a mini pizza, then stick with the mini pepperoni slices; they should be ⁄2 to 1 inch (1.3 to 2.5 cm) in diameter."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "It's in. How do I know it's done?", "chosenReferece": "Not use reference", "id": "User", "dialog_act": "ask question"}, {"text": "The cheese should be melty and bubbling! Keep an eye on it. As I said earlier, it should take about 10 minutes. Does your oven have a light?", "evidence": ["Bake the bagels until the cheese has melted and turned bubbly.", "This will take about 10 minutes in an oven"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, I have a light. I'll be checking it every few minutes. It's done. Thank you very much.", "chosenReferece": "Yes, I have a light. I'll be checking it every few minutes. It's done. Thank you very much.", "id": "User", "dialog_act": "answer question"}, {"text": "Enjoy, your food. Be careful, it's hot!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Oh, good point. Don't want to burn my mouth. Thanks for your help.", "chosenReferece": "Not use reference", "id": "User"}], "recipe": {"title": "How to Make Pizza Bagels", "url": "https://www.wikihow.com/Make-Pizza-Bagels", "category": ["Food and Entertaining", "Recipes", "Sandwiches and Quick Meals", "Pizza"], "procedure": [{"summary": "Preheat your oven to 375 °F (191 °C).", "description": "This may take a while, so prepare your pizza bagel while you wait for it to heat up. If you want to use a microwave, skip this step and move onto the next.", "img": "https://www.wikihow.com/images/thumb/b/bd/Make-Pizza-Bagels-Step-1-Version-2.jpg/v4-460px-Make-Pizza-Bagels-Step-1-Version-2.jpg"}, {"summary": "Place a sliced bagel face-up on a baking sheet.", "description": "A plain bagel is a great choice, but you can also use a savory bagel, such as wheat, everything, or asiago. Make sure that the cut side of each bagel half is facing up. Make clean-up easier by covering the baking sheet with aluminum foil first. If you are making this in the microwave, use a microwave-safe plate instead. Don't use a sweet bagel, like cinnamon raisin. These flavors won’t mix well with the pizza sauce and cheese.", "img": "https://www.wikihow.com/images/thumb/0/05/Make-Pizza-Bagels-Step-2-Version-2.jpg/550px-nowatermark-Make-Pizza-Bagels-Step-2-Version-2.jpg"}, {"summary": "Spread 1 tablespoon (15 mL) of pizza sauce over each bagel half.", "description": "The exact amount of sauce does not really matter; you can use more or less to your liking. Plan on using about 1 tablespoon (15 mL) per bagel half, however. If you don't have pizza sauce, try pasta sauce or herbed tomato sauce.", "img": "https://www.wikihow.com/images/thumb/4/49/Make-Pizza-Bagels-Step-3-Version-2.jpg/550px-nowatermark-Make-Pizza-Bagels-Step-3-Version-2.jpg"}, {"summary": "Add 1 tablespoon (7.5 g) of shredded mozzarella cheese to each bagel.", "description": "You can use more or less cheese if you want, but make sure that you spread it evenly across the top of each bagel half. You can use other types of cheese too, such as Cheddar, Parmesan, or a blend.", "img": "https://www.wikihow.com/images/thumb/c/cf/Make-Pizza-Bagels-Step-4-Version-2.jpg/550px-nowatermark-Make-Pizza-Bagels-Step-4-Version-2.jpg"}, {"summary": "Top the bagels off with pepperoni slices, if desired.", "description": "You should be able to fit 4 mini pepperoni slices or 2 regular pepperoni slices on each bagel half. If you really want this to look like a mini pizza, then stick with the mini pepperoni slices; they should be ⁄2 to 1 inch (1.3 to 2.5 cm) in diameter. No pepperoni? Try salami instead! You don’t have to add the pepperoni or salami if you don’t want to.", "img": "https://www.wikihow.com/images/thumb/7/7c/Make-Pizza-Bagels-Step-5-Version-2.jpg/v4-460px-Make-Pizza-Bagels-Step-5-Version-2.jpg"}, {"summary": "Bake the bagels until the cheese has melted and turned bubbly.", "description": "This will take about 10 minutes in an oven. If you are using the microwave, then 1 minute to 1 minute and 30 seconds should be plenty. If you are making only 1 pizza bagel slice in the microwave, cut the cooking time down to 35 to 45 seconds; you don’t need to adjust the baking time for the oven, however.", "img": "https://www.wikihow.com/images/thumb/d/da/Make-Pizza-Bagels-Step-6-Version-2.jpg/v4-460px-Make-Pizza-Bagels-Step-6-Version-2.jpg"}]}}