{"conversation": [{"text": "Would you like some help to make cookie dough?", "evidence": ["Every cookie dough recipe is a little different"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes please, I have not made it before", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Make sure you read the recipe through first and check the ingredients in the link.", "evidence": ["you should carefully review the specific recipe before proceeding"], "id": "Agent", "dialog_act": "other"}, {"text": "Ok, I have done that. Can I just use butter?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It depends on what sort of cookies you want. Butter gives thinner, crispier cookies but shortening produces a softer texture.", "evidence": ["Butter creates crisper, thinner cookies, while shortening creates soft, cake-like cookies."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I will use butter as I like crunchier cookies. How long do I beat it with the sugar?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should beat the butter, sugar, baking powder and salt together until you get a pale coloured, smooth and light consistency to the mix.", "evidence": ["Cream these ingredients until the consistency and color both become lighter"], "id": "Agent", "dialog_act": "answer question"}, {"text": "That took a while. Are you still there?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, I am still here to help you. Are you happy with the cookie mix at this stage?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great, thank-you. Can I beat all the eggs in at once?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Did your eggs come straight from the refrigerator or are they at room temperature?", "evidence": ["Consider leaving the eggs out at room temperature for 30 minutes before use."], "id": "Agent", "dialog_act": "ask question"}, {"text": "They came out of the refrigerator. Does that really matter?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It depends on how light and airy you would like your cookie dough. Do you want to wait until they have warmed up?", "evidence": ["This makes it easier for the eggs to incorporate air in the batter, which creates lighter cookies"], "id": "Agent", "dialog_act": "ask question"}, {"text": "No, I don't have time for that, I need to take a shower soon.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Alright, make sure you beat them in well. Shall we move onto the next step?", "evidence": ["Beat until you remove all streaks of egg or extract"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes. I am ready to add the flour. Can I just dump it all in at once?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "What sort of mixer do you have?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I only have an hand-held electric mixer. Is that OK?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It will be fine. Are all the eggs beaten in properly?", "evidence": ["Beat until you remove all streaks of egg or extract."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes. The mix is nice and smooth. Can I add the flour now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes. Slowly add the flour so it gets mixed in well and you do not overload and damage your beater. Please tell me if your beaten begins to sound too noisy or smells burnt?", "evidence": ["Gradually add the flour."], "id": "Agent", "dialog_act": "answer question"}, {"text": "The beater is fine. All the flour is mixed in. What else do I need to do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you want just a plain cookie dough or do you want to add chocolate chips, some nuts or dried fruit?", "evidence": ["Any chocolate chips, nuts, or similar ingredients should be stirred in after the flour"], "id": "Agent", "dialog_act": "ask question"}, {"text": "I like sultanas. Can I use them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, they will be very tasty. Mix them in now. Are you going to cook the dough now?", "evidence": ["Any chocolate chips, nuts, or similar ingredients should be stirred in after the flour"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Great, sultanas are very sweet. Yes, I will cook the dough now. I am hungry.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Good. Do you need any more help now?", "evidence": ["bake around 350 degrees Fahrenheit (180 degrees Celsius) for 8 to 15 minutes."], "id": "Agent", "dialog_act": "ask question"}, {"text": "No, baking them is the easy part. Thank-you for your help.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I am glad to be of assistance. I hope they turn out well. Good-bye.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thanks. Have a great day.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Cookie Dough", "url": "https://www.wikihow.com/Make-Cookie-Dough", "category": ["Food and Entertaining", "Recipes", "Baking", "Cookies and Biscuits"], "procedure": [{"summary": "Review the ingredients.", "description": "Every cookie dough recipe is a little different, so you should carefully review the specific recipe before proceeding. That said, most cookie dough recipes share the same basic ingredients in various proportions. Use the following guidelines to prepare cookie dough if you have a list of ingredients but lost the instructions that go with it. Most cookie dough recipes use some type of fat, sugar, eggs, and flour. Salt and baking powder are not used as consistently but do appear in many cookie dough recipes as leavening agents. Butter is the most common fat used, but shortening is also used frequently. Butter creates crisper, thinner cookies, while shortening creates soft, cake-like cookies. Vanilla extract also appears in most cookie dough recipes. Note that ready-to-eat or safe-to-eat cookies doughs don't contain eggs.", "img": "https://www.wikihow.com/images/thumb/4/4a/Make-Cookie-Dough-Step-1.jpg/v4-460px-Make-Cookie-Dough-Step-1.jpg"}, {"summary": "Soften the butter.", "description": "For best results, cut the cold butter into pieces and allow it to sit out at room temperature up to 30 minutes. The butter should be soft enough for you to leave an indentation with your thumb. Do not let the butter melt, though. Softened butter and margarine are easier to combine with other ingredients. If running short on time, you can microwave the cold butter for 10-second intervals until softened. If using margarine instead of butter, make sure that the margarine contains 80 percent vegetable oil or more.", "img": "https://www.wikihow.com/images/thumb/d/d6/Make-Cookie-Dough-Step-2.jpg/v4-460px-Make-Cookie-Dough-Step-2.jpg"}, {"summary": "Beat the butter and shortening together.", "description": "If your recipe calls for both butter and shortening, you should cream them together with an electric mixer until smooth. Even if your recipe only contains one or the other, you should still consider beating the fat with an electric mixture until smooth. Doing so removes any lumps and allows the fat to mix into the dough more effectively.", "img": "https://www.wikihow.com/images/thumb/d/dc/Make-Cookie-Dough-Step-3-Version-2.jpg/v4-460px-Make-Cookie-Dough-Step-3-Version-2.jpg"}, {"summary": "Add the sugar, baking powder, and salt.", "description": "Use an electric mixer to beat in the sugar, salt, and baking powder or baking soda. These ingredients should be completely combined with the fat. Cream these ingredients until the consistency and color both become lighter. This process creates air bubbles in the dough, thereby creating lighter cookies. Do not overbeat the dough, though, especially at this stage.", "img": "https://www.wikihow.com/images/thumb/d/d6/Make-Cookie-Dough-Step-4-Version-2.jpg/v4-460px-Make-Cookie-Dough-Step-4-Version-2.jpg"}, {"summary": "Add the eggs and vanilla extract.", "description": "Use an electric mixer to beat the eggs in one at a time on medium speed. Add the vanilla extract simultaneously or immediately after. Beat until you remove all streaks of egg or extract. Consider leaving the eggs out at room temperature for 30 minutes before use. This makes it easier for the eggs to incorporate air in the batter, which creates lighter cookies.", "img": "https://www.wikihow.com/images/thumb/f/ff/Make-Cookie-Dough-Step-5-Version-2.jpg/v4-460px-Make-Cookie-Dough-Step-5-Version-2.jpg"}, {"summary": "Gradually add the flour.", "description": "Use an electric mixer to beat in as much flour as possible, adding it slowly to the dough. When the mixer begins to strain, switch to a wooden spoon and stir the remaining flour into the dough that way. Stand mixers can usually take the strain, so you may not need to do any stirring if using one. Hand-held mixers are less durable, though, and should be swapped out toward the end to prevent the mixer from burning out completely. Any chocolate chips, nuts, or similar ingredients should be stirred in after the flour.", "img": "https://www.wikihow.com/images/thumb/2/2e/Make-Cookie-Dough-Step-6-Version-2.jpg/v4-460px-Make-Cookie-Dough-Step-6-Version-2.jpg"}, {"summary": "Save or bake as directed.", "description": "Saving instructions and baking instructions vary, so it is best to find instructions that are specific to your recipe. Generally, you can wrap your dough tightly in plastic wrap and save it in the refrigerator for a week. Many cookie recipes bake around 350 degrees Fahrenheit (180 degrees Celsius) for 8 to 15 minutes.", "img": "https://www.wikihow.com/images/thumb/7/7f/Make-Cookie-Dough-Step-7-Version-2.jpg/v4-460px-Make-Cookie-Dough-Step-7-Version-2.jpg"}]}}