{"conversation": [{"text": "Hello, Today we are preparing and cooking Thinly Sliced Chicken Breast", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I begin?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We are going to start by preheating the oven to 400F or 204C", "evidence": ["Preheat the oven to 400 °F (204 °C)"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, The oven is Preheating.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we are going to take a backing sheet and rub a small amount of vegetable oil or shortening over the bottom and set aside for later.", "evidence": ["Rub a little vegetable oil or shortening over the bottom of the baking sheet and set it aside."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok. What is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Take a large sheet of waxed paper and place it on your work surface. We are going to lay 6 thin sliced pieces on chicken breast on a single side of paper. Each piece should be at least 3 inches wide. Then we can start to season it.", "evidence": ["Put the chicken on waxed paper and season it with salt, pepper, and garlic."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What are we seasoning it with?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We want to season with Salt, Pepper and Garlic powder.", "evidence": ["season it with salt, pepper, and garlic."], "id": "Agent", "dialog_act": "answer question"}, {"text": "How much seasoning do I need?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Sprinkle each side of the chicken breast according to your taste preference.", "evidence": ["Sprinkle salt, pepper, and garlic powder according to your taste"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok. I am ready to move on.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Alright. Now we are going to take out 6 thinly sliced pieces of Deli ham. You'll need to fold the ham in half or thirds, making sure it does not go over the sides of the chicken. If so, you may need to fold it more. You will use 1 slice of ham per piece of chicken in this recipe.", "evidence": ["Take out 6 pieces of thinly-sliced deli ham."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, I have folded up my ham and placed it on my chicken.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Good. Now we are going to take out 6 thinly sliced pieces of deli cheese and fold them in half, placing the cheese on top of the folded ham. 1 slice of cheese per piece of chicken.", "evidence": ["Fold slices of cheese and lay them on the ham."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it matter what kind of cheese I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "For this recipe, we need a cheese that melts well. Which cheese you prefer is up to you.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright. I have Cheddar in the fridge.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Cheddar will work fine.", "evidence": ["Roll up each piece of chicken with the cheese and ham."], "id": "Agent", "dialog_act": "other"}, {"text": "Alright, I am ready to move on.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we are going to roll up the chicken. Start on the edge of the chicken that is closest to you. Using your fingertips, fold the chicken over the edge of the ham and cheese. Roll away from you, forming a tight cylinder. We are going to do this for all 6 pieces.", "evidence": ["Roll up each piece of chicken with the cheese and ham."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "My chicken is unrolling.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You want to place your chicken seam side down, so that it stays rolled up while we work on the others.", "evidence": ["Ensure that it's seam-side down so the roll-up stays secure."], "id": "Agent", "dialog_act": "answer question"}, {"text": "That works much better. Thank you. What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we are going to need 3 shallow baking pans or dishes to hold our Egg, Flour and Breadcrumbs. Into the first dish, measure and add 1/2 cup of flour. Into the second dish, Crack 1 egg and whisk until its blended. Into the third dish, place 1 cup of fresh bread crumbs. If you like a little crunch, you may include a handful of panko breadcrumbs with your fresh ones.", "evidence": ["Set 3 shallow baking pans or dishes on your work surface"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright, I have my three dishes prepared and I added some Panko bread crumbs", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Now we are going to take a rolled up piece of chicken and lightly cover it with the flour in the first dish. Then, Lower the chicken into the second dish with the beaten egg, ensuring that it is coated. Now carefully lift it out of the egg and place it into the dish with the breadcrumbs, making sure it is completely coated. We are going to do this to all 6 pieces of chicken.", "evidence": ["Coat each roll-up in the flour, egg, and breadcrumbs."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright, I have made sure all 6 are coated.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Good. Now we are going to move on to the next step. Take a toothpick and stick it into each end of the chicken of the chicken. The goal is to seal the ends shut so that the cheese does not ooze out as they cook. Then we can take out greased baking sheet we made earlier and  and place each piece of chicken on the sheet, seam side down. Leave some space between them. At least 1 Inch (2.5 cm)", "evidence": ["Secure each roll-up with a toothpick and arrange them on the sheet."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "It doesn't seem to stay shut. Can I use additional toothpicks?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You may use additional toothpicks if you feel they are needed.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright, What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now it is time to put our chicken in the oven. Place your baking sheet in your pre-heated oven and bake for 25 minutes. You are looking for the outside to be a lovely golden brown and for your chicken to be cooked all the way through. You can check this with a meat thermometer, it should read 160F or 71C", "evidence": ["Put the baking sheet in the preheated oven and cook the chicken roll-ups until the outside is golden brown and chicken is completely cooked"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What if my chicken is brown but not up to temperature?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Place your chicken back in the oven for a little longer, keeping an eye on it and re-checking the internal temperature every 5 minutes.", "evidence": ["The chicken should reach 160 °F (71 °C) with an instant-read thermometer."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright, it is brown and 71C. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great! Now its time to serve them. Take your tray out of the oven and transfer them to the serving plates. Serve them with a green salad, Roast vegetables or a creamy sauce. Any leftovers can be stored in an airtight container for 1 to 2 days in the refrigerator, but they will lose their crunch over time. Enjoy!", "evidence": ["Serve the chicken cordon bleu roll-ups."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "They taste amazing. Thank you!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I am glad you enjoyed them. Have a good day!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you very much.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "(End of Conversation - Green Box is missing)", "evidence": ["While you can store leftover roll-ups in an airtight container in the refrigerator for 1 to 2 days, they'll lose their crunch as they're stored."], "id": "Agent", "dialog_act": "other"}, {"text": "(End of Conversation - Green Box is Missing)", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "How is your chicken looking? Has it turned a nice golden brown?", "evidence": ["cook the chicken roll-ups until the outside is golden brown and chicken is completely cooked"], "id": "Agent", "dialog_act": "ask question"}, {"text": "It is starting to. I think it needs a little bit longer.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Alright. When you are happy with the colour, remove it from the oven and check the temperature. We are looking for 160F / 71C.", "evidence": [" The chicken should reach 160 °F (71 °C) with an instant-read thermometer."], "id": "Agent", "dialog_act": "other"}, {"text": "I think it is done now. And the thermometer reads 72C", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Good. What are you serving them with today?", "evidence": ["Serve them with a green salad, roasted vegetables, or a creamy sauce."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Green beans and Roasted potatoes", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "That sounds delicious. You can keep any leftovers in the refrigerator for 1 to 2 days, but they will lose their crunch. Keep them in an airtight container.", "evidence": ["While you can store leftover roll-ups in an airtight container in the refrigerator for 1 to 2 days, they'll lose their crunch as they're stored."], "id": "Agent", "dialog_act": "other"}, {"text": "Alright, Thank you so much.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook Thin Sliced Chicken Breast", "url": "https://www.wikihow.com/Cook-Thin-Sliced-Chicken-Breast", "category": ["Food and Entertaining", "Recipes", "Meat", "Poultry Recipes", "Chicken"], "procedure": [{"summary": "Preheat the oven to 400 °F (204 °C) and grease 1 baking sheet.", "description": "Rub a little vegetable oil or shortening over the bottom of the baking sheet and set it aside.", "img": "https://www.wikihow.com/images/thumb/2/2c/Cook-Thin-Sliced-Chicken-Breast-Step-11.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-11.jpg"}, {"summary": "Put the chicken on waxed paper and season it with salt, pepper, and garlic.", "description": "Tear a large sheet of waxed paper and place it on your work surface. Lay 6 thin-sliced pieces of chicken breast in a single layer on the paper. Each piece should be at least 3 inches (7.6 cm) wide. Sprinkle salt, pepper, and garlic powder according to your taste over both sides of each chicken piece.", "img": "https://www.wikihow.com/images/thumb/1/19/Cook-Thin-Sliced-Chicken-Breast-Step-12.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-12.jpg"}, {"summary": "Fold slices of deli ham and lay them on the chicken.", "description": "Take out 6 pieces of thinly-sliced deli ham. Fold each piece in half or thirds and set 1 piece of ham on each piece of chicken. The ham shouldn't go over the sides of the chicken piece or it will need to be folded more.", "img": "https://www.wikihow.com/images/thumb/c/ca/Cook-Thin-Sliced-Chicken-Breast-Step-13.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-13.jpg"}, {"summary": "Fold slices of cheese and lay them on the ham.", "description": "Get out 6 thinly-sliced pieces of deli cheese and fold them in half. Set 1 folded piece of cheese on top of the folded ham slice. Do this for each piece of chicken.", "img": "https://www.wikihow.com/images/thumb/8/8b/Cook-Thin-Sliced-Chicken-Breast-Step-14.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-14.jpg"}, {"summary": "Roll up each piece of chicken with the cheese and ham.", "description": "Use your fingertips to fold the edge of chicken that's closest to you up and over the ham and cheese. Keep rolling the chicken away from you until it makes a tight cylinder. Set the piece back down on the waxed paper and roll up the remaining pieces of chicken. Ensure that it's seam-side down so the roll-up stays secure.", "img": "https://www.wikihow.com/images/thumb/9/92/Cook-Thin-Sliced-Chicken-Breast-Step-15.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-15.jpg"}, {"summary": "Create a dredging station of egg, flour, and breadcrumbs.", "description": "Set 3 shallow baking pans or dishes on your work surface. Measure 1/2 cup (64 g) of flour into the first pan. Crack 1 egg into the middle pan and whisk it until it's blended. Pour 1 cup (50 g) of fresh bread crumbs into the last pan. If you'd like the roll-ups to have a little crunch, include a handful of panko breadcrumbs with the fresh breadcrumbs.", "img": "https://www.wikihow.com/images/thumb/b/b0/Cook-Thin-Sliced-Chicken-Breast-Step-16.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-16.jpg"}, {"summary": "Coat each roll-up in the flour, egg, and breadcrumbs.", "description": "Cover 1 chicken roll-up with the flour in the first baking dish. Then, lower it into the beaten egg so it's coated. Lift the roll-up out of the egg and into the dish with breadcrumbs. Cover the roll-up completely with the breadcrumbs. Repeat this for each roll-up.", "img": "https://www.wikihow.com/images/thumb/a/a0/Cook-Thin-Sliced-Chicken-Breast-Step-17.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-17.jpg"}, {"summary": "Secure each roll-up with a toothpick and arrange them on the sheet.", "description": "Stick 1 toothpick into each end of the roll-up to seal the ends shut. This will stop the cheese from oozing out as it cooks. Place each roll-up on the greased baking sheet so the seam is facing down. Leave at least 1 inch (2.5 cm) of space between each roll-up.", "img": "https://www.wikihow.com/images/thumb/6/66/Cook-Thin-Sliced-Chicken-Breast-Step-18.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-18.jpg"}, {"summary": "Bake the chicken roll-ups for 25 minutes.", "description": "Put the baking sheet in the preheated oven and cook the chicken roll-ups until the outside is golden brown and chicken is completely cooked. You can check the internal temperature of the chicken. The chicken should reach 160 °F (71 °C) with an instant-read thermometer.", "img": "https://www.wikihow.com/images/thumb/f/f0/Cook-Thin-Sliced-Chicken-Breast-Step-19.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-19.jpg"}, {"summary": "Serve the chicken cordon bleu roll-ups.", "description": "Remove the baking sheet from the oven and transfer the hot roll-ups to serving plates. Serve them with a green salad, roasted vegetables, or a creamy sauce. While you can store leftover roll-ups in an airtight container in the refrigerator for 1 to 2 days, they'll lose their crunch as they're stored.", "img": "https://www.wikihow.com/images/thumb/f/f5/Cook-Thin-Sliced-Chicken-Breast-Step-20.jpg/v4-459px-Cook-Thin-Sliced-Chicken-Breast-Step-20.jpg"}]}}