{"conversation": [{"text": "what recipe would you like to cook", "evidence": ["Recipe "], "id": "Agent", "dialog_act": "ask question"}, {"text": "I would like to make dumpling for a soup do ypu have a recipe", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes I have a recipe for soup dumplings", "evidence": ["Recipe "], "id": "Agent", "dialog_act": "answer question"}, {"text": "great whats the recipe please", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Whisk 2 cups of flour, in a bowl with 1 and a half teaspoons of salt and 1 tablespoon of baking powder", "evidence": ["2 cups (240 g) of flour into a bowl along with 1 1/2 teaspoons (8.5 g) of salt and 1 tablespoon (12 g) of baking powder."], "id": "Agent", "dialog_act": "answer question"}, {"text": "great whats the next step", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "mix the dry ingredients with a whisk or a fork", "evidence": ["Whisk the dry ingredients until they're combined. If you don't have a whisk, you can use a fork."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "just mix them all in the same bowl", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes in the same bowl", "evidence": ["into a bowl"], "id": "Agent", "dialog_act": "answer question"}, {"text": "sounds simple thanks what do I do when the ingredients are mixed", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "pour 2 tablespoons of vegtable oil and 1 cup of warm water into thr dry ingredients use a spoon to mix the batter until it is smooth if the mixture is still a little dry you can add a little more water", "evidence": ["Stir in the vegetable oil and water"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "when will I know if the batter is smooth enough the mixture still seems a little thick and bland", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "just keep adding a little more water till it is a thick yougurt consistancy", "evidence": ["add 1 tablespoon (15 ml) of water at a time until the batter is smooth."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have done this seems to be smoother now hope thie tatses better than it looks do I add any other ingredients", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Take a spoonful of the smooth batter and add it to your hot soup or stew", "evidence": ["Take a spoon and scoop about 1 tablespoon (15 ml) of the batter. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "that was a really simple recipe wow really easy to make and using simple everyday ingredients its looking good in with stew smells wonderful", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Yes it's a very quick and simple recipe and it tastes great", "evidence": ["flour, salt, and baking powder.", "vegetable oil and water"], "id": "Agent", "dialog_act": "other"}, {"text": "How long do I have to cook them for", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "5 minutes if you put the lid on the pot it will help them to cook and take in the flavours of your stew", "evidence": ["5 minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you so much they look and smell amazing this was a very quick process and I am grateful for you help do you have any serving suggestions", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Just serve in a bowl or plate with your stew you can also save any leftover dumplings in an airtight container in the fridge for 3 days", "evidence": ["serve the soup or stew with the dumplings"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Avoides any food waste always good to know thank you it looks and smells good in the bowl thank you for your help and useful advice", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "can I help you with anything else today", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "No thanks that everything I need for today I have enjoyed cooking this simple recipe", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Have a good evening goodbye", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "will be back again for more recipes I am sure goodbye for now", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Dumplings for Soup", "url": "https://www.wikihow.com/Make-Dumplings-for-Soup", "category": ["Food and Entertaining", "Recipes", "Soups"], "procedure": [{"summary": "Whisk the flour, salt, and baking powder.", "description": "Put 2 cups (240 g) of flour into a bowl along with 1 1/2 teaspoons (8.5 g) of salt and 1 tablespoon (12 g) of baking powder. Whisk the dry ingredients until they're combined. If you don't have a whisk, you can use a fork.", "img": "https://www.wikihow.com/images/thumb/7/70/Make-Dumplings-for-Soup-Step-1-Version-2.jpg/550px-nowatermark-Make-Dumplings-for-Soup-Step-1-Version-2.jpg"}, {"summary": "Stir in the vegetable oil and water.", "description": "Pour 2 tablespoons (30 ml) of vegetable oil and 1 cup (240 ml) of warm water into the dry ingredients. Use a spoon to mix the batter until it's smooth. If the batter is still dry, add 1 tablespoon (15 ml) of water at a time until the batter is smooth.", "img": "https://www.wikihow.com/images/thumb/3/34/Make-Dumplings-for-Soup-Step-2-Version-2.jpg/550px-nowatermark-Make-Dumplings-for-Soup-Step-2-Version-2.jpg"}, {"summary": "Drop spoonfuls of the batter onto your hot soup or stew.", "description": "You should have a pot of soup or stew simmering on the stove. Take a spoon and scoop about 1 tablespoon (15 ml) of the batter. Drop the spoonful of batter directly onto the hot soup or stew. You should get about 20 small dumplings. Try to leave at least 1/2 in (1.3 cm) of space in between each dumpling.", "img": "https://www.wikihow.com/images/thumb/c/c6/Make-Dumplings-for-Soup-Step-3-Version-2.jpg/550px-nowatermark-Make-Dumplings-for-Soup-Step-3-Version-2.jpg"}, {"summary": "Cover and simmer the dumplings for about 5 minutes.", "description": "Put the lid on your soup or stew and leave the dumplings to cook. Covering the pot will help the dumplings steam a little.", "img": "https://www.wikihow.com/images/thumb/2/26/Make-Dumplings-for-Soup-Step-4-Version-2.jpg/550px-nowatermark-Make-Dumplings-for-Soup-Step-4-Version-2.jpg"}, {"summary": "Check the dumplings and serve them.", "description": "Remove the lid and insert a knife or toothpick into the center of a dumpling. It should come out clean without any of the batter sticking to the knife or toothpick. Turn off the burner and serve the soup or stew with the dumplings. If the knife or toothpick has batter on it, cover and cook the dumplings for another 2 minutes before you check them again. Refrigerate the leftover dumplings in an airtight container for up to 3 days.", "img": "https://www.wikihow.com/images/thumb/e/e7/Make-Dumplings-for-Soup-Step-5-Version-2.jpg/550px-nowatermark-Make-Dumplings-for-Soup-Step-5-Version-2.jpg"}]}}