{"conversation": [{"text": "Hi!  Are you ready to start baking some whole wheat sugar cookies?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes.  Let's get started.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "OK.  First of all, let's preheat the oven to 375F (175C).  And while it is warming up get 2 baking sheets. ready", "evidence": ["Turn on the oven to 375 degrees F (175 C).", "You'll need to have a few baking sheets ready to put the cookies on."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK oven on and baking sheets ready.  Do the baking sheets need to be greased?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No - you won't need to grease them.  But if you've had trouble with cookies sticking to the sheets before, you could use some parchment paper to cover them and that will prevent sticking.", "evidence": ["You won't need to grease or spray the baking sheets. If your cookies frequently stick to the pans, consider laying a sheet of parchment paper on the pans."], "id": "Agent", "dialog_act": "answer question"}, {"text": "OK - all ready.  What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Let's gather your ingredients.  You'll need 1 cup (200 g) of granulated sugar 1 teaspoon of baking powder ½ teaspoon of salt ½ teaspoon of ground nutmeg ½ teaspoon of baking soda 2 tablespoons (30 ml) of milk 1 tablespoon of lemon or orange zest 1 teaspoon of vanilla ½ cup (113 g) of butter, softened 1 egg and 2 cups (260g) of wheat flour.", "evidence": ["ou'll need: 1 cup (200 g) of granulated sugar 1 teaspoon of baking powder ½ teaspoon of salt ½ teaspoon of ground nutmeg ½ teaspoon of baking soda 2 tablespoons (30 ml) of milk 1 tablespoon of lemon or orange zest 1 teaspoon of vanilla ½ cup (113 g) of butter, softened 1 egg", " 2 cups (260 g) of whole-wheat flour."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK - what is a softened 1 egg?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Ah - the butter is the ingredient that needs to be softened.  You can do this by briefly microwaving or by removing from the fridge 30 minutes before you start baking.", "evidence": ["butter, softened 1 egg"], "id": "Agent", "dialog_act": "answer question"}, {"text": "OK.  What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Grab a large bowl and put all of the ingredients except for the flour ito the bowl.  With an electric mixer, beat the ingredients on medium speed until all of the ingredients are combined.", "evidence": ["st measure out the most of the dough ingredients into the bowl. Beat them with an electric mixer on medium speed until they're combined. You'll need: 1 cup (200 g) of granulated sugar 1 teaspoon of baking powder ½ teaspoon of salt ½ teaspoon of ground nutmeg ½ teaspoon of baking soda 2 tablespoons (30 ml) of milk 1 tablespoon of lemon or orange zest 1 teaspoon of vanilla ½ cup (113 g) of butter, softened 1 egg"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK - I have a ixture.  Should I add the flour now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yes. Turn the speed to low on the mixer, add the flour and mix until all of the ingredients are combined.  Make sure there are no dry pockets.  Don't mix too much though or the cookies will be tough!!", "evidence": ["Turn the mixer speed down to low and gradually stir in 2 cups (260 g) of whole-wheat flour. Mix the dough together until the flour is incorporated and you don't see any dry pockets."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great.  All done! What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Is all the flour mixed in properly so there are no dry pockets?", "evidence": [" flour is incorporated and you don't see any dry pockets. ", " flour is incorporated and you don't see any dry pockets. "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes - it all looks mixed in now.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "OK - time to start making your cookies ready for baking.  First of all, using a cookie scoop (or 2 teaspoons)  measure out your dough a roll each portion between the palms of your hand to amke a small ball of dough.", "evidence": ["Use a cookie scoop or two teaspoons to measure out a few tablespoons of dough. Roll each portion of dough between the palms of your hands to make a smooth ball of dough"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK done.  Should I do the rest now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "How big is the ball?", "evidence": ["Roll each portion of dough between the palms of your hands to make a smooth ball of dough. Place all of the balls of dough on the ungreased cookie sheets and leave about 2-inches (5 cm) of space in between them. Each ball should be about 1-inch (2.5 cm) in size."], "id": "Agent", "dialog_act": "ask question"}, {"text": "About 1 inch in diameter", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Perfect!  Place the ball on the sheet and make the other balls the same size.  Make sure you leave 2inches (5cm) between each of the balls.", "evidence": ["Place all of the balls of dough on the ungreased cookie sheets and leave about 2-inches (5 cm) of space in between them."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK - all done.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Have you left 2 inches (5cm) of space between each ball?", "evidence": ["n the ungreased cookie sheets and leave about 2-inches (5 cm) of space in between them. "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes I have - there is plenty of space for them to grow.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "OK - time to make tem more cookie shaped.  Take the palm of your hand and slightly flatten them.", "evidence": ["Use the palm of your hand or a glass to slightly flatten each ball of dough a little"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How flat?  Like 5mm thick?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No - they will be crispy and brittle if you do that.  About 1cm thick will ensure they remain soft and delcious.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ah OK.  They are all done and there is plenty of space between each cookie.  Should I put them in the oven now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Not yet.  Time to add a little flavour first.  What flavour shall we add?", "evidence": ["Mix together the remaining 2 tablespoons of sugar and 1/2 teaspoon of cinnamon in a small bowl. Sprinkle the cinnamon-sugar mixture over the cookies. You could also play around with the flavors. Try substituting ground nutmeg or cocoa for the cinnamon."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Do you have any suggestions?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "How about ground nutmeg or cocoa?  I love cinammon.", "evidence": ["Try substituting ground nutmeg or cocoa for the cinnamon."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I like cinammon too.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "OK.  Mix 1/2 a teaspoon of cinammon with 2 tablespoons of sugar in a small bowl.  Sprinkle the mixture over the cookies.", "evidence": ["Mix together the remaining 2 tablespoons of sugar and 1/2 teaspoon of cinnamon in a small bowl. Sprinkle the cinnamon-sugar mixture over the cookies. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Excellent.  All done.  It already smells good.  Time for the oven now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "That's right.  Put them in the oven for 8 minutes and then check on them to see if they are finished baking.", "evidence": ["Place the cookies in the preheated oven and bake them for 8 to 10 minutes. The cookies should puff up and crack a little bit once they're baked. They'll also turn light brown around the edges."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK.  It's been 8 minutes.  They look pretty good.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Have they puffed up and cracked around the edges?", "evidence": ["puff up and crack a little bit once they're baked."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes - and they smell amazing.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Fantastic.  Have the also turned golden brown at the edges?", "evidence": ["They'll also turn light brown around the edges. "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes - I think they are ready.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Great.  Time to take them out of the oven.  Put them onto a wire rack to cool.  You should probably leave them for 30 minutes to cool properly.  But we both know you are going to eat one wtin the first 5 minutes.  Go head, you deserve it!  And there you have it - you've finished cooking your cookies.  I hope you've enjoyed cooking with me and I know you are going to love eatng the cookies.", "evidence": ["Remove them from the oven and let them cool on a wire rack."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes.  They smelled so good tht I couldn't resist testing one and it was delicious.  Thanks for helping me bake today.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great.  I'm glad you enjoyed cooking ith me.  I look forward to doing it again.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you for your help and goodbye!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Whole Wheat Sugar Cookies", "url": "https://www.wikihow.com/Make-Whole-Wheat-Sugar-Cookies", "category": ["Food and Entertaining", "Recipes", "Baking", "Cookies and Biscuits", "Sugar Cookies and Biscuits"], "procedure": [{"summary": "Preheat the oven and get out your baking sheets.", "description": "Turn on the oven to 375 degrees F (175 C). You'll need to have a few baking sheets ready to put the cookies on. You won't need to grease or spray the baking sheets. If your cookies frequently stick to the pans, consider laying a sheet of parchment paper on the pans.", "img": "https://www.wikihow.com/images/thumb/f/f8/Make-Whole-Wheat-Sugar-Cookies-Step-9.jpg/v4-459px-Make-Whole-Wheat-Sugar-Cookies-Step-9.jpg"}, {"summary": "Measure and combine most of the dough ingredients.", "description": "Since this easy whole wheat sugar cookie recipe comes together in one large mixing bowl, just measure out the most of the dough ingredients into the bowl. Beat them with an electric mixer on medium speed until they're combined. You'll need:\n1 cup (200 g) of granulated sugar\n1 teaspoon of baking powder\n½ teaspoon of salt\n½ teaspoon of ground nutmeg\n½ teaspoon of baking soda\n2 tablespoons (30 ml) of milk\n1 tablespoon of lemon or orange zest\n1 teaspoon of vanilla\n½ cup (113 g) of butter, softened\n1 egg", "img": "https://www.wikihow.com/images/thumb/8/8b/Make-Whole-Wheat-Sugar-Cookies-Step-10.jpg/v4-460px-Make-Whole-Wheat-Sugar-Cookies-Step-10.jpg"}, {"summary": "Stir in the flour and finish mixing the dough.", "description": "Turn the mixer speed down to low and gradually stir in 2 cups (260 g) of whole-wheat flour. Mix the dough together until the flour is incorporated and you don't see any dry pockets. Avoid over mixing the dough since this can make the cookies tough.", "img": "https://www.wikihow.com/images/thumb/0/07/Make-Whole-Wheat-Sugar-Cookies-Step-11.jpg/v4-460px-Make-Whole-Wheat-Sugar-Cookies-Step-11.jpg"}, {"summary": "Roll the cookies into balls.", "description": "Use a cookie scoop or two teaspoons to measure out a few tablespoons of dough. Roll each portion of dough between the palms of your hands to make a smooth ball of dough. Place all of the balls of dough on the ungreased cookie sheets and leave about 2-inches (5 cm) of space in between them. Each ball should be about 1-inch (2.5 cm) in size.", "img": "https://www.wikihow.com/images/thumb/7/7b/Make-Whole-Wheat-Sugar-Cookies-Step-12.jpg/v4-460px-Make-Whole-Wheat-Sugar-Cookies-Step-12.jpg"}, {"summary": "Sprinkle the cookies with cinnamon-sugar.", "description": "Use the palm of your hand or a glass to slightly flatten each ball of dough a little. Mix together the remaining 2 tablespoons of sugar and 1/2 teaspoon of cinnamon in a small bowl. Sprinkle the cinnamon-sugar mixture over the cookies. You could also play around with the flavors. Try substituting ground nutmeg or cocoa for the cinnamon.", "img": "https://www.wikihow.com/images/thumb/3/37/Make-Whole-Wheat-Sugar-Cookies-Step-13.jpg/v4-460px-Make-Whole-Wheat-Sugar-Cookies-Step-13.jpg"}, {"summary": "Bake the whole wheat sugar cookies.", "description": "Place the cookies in the preheated oven and bake them for 8 to 10 minutes. The cookies should puff up and crack a little bit once they're baked. They'll also turn light brown around the edges. Remove them from the oven and let them cool on a wire rack. If you have to bake the cookies in batches, avoid placing cold cookie dough on hot baking sheets. Let the sheets cool completely before using them again.", "img": "https://www.wikihow.com/images/thumb/c/c2/Make-Whole-Wheat-Sugar-Cookies-Step-14.jpg/v4-460px-Make-Whole-Wheat-Sugar-Cookies-Step-14.jpg"}]}}