{"conversation": [{"text": "Wash and cut the oranges. Wash 4 oranges and use a sharp knife to cut each orange into four pieces or wedges.", "evidence": ["Wash and cut the oranges."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What type of orange can I use? Clementine or something else?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It doesn't specify the type of orange, however if you're concerned about consuming pesticides you could use organic oranges for this recipe.", "evidence": ["Wash and cut the oranges.", "If you're concerned about consuming pesticides, use organic oranges in this recipe."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, which step is next in the recipe?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, peel and cut the peels into long, narrow strips, which should be about 1/4 inch in width each, 0.6cm or 6mm.", "evidence": ["Peel and cut the peels into strips.", "Use a knife to cut the peels into long, narrow strips. They should be about ⁄4 inch (0.6 cm) (6 mm) wide."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is there anything else I need to know about cutting the peels? Also, I'm thinking of making this candied orange peel recipe for a friend's birthday but can I store these peels for another day?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, you should also take a spoon and scrape away as much white pith as you can. You can save the orange peels for your friends birthday in order to complete the recipe at the time, or you could eat the fruit.", "evidence": ["Take a spoon and scrape away as much of the white pith as you can.", "You can eat the fruit or save it to use in another recipe."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok thankyou, what do I do next? I've heard before that candied orange peel is boiled? Is this what comes next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You're correct, the next part of the recipe is that you should boil the orange peel in a large saucepan on a high heat. Cover them with enough water and then bring to a boil.", "evidence": ["Boil and drain the strips.", "Place the strips of orange peel into a large saucepan and pour in enough water to cover them.", "Turn the heat on to high and bring the water to a boil."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What do I do after boiling the orange peel, is the water needed for something else within the recipe?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "After you've boiled the orange peel, take the saucepan of the hob, place a colander in the sink and then drain the water through the colander, so that the orange peels just remain. The next step after this is to fill the pot again with new water with the same orange peels covered by the water, and then to boil and drain again. Could you do this three more times please, this removes the peels bitterness.", "evidence": ["When the water boils, you can turn off the heat and place a colander in the sink. Drain the water through the colander and return the strips to the saucepan.", "Boil and drain the strips two more times.", "Fill the pot with new water so the orange peel strips are covered. Bring the water to boil and drain it again. Repeat this another time for a total of three times.", "Drain the strips into the colander. Boiling the strips and draining them three times removes the bitterness from the peel."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok done, but how do I create the syrup for creating the candied orange peel?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "To create the candied orange peel, syrup is needed as you say, to do this place 3 cups of sugar into a empty saucepan. This is 600 grams when converted. And also place 1 cup or 240 ml of water into the saucepan at the same time. Stir the mixture, and turn the heat to high so that the sugary water begins to boil. It will then change into syrup.", "evidence": ["Create a simple syrup.", "Place 3 cups (600 g) of sugar into the empty saucepan and pour in 1 cup (240 ml) of water.", "Stir the mixture and turn the heat to high so it begins to boil. The sugar should dissolve and turn into a syrup."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Once just about boiling, what should I do? Do I keep the orange peel boiling on the hob?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Ok so, you should have taken the orange peel of the hob, is you haven't could you do so now? Then check the temperature of the syrup. Wait until it's at 230 degrees Fahrenheit, or 110 degrees Celsius before stirring in your pre boiled orange peel. You should keep this peel simmering on a lower heat, slightly bubbling for 30 minutes.", "evidence": ["Add the strips and simmer them for 30 minutes.", "Insert an instant-read thermometer to check the temperature of the syrup.", "Once the temperature is at 230 degrees F (110 degrees C), stir in the orange peel strips. Turn the heat down to a gentle bubble and let the strips simmer for about 30 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "They're becoming slightly clear, is this a good sign?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's good, the strips should become slightly clear once they're nearly finished cooking. Keep them on still, you might find you need more cooking time if you live in a high elevated area.", "evidence": ["The strips should become almost clear once they've finished cooking."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I've finished cooking the orange peel on the hob, what next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You now need to dry the strips for 4 to 5 hours, so turn off the heat, and use a slotted spoon to scoop them out the saucepan and onto a wire rack. These peel need to completely dry out, so I would say do something whilst you wait. If you want an extra crunch you could roll the strips in some granulated sugar before drying them. After this you can use or store the candied orange peel,", "evidence": ["Dry the strips for 4 to 5 hours.", "Turn off the heat and use a slotted spoon to scoop the orange peel strips out of the saucepan. Place them in a single layer on a wire rack and let them cool for 4 to 5 hours. They should completely dry out.", "For an extra crunch, you can roll the strips in some granulated sugar before you dry them.", "Eat the strips or garnish desserts with them as soon as they're dried. You can store the leftover candied orange strips in an airtight container for up to 3 months."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "And how long do these last before they go out of date?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "They last up to 3 months when stored in an airtight container. For your friends party you could also have the candied orange peel dipped into melted chocolate as a snack, or you could do this today and then store them covered in chocolate in the fridge. And that's the recipe, you now have candied orange peel.", "evidence": ["You can store the leftover candied orange strips in an airtight container for up to 3 months.", "You can also dip the candied orange strips in melted chocolate. Let the chocolate harden and eat the strips or store them in the refrigerator."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you for the recipe", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Candied Orange Peel", "url": "https://www.wikihow.com/Make-Candied-Orange-Peel", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Citrus Fruits"], "procedure": [{"summary": "Wash and cut the oranges.", "description": "Wash 4 oranges and use a sharp knife to cut each orange into four pieces or wedges. If you're concerned about consuming pesticides, use organic oranges in this recipe.", "img": "https://www.wikihow.com/images/thumb/c/c1/Make-Candied-Orange-Peel-Step-11-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-11-Version-2.jpg"}, {"summary": "Peel and cut the peels into strips.", "description": "Pull the fruit away from the peels. Take a spoon and scrape away as much of the white pith as you can. Use a knife to cut the peels into long, narrow strips. They should be about ⁄4 inch (0.6 cm) (6 mm) wide. You can eat the fruit or save it to use in another recipe.", "img": "https://www.wikihow.com/images/thumb/b/b6/Make-Candied-Orange-Peel-Step-12-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-12-Version-2.jpg"}, {"summary": "Boil and drain the strips.", "description": "Place the strips of orange peel into a large saucepan and pour in enough water to cover them. Turn the heat on to high and bring the water to a boil. When the water boils, you can turn off the heat and place a colander in the sink. Drain the water through the colander and return the strips to the saucepan.", "img": "https://www.wikihow.com/images/thumb/6/60/Make-Candied-Orange-Peel-Step-13-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-13-Version-2.jpg"}, {"summary": "Boil and drain the strips two more times.", "description": "Fill the pot with new water so the orange peel strips are covered. Bring the water to boil and drain it again. Repeat this another time for a total of three times. Drain the strips into the colander. Boiling the strips and draining them three times removes the bitterness from the peel.", "img": "https://www.wikihow.com/images/thumb/8/88/Make-Candied-Orange-Peel-Step-14-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-14-Version-2.jpg"}, {"summary": "Create a simple syrup.", "description": "Place 3 cups (600 g) of sugar into the empty saucepan and pour in 1 cup (240 ml) of water. Stir the mixture and turn the heat to high so it begins to boil. The sugar should dissolve and turn into a syrup.", "img": "https://www.wikihow.com/images/thumb/4/48/Make-Candied-Orange-Peel-Step-15-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-15-Version-2.jpg"}, {"summary": "Add the strips and simmer them for 30 minutes.", "description": "Insert an instant-read thermometer to check the temperature of the syrup. Once the temperature is at 230 degrees F (110 degrees C), stir in the orange peel strips. Turn the heat down to a gentle bubble and let the strips simmer for about 30 minutes. The strips should become almost clear once they've finished cooking. If you live at a high elevation, you may need a much longer cooking time.", "img": "https://www.wikihow.com/images/thumb/3/3f/Make-Candied-Orange-Peel-Step-16.jpg/v4-460px-Make-Candied-Orange-Peel-Step-16.jpg"}, {"summary": "Dry the strips for 4 to 5 hours.", "description": "Turn off the heat and use a slotted spoon to scoop the orange peel strips out of the saucepan. Place them in a single layer on a wire rack and let them cool for 4 to 5 hours. They should completely dry out. For an extra crunch, you can roll the strips in some granulated sugar before you dry them.", "img": "https://www.wikihow.com/images/thumb/c/c3/Make-Candied-Orange-Peel-Step-17.jpg/v4-460px-Make-Candied-Orange-Peel-Step-17.jpg"}, {"summary": "Use or store the candied orange strips.", "description": "Eat the strips or garnish desserts with them as soon as they're dried. You can store the leftover candied orange strips in an airtight container for up to 3 months. You can also dip the candied orange strips in melted chocolate. Let the chocolate harden and eat the strips or store them in the refrigerator.", "img": "https://www.wikihow.com/images/thumb/f/f3/Make-Candied-Orange-Peel-Step-18.jpg/v4-460px-Make-Candied-Orange-Peel-Step-18.jpg"}]}}