{"conversation": [{"text": "We are going to learn how to smoke potatoes", "evidence": ["Place 2 cups (500 ml) of untreated wood chips in a large bowl and cover them with water. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "how many potatoes do I need to start with?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "it really depends on the size of your smoker, but we will start with 6 today", "evidence": ["amounts provided here are only estimates"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, what is the first step, now that I have my ingredients", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Put your wood chips in the bowl to soak", "evidence": ["Place 2 cups (500 ml) of untreated wood chips in a large bowl and cover them with water."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "what kind of wood chips are best?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "What kind of wood chips are you used to using?", "evidence": ["Mesquite and alder wood chips are recommended for use with this recipe.", "Mesquite and alder wood chips are recommended for use with this recipe."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I used to use cedar but it always tasted wrong", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "we are using mesquite today", "evidence": ["Mesquite and alder wood chips are recommended "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I don't have mesquite", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "do you have alder wood chips?", "evidence": ["alder wood "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "yes, but they are pre-soaked", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "great! we can go onto the next step!  Is your smoker filled up with fuel?", "evidence": ["does not need to be done if you are using pre-soaked wood chips."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, it is filled up and preheated, what temperature do you recommend?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "let it cool down to about 250 degrees Fahrenhieit or 130 Celsius", "evidence": ["about 250 degrees Fahrenheit "], "id": "Agent", "dialog_act": "answer question"}, {"text": "okay, so how do I prepare the potatoes?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "first you prick holes in the potatoes with your fork to vent the air, about 8 to 12 times per potatoe", "evidence": ["Stab each potato with a metal fork 8 to 12 times"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "ok, what else do I do with the potatoes now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "melt some butter and rub it over the surface of the potatoes.  Do you prefer spicy potatoes?", "evidence": [" rub the melted butter"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Not really, I am pretty basic in my spices", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "that is fine, you can just use salt and pepper to your taste", "evidence": ["Season well with salt and pepper. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I am on a low sodium diet, can I use salt substitute?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I am sure that salt substitute will work, it is really up to your personal taste.  Potatoes ready to go now?", "evidence": [" salt and pepper amounts provided here are only estimates"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, they are buttered and seasoned", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "okay, time to put the potatoes in the smoker, but make sure to leave enough space between them to have good air flow around each potatoe", "evidence": ["arefully arrange the potatoes over the smoker rack"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "how long do I leave them in for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "depending on the smoker, they should be ready in about 60 minutes, you will tell if they are cooked when the are tender to the touch.  Did you plan to put anything special on the potatoes or just eat them as is?", "evidence": ["roughly 60 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I love sour cream and chives, is there anything else you suggest?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "sounds yummy, I like sour cream, cheese and bacon, or if you are feeling adventursome, salsa is nice too!", "evidence": [" add butter, sour cream, cheese, chives, bacon, or any other desired toppings."], "id": "Agent", "dialog_act": "answer question"}, {"text": "oh, that sounds great, I will try that next time", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Well, that should cover our lesson on smoked potatoes, I hope you enjoy and come back soon!", "evidence": [" Enjoy the smoked potato"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Thanks for your help!", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thanks again, nice chatting with you!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Smoke Potatoes", "url": "https://www.wikihow.com/Smoke-Potatoes", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Potato Dishes"], "procedure": [{"summary": "Soak wood chips in water.", "description": "Place 2 cups (500 ml) of untreated wood chips in a large bowl and cover them with water. Allow the chips to soak for 30 minutes. Mesquite and alder wood chips are recommended for use with this recipe. Note that this step does not need to be done if you are using pre-soaked wood chips.", "img": "https://www.wikihow.com/images/thumb/0/06/Smoke-Potatoes-Step-1.jpg/v4-460px-Smoke-Potatoes-Step-1.jpg"}, {"summary": "Fuel the smoker.", "description": "Fill the smoker with the appropriate fuel. The exact source of fuel will vary depending on the type of smoker you have. For a charcoal smoker, fill the charcoal tray with an even layer of coals. For a gas smoker, attach an appropriately sized propane tank. For an electrical smoker, plug the power supply into an outlet.", "img": "https://www.wikihow.com/images/thumb/2/2e/Smoke-Potatoes-Step-2.jpg/v4-460px-Smoke-Potatoes-Step-2.jpg"}, {"summary": "Preheat the smoker to 250 degrees Fahrenheit (130 degrees Celsius).", "description": "Light the coals or turn on the heat source. After the smoker achieves a high and steady heat, reduce the heat to about 250 degrees Fahrenheit (130 degrees Celsius). Open the air vents when you start preheating the smoker. Allow the smoker to heat up for 20 to 30 minutes, at which point it will be about 400 degrees Fahrenheit (200 degrees Celsius). Turn the air vents so that they are almost completely closed. This should cause the temperature to drop. Watch the thermometer and wait until it drops between 250 and 275 degrees Fahrenheit (130 and 135 degrees Celsius).", "img": "https://www.wikihow.com/images/thumb/0/04/Smoke-Potatoes-Step-3.jpg/v4-460px-Smoke-Potatoes-Step-3.jpg"}, {"summary": "Prick each potato.", "description": "Stab each potato with a metal fork 8 to 12 times, spacing the marks evenly around the surface of the potato. This step should be done while the smoker is preheating. Piercing the skin of the potato allows steam to escape from the spud during the cooking process. While rare, potatoes can theoretically explode while being cooked if the skin is left intact.", "img": "https://www.wikihow.com/images/thumb/5/5f/Smoke-Potatoes-Step-4.jpg/v4-460px-Smoke-Potatoes-Step-4.jpg"}, {"summary": "Season well.", "description": "Brush or rub the melted butter evenly over each potato. Season well with salt and pepper. Use enough butter to coat the entire surface of each potato. The salt and pepper amounts provided here are only estimates. You can actually use as much salt and pepper as desired.", "img": "https://www.wikihow.com/images/thumb/5/5f/Smoke-Potatoes-Step-5.jpg/v4-460px-Smoke-Potatoes-Step-5.jpg"}, {"summary": "Place the chips in your smoker.", "description": "Spread the soaked wood chips over the bottom of the smoker. If you removed the rack when fueling the smoker, return the rack to its appropriate position now. When using a gas smoker, it is recommended that you place the wood chips in a foil packet instead of laying them directly on the bottom of the appliance. Use a fork to poke holes in the top of the packet six to eight times, then place the packet near the heat source. Wait until the wood chips begin to smoke before proceeding.", "img": "https://www.wikihow.com/images/thumb/d/df/Smoke-Potatoes-Step-6.jpg/v4-460px-Smoke-Potatoes-Step-6.jpg"}, {"summary": "Place the potatoes directly on the smoker rack.", "description": "Once the smoker and potatoes are all ready, carefully arrange the potatoes over the smoker rack. Keep the potatoes in a single layer and try to keep at least 1 inch (2.5 cm) of space in between them. Better air flow will result in better, more even cooking.", "img": "https://www.wikihow.com/images/thumb/d/d3/Smoke-Potatoes-Step-7.jpg/v4-460px-Smoke-Potatoes-Step-7.jpg"}, {"summary": "Cook for 1 hour.", "description": "Close the smoker and smoke the potatoes for roughly 60 minutes. The vents should be partially closed while you smoke the potatoes. When ready, the potatoes should have the same tender consistency as a baked or microwaved potato. They should \"give\" a little when squeezed without completely falling apart.", "img": "https://www.wikihow.com/images/thumb/2/29/Smoke-Potatoes-Step-8.jpg/v4-460px-Smoke-Potatoes-Step-8.jpg"}, {"summary": "Serve warm.", "description": "Remove the finished potatoes from the smoker and serve within several minutes. Enjoy the smoked potato in the same way you would enjoy a baked potato. Slice it open and add butter, sour cream, cheese, chives, bacon, or any other desired toppings.", "img": "https://www.wikihow.com/images/thumb/5/51/Smoke-Potatoes-Step-9.jpg/v4-460px-Smoke-Potatoes-Step-9.jpg"}]}}