{"conversation": [{"text": "The pan should be on low heat", "evidence": ["melting it over low heat"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay. How long do I cook for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Until the bubbling stops. Should be around 30-40 minutes.", "evidence": ["until the bubbling stops and the liquid turns clear, about 30-40 minutes for 1 lb (0.45 kg) of butter."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks. What do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Heat your coconut or canola oil.", "evidence": ["Whichever you choose, pour just enough oil to cover the base of a large pan. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Which one should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Canola oil has less saturated fat and a higher smoking point, but coconut oil is more old-school.", "evidence": ["Coconut oil used to be the standard in movie theaters (and many still use it), but you may wish to follow a more recent trend and switch to canola oil, which has less saturated fat and a higher smoking point."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I'll go with canola oil. What should I do with it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Cover the base of a large pan with it and heat it up until it shimmers!", "evidence": ["Whichever you choose, pour just enough oil to cover the base of a large pan. Heat on a stovetop until the oil shimmers. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Am I doing this right?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I'm not sure what you mean. If the oil is warm, it should be ready for the popcorn.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "How much popcorn should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Use one-third cup of popcorn kernels for a 6 quart pot.", "evidence": ["Use ⅓ cup (80 mL) popcorn kernels for a 6 quart (5.6 L) pot."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I put the kernels in the pan. Now what?", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Movie Butter for Your Popcorn", "url": "https://www.wikihow.com/Make-Movie-Butter-for-Your-Popcorn", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy", "Butter and Ghee"], "procedure": [{"summary": "Choose your salt.", "description": "Many movie theaters use salt processed using the Alberger process, as the many jagged edges on the salt crystals help it stick to the popcorn. Diamond Crystal is the only consumer salt brand in the United States that uses this process. You can get a similar effect from extra-fine powdered salt, which is often sold as \"popcorn salt\" and stocked next to the popcorn. You can create powdered salt at home by grinding any salt in an electric coffee grinder, hand-turned salt mill, or mortar and pestle. If using a coffee grinder, grind a small amount of coffee beans afterward to remove the leftover salt.", "img": "https://www.wikihow.com/images/thumb/f/f6/Make-Movie-Butter-for-Your-Popcorn-Step-1.jpg/v4-460px-Make-Movie-Butter-for-Your-Popcorn-Step-1.jpg"}, {"summary": "Clarify butter.", "description": "Theaters that do use real butter (rather than butter-flavored oil) often use clarified butter. Clarification removes some moisture from the butter, which prevents the popcorn becoming soggy. You can clarify butter at home just by melting it over low heat until the bubbling stops and the liquid turns clear, about 30-40 minutes for 1 lb (0.45 kg) of butter. Strain the liquid through a damp cheesecloth and let cool to make clarified butter. Discard the milk solids left in the cheesecloth or at the bottom of the pan. The famous \"buttered popcorn\" smell of a movie theater comes from artificial butter flavor. Actual butter won't replicate this perfectly.", "img": "https://www.wikihow.com/images/thumb/9/95/Make-Movie-Butter-for-Your-Popcorn-Step-2.jpg/v4-460px-Make-Movie-Butter-for-Your-Popcorn-Step-2.jpg"}, {"summary": "Heat coconut oil or canola oil in a pan.", "description": "You may want to save the clarified butter for later drizzling, as it will likely brown or burn if you try to pop kernels in it. Coconut oil used to be the standard in movie theaters (and many still use it), but you may wish to follow a more recent trend and switch to canola oil, which has less saturated fat and a higher smoking point. Whichever you choose, pour just enough oil to cover the base of a large pan. Heat on a stovetop until the oil shimmers. Note that most theaters that use canola oil actually use a more hydrogenated version that contains more fat than consumer canola oil. If using coconut oil, the oil should melt completely. You'll need a pan with a lid, but you do not need to cover it now.", "img": "https://www.wikihow.com/images/thumb/e/ea/Make-Movie-Butter-for-Your-Popcorn-Step-3.jpg/v4-459px-Make-Movie-Butter-for-Your-Popcorn-Step-3.jpg"}, {"summary": "Make the popcorn.", "description": "Throw in a few unpopped kernels and cover the pot. Once these kernels have popped, add the rest of the popcorn. Use ⅓ cup (80 mL) popcorn kernels for a 6 quart (5.6 L) pot. Cover and heat, shaking occasionally, until most of the kernels are popped. Pour popped corn into a large bowl whenever the pot gets full. Leave the lid slightly ajar so some of the steam escapes, preventing soggy popcorn. To reduce the number of burned or unpopped kernels, remove from heat right after adding the kernels. Wait for thirty seconds so the kernels reach an even temperature, then return to heat.", "img": "https://www.wikihow.com/images/thumb/e/e2/Make-Movie-Butter-for-Your-Popcorn-Step-4.jpg/v4-460px-Make-Movie-Butter-for-Your-Popcorn-Step-4.jpg"}, {"summary": "Add the salt right after the popcorn is popped.", "description": "You'll need about ⅓ tsp (1.5 mL) of fine grained salt in this recipe. The exact size of the salt crystals affects the flavor, so you may need to adjust to taste. Add the salt right after the popcorn is popped, since the steam clinging to the popcorn will help the salt stick.", "img": "https://www.wikihow.com/images/thumb/1/1a/Make-Movie-Butter-for-Your-Popcorn-Step-5.jpg/v4-460px-Make-Movie-Butter-for-Your-Popcorn-Step-5.jpg"}, {"summary": "Toss in melted clarified butter.", "description": "Pour the popcorn into a large bowl. Add 1 or 2 tbsp (15–30 mL) room temperature clarified butter to the hot pan, according to taste. It should melt quickly in the hot pan without additional heat. Drizzle it onto the popcorn when the butter is still yellow or only slightly brown.", "img": "https://www.wikihow.com/images/thumb/c/cb/Make-Movie-Butter-for-Your-Popcorn-Step-6.jpg/v4-460px-Make-Movie-Butter-for-Your-Popcorn-Step-6.jpg"}]}}