{"conversation": [{"text": "Today we are going to make Jello", "evidence": ["Whisk together 1 cup (240 milliliters) of hot water with 1 packet of jello in a large bowl"], "id": "Agent", "dialog_act": "other"}, {"text": "can't wait, let's begin", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Whisk 240ml of hot water with one pack of jello. Whisk briskly until all the powder is dissolved", "evidence": ["Whisk together 1 cup (240 milliliters) of hot water with 1 packet of jello in a large bowl"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "ok, this is fun it's dissolved. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Ok, now slowly add 1 cup of cold water to the mix to help it begin setting", "evidence": ["Add 1 cup (240 milliliters) of cold water into the mixture"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh I see, that's cool. Am I doing it right?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Looks great, now pour your mixture into a jelly mould. If you like you can add fruit to make it even more delicious", "evidence": ["Pour the mixture into your desired mold and add some fruit, if desired"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "This is looking good, poured in and fruit added", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now place your jello  in the fridge to allow to cool until set. You can see if it's set by testing with a finger, if it doesn't stick it's ready!", "evidence": ["Place into the refrigerator and wait until it sets, at least 2 to 3 hours"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, jello in fridge and waiting", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Once the jello is set you can then turn it out. Dip the mold up tot the rim in warm water for 10 seconds and flip it onto the plate", "evidence": ["De-mold the jello and transfer it to a serving plate"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh ok, my jello isn't coming out. What do I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If you're having trouble removing the jello, repeat the 10 second dip into water and try again", "evidence": ["If it doesn't come out easily, dip the mold into warm water for another 10 seconds"], "id": "Agent", "dialog_act": "answer question"}, {"text": "oh ok, that worked thank you!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You may now serve and enjoy! Either as is or add some whipped cream or some fruit", "evidence": ["Serve the jello"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Lovely! Thank you so much!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Jello", "url": "https://www.wikihow.com/Make-Jello", "category": ["Food and Entertaining", "Recipes", "Desserts and Sweets", "Gelatin Desserts"], "procedure": [{"summary": "Whisk together 1 cup (240 milliliters) of hot water with 1 packet of jello in a large bowl.", "description": "Keep whisking until no powdery granules remain, about 2 to 3 minutes. If you are using a larger, 6-ounce (170 grams) packet of jello, use 2 cups (475 milliliters) of hot water instead. This recipe uses the sweetened, flavored jello packets. If you are working with regular gelatin, click here to learn how to make jello from scratch.", "img": "https://www.wikihow.com/images/thumb/e/ea/Make-Jello-Step-1-Version-2.jpg/v4-460px-Make-Jello-Step-1-Version-2.jpg"}, {"summary": "Add 1 cup (240 milliliters) of cold water into the mixture.", "description": "If you'd like to make the jello set faster, use enough ice cubes to fill 1 cup (240 milliliters). Keep in mind that the jello will start to set up rapidly, so you will need to work quickly. If you are using a larger, 6-ounce (170 grams) packet of jello, use 2 cups (475 milliliters) of cold water.", "img": "https://www.wikihow.com/images/thumb/c/cd/Make-Jello-Step-2-Version-2.jpg/v4-460px-Make-Jello-Step-2-Version-2.jpg"}, {"summary": "Pour the mixture into your desired mold and add some fruit, if desired.", "description": "Once you add the fruit, give the jello a quick stir to disperse the fruit. You can use a baking pan, a bowl, or even a fancy jello mold. You can also use any type of fruit you'd like. Grapes, berries, and orange pieces are great choices! If you are using a baking pan, choose one that is 9 by 12 inches (22.86 by 30.48 centimeters) or 8 by 8 inches (20.32 by 20.32 centimeters). This is great if you plan to cut the jello into fun shapes using cookie cutters. If you are using a fancy jello mold and would like to add some fruit, fill the mold with ½ inch (1.27 centimeters) of jello first, then add your desired fruit. Fill the mold the rest of the way with more jello; don't stir the fruit. This will give you a pretty design at the top of the mold.", "img": "https://www.wikihow.com/images/thumb/8/8f/Make-Jello-Step-3-Version-2.jpg/v4-460px-Make-Jello-Step-3-Version-2.jpg"}, {"summary": "Place into the refrigerator and wait until it sets, at least 2 to 3 hours.", "description": "Depending on how cold your fridge is and how much jello you made, this can take overnight. You can test if the jello is ready by pressing your finger against it. If the jello sticks to your finger, it's not ready. If it doesn't stick to your finger, it's ready.", "img": "https://www.wikihow.com/images/thumb/8/8f/Make-Jello-Step-4-Version-2.jpg/v4-460px-Make-Jello-Step-4-Version-2.jpg"}, {"summary": "De-mold the jello and transfer it to a serving plate.", "description": "Dip the mold all the way up to its rim in warm water. Wait 10 seconds, then flip the jello out of its mold and onto a plate. If it doesn't come out easily, dip the mold into warm water for another 10 seconds. If you poured the jello into individual bowls, you don't have to de-mold it. If you poured the jello into a baking pan, you can cut it into cubes, or use cookie cutters to make fun shapes. If you are having trouble getting the shapes out, dip the bottom of the pan into warm water for 10 seconds. If you poured the jello into a large bowl, you can scoop it out using a melon scoop to make little jello balls. Serve the jello balls in a separate bowl.", "img": "https://www.wikihow.com/images/thumb/4/4b/Make-Jello-Step-5-Version-2.jpg/v4-460px-Make-Jello-Step-5-Version-2.jpg"}, {"summary": "Serve the jello.", "description": "You can serve it as is, or garnish it with some whipped cream or pieces of fruit.", "img": "https://www.wikihow.com/images/thumb/d/de/Make-Jello-Step-6-Version-2.jpg/v4-460px-Make-Jello-Step-6-Version-2.jpg"}]}}