{"conversation": [{"text": "Pat the pork loin steaks dry – you can use paper towels – and set them aside!", "evidence": ["Pat the pork loin steaks dry with paper towels and set them aside."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I've done that. What do I have to do after this?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You're going to pour some flour onto a shallow plate. It's between 1/2 to a whole cup!", "evidence": ["Pour ½ to 1 cup (60 to 125 g) of flour onto a shallow plate."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Should it be nearer to half a cup or to a whole cup?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Don't worry about that. You're about to add some salt and pepper.", "evidence": ["Pour ½ to 1 cup (60 to 125 g) of flour", "Sprinkle 1 teaspoon of salt and 1/4 teaspoon of ground pepper onto the flour."], "id": "Agent", "dialog_act": "answer question"}, {"text": "How much salt and pepper?", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I'm going to get you to mix in 1 teaspoon of salt and a quarter teaspoon of ground pepper onto the flour. Have you mixed them through evenly?", "evidence": ["Sprinkle 1 teaspoon of salt and 1/4 teaspoon of ground pepper", "Use your fingers to mix the salt and pepper into the flour"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yeah, I've mixed them through evenly. What do I have to do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "How thick are your steaks? If they're over 1 inch thick, turn the oven on to 400 degrees F.", "evidence": ["f your steaks are over 1 in (2.5 cm) thick"], "id": "Agent", "dialog_act": "ask question"}, {"text": "What's that in Celsius?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "400 degrees Farenheit is 204 degrees Celsius. Are you ready to move on?", "evidence": ["(204 °C)."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yeah, I think so, thank you. I've turned my oven on.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "OK, so our next step is to take a heavy-bottomed skillet or a cast iron skillet and put it over a medium-high heat on your hob. Do you have either vegetable or canola oil to hand?", "evidence": ["Place a heavy bottomed skillet or cast iron skillet over medium high heat", "1/4 cup of vegetable or canola oil and let it heat up."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have vegetable oil. How much do I need to use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "About 1/4 cup. Is the oil completely covering the entire bottom of your pan?", "evidence": ["1/4 cup ", "enough oil to cover the entire bottom of your pan"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, it is.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "We're going to handle the steaks now. It's safest to use one hand and keep the other one dry. Tell me when you're ready. You're going to pick up each steak with one hand and put it in the flour mixture.", "evidence": [" It's a good idea to handle the steaks with one hand"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Do I need to cover both sides or just one?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, turn each steak over to make sure it's completely covered with the mixture. Have you done this?", "evidence": ["urn each steak over so that they're completely covered in the mixture. ", "urn each steak over so that they're completely covered in the mixture. "], "id": "Agent", "dialog_act": "other"}, {"text": "Yes, I've done this", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "When you've covered the steaks, can you please confirm to me you've washed your hands with soap and water? It's for hygiene reasons. When you've done that you'll be ready to move on.", "evidence": ["Wash your hands with soap and water after handling the raw steaks"], "id": "Agent", "dialog_act": "ask question"}, {"text": "OK, I have washed my hands.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "How is the oil doing? How does it look? Would you describe it as hot and shimmering?", "evidence": ["Once the oil is hot and shimmering, carefully lower the prepared steaks into the pan."], "id": "Agent", "dialog_act": "ask question"}, {"text": "I suppose so, it's definitely hot and glossy looking.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Very carefully, lower the prepared steaks into the hot oil-filled pan.", "evidence": ["carefully lower the prepared steaks into the pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long do I need to cook them for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Cook them for 3 minutes, flip them over carefully, then do another 3 minutes. They should look golden brown.", "evidence": ["Cook the steaks for 3 minutes on medium-high heat", "lip the steaks over and cook for another 3 minutes", "he steaks should be golden brown."], "id": "Agent", "dialog_act": "ask question"}, {"text": "They look golden brown now, I suppose", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Would you say your steaks were thick or thin?", "evidence": ["If they're thick, transfer them to the oven to finish cooking for another 6 to 10 minutes."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Thicker than an inch", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Is the pan that you're using oven-safe?", "evidence": ["ensure that the pan you use is oven safe."], "id": "Agent", "dialog_act": "ask question"}, {"text": "I think it's oven-safe, yes!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "You'll need to judge this for yourself, but since the steaks are thick, transfer them to the oven to finish cooking them for another 6 to 10 minutes.", "evidence": ["transfer them to the oven to finish cooking for another 6 to 10 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How will I know when they're done?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you have a meat thermometer?", "evidence": ["the pork loin steaks should be at least 145 °F (63 °C) "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yep, I have a meat thermometer here.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "OK, so you need to be sure that the pork loin steaks are at least 145 degrees F or 63 degrees C before you put them on the table. Does the meat thermometer show a temperature above that point after 6 minutes or so?", "evidence": ["pork loin steaks should be at least 145 °F (63 °C) before they're ready "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, it does!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Then you're ready to serve! Well done, I hope you enjoyed cooking the pork loin steaks and that they taste delicious. Bon appetit!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thanks very much! Bye!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Goodbye!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Bye bye! They smell really good.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook Pork Loin Steaks", "url": "https://www.wikihow.com/Cook-Pork-Loin-Steaks", "category": ["Food and Entertaining", "Recipes", "Meat", "Pork"], "procedure": [{"summary": "Create a dredging station.", "description": "Pat the pork loin steaks dry with paper towels and set them aside. Pour ½ to 1 cup (60 to 125 g) of flour onto a shallow plate. Sprinkle 1 teaspoon of salt and 1/4 teaspoon of ground pepper onto the flour. Use your fingers to mix the salt and pepper into the flour. If your steaks are over 1 in (2.5 cm) thick, turn the oven on to 400 °F (204 °C).", "img": "https://www.wikihow.com/images/thumb/c/c7/Cook-Pork-Loin-Steaks-Step-1.jpg/v4-460px-Cook-Pork-Loin-Steaks-Step-1.jpg"}, {"summary": "Heat oil in the pan.", "description": "Place a heavy bottomed skillet or cast iron skillet over medium high heat. Add 1/4 cup of vegetable or canola oil and let it heat up. There should be enough oil to cover the entire bottom of your pan. If there isn't, add more oil. Avoid pan-frying the steaks in olive oil or butter. These will burn over the high heat.", "img": "https://www.wikihow.com/images/thumb/0/0a/Cook-Pork-Loin-Steaks-Step-2.jpg/v4-460px-Cook-Pork-Loin-Steaks-Step-2.jpg"}, {"summary": "Dredge the steaks.", "description": "Lay each steak into the seasoned flour so that that it's coated. Turn each steak over so that they're completely covered in the mixture. Lift the steaks up and shake off the excess flour mixture. Wash your hands with soap and water after handling the raw steaks to prevent the spread of disease. It's a good idea to handle the steaks with one hand while using your other hand to sprinkle the flour mixture over the steak. This keeps one hand dry so the flour mixture doesn't stick to you.", "img": "https://www.wikihow.com/images/thumb/d/d2/Cook-Pork-Loin-Steaks-Step-3.jpg/v4-460px-Cook-Pork-Loin-Steaks-Step-3.jpg"}, {"summary": "Fry the steaks in the pan.", "description": "Once the oil is hot and shimmering, carefully lower the prepared steaks into the pan. Cook the steaks for 3 minutes on medium-high heat. Use tongs to flip the steaks over and cook for another 3 minutes. The steaks should be golden brown. If they're thin, they should be finished cooking. If they're thick, transfer them to the oven to finish cooking for another 6 to 10 minutes. Regardless of thickness, the pork loin steaks should be at least 145 °F (63 °C) before they're ready to serve. If you're finishing the steaks in the oven, ensure that the pan you use is oven safe.", "img": "https://www.wikihow.com/images/thumb/f/f7/Cook-Pork-Loin-Steaks-Step-4.jpg/v4-460px-Cook-Pork-Loin-Steaks-Step-4.jpg"}]}}