{"conversation": [{"text": "Are you ready to start?", "evidence": ["A basic beer bread is just a bottle of beer plus a couple of normal ingredients you've already got in your pantry. ", "Use a lighter beer if you're not a big beer fan, and a darker beer if you want more flavor. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'm ready. What do I do first?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Do you want to add herbs?", "evidence": ["Into the bowl, measure out the flour, sugar, baking powder, salt, and any green herbs you'd like to add to the mixture."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I don't have any herbs. Let's get to the beer!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Make sure you don't drink any of it!", "evidence": ["pour in the beer slowly, being careful to avoid too much fizzing up. Pour with one hand and mix gently with the other hand, adding the entire bottle of beer."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great I've added all the beer what next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "What does the mixture look like?", "evidence": ["Keep mixing until the flour is absorbed into the wet beer "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "It's a little lumpy looking. Should it be?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "It sounds great you're nearly there.", "evidence": ["It should be a little lumpy-looking, not quite as thin as pancake batter, and about the consistency of corn-bread mix."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Is it ready to bake now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Any oil is fine to grease the pan.", "evidence": ["Spoon the dough into greased loaf pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How much oil should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Once you have spooned the mixture in flatten the top with a spoon.", "evidence": ["Use about a half tablespoon of butter to thoroughly grease the bottom and sides of the loaf pan, so it won't stick"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok I've done that. How long should I bake it for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Check on it periodically, to make sure its baking evenly and consistently, turning it around if necessary. Remove the bread when the edges are golden brown, or crisp looking.", "evidence": ["Bake at 375ºF for 40 to 50 minutes."], "id": "Agent", "dialog_act": "answer question"}, {"text": "How will I know if it's cooked?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Are you happy with the result?", "evidence": ["Check using a knife or a toothpick in the middle. If it comes back without any wet dough on it, it's done."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes it looks great. I can't wait to try it.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That's great you're baking like a pro. Enjoy!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "That was fun. I'll make this again", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Beer Bread", "url": "https://www.wikihow.com/Make-Beer-Bread", "category": ["Food and Entertaining", "Recipes", "Baking", "Breads"], "procedure": [{"summary": "Get the necessary ingredients.", "description": "A basic beer bread is just a bottle of beer plus a couple of normal ingredients you've already got in your pantry. Any kind of flour, from whole wheat, to self-rising white is fine to use. Cheap beer and expensive beer also work perfectly well. Use a lighter beer if you're not a big beer fan, and a darker beer if you want more flavor. All in all, you'll need the following ingredients to make beer bread:\n2 ¾ cups baking flour\n2 tbsp sugar\n2 tbsp baking powder\n½ tsp salt\n1-2 tsp. dried green herbs (optional)\n1 12 oz. can or bottle of beer", "img": "https://www.wikihow.com/images/thumb/0/0c/Make-Beer-Bread-Step-1-Version-2.jpg/v4-460px-Make-Beer-Bread-Step-1-Version-2.jpg"}, {"summary": "Mix the dry ingredients together in a medium-sized mixing bowl.", "description": "Into the bowl, measure out the flour, sugar, baking powder, salt, and any green herbs you'd like to add to the mixture. A small sprinkling of thyme, oregano, and dill work nicely, but you can also leave them out if you'd prefer. Mix the dry ingredients gently using a wooden spoon, and set the bowl aside.", "img": "https://www.wikihow.com/images/thumb/9/98/Make-Beer-Bread-Step-2-Version-2.jpg/v4-460px-Make-Beer-Bread-Step-2-Version-2.jpg"}, {"summary": "Pour in the beer.", "description": "Once you've got the dry ingredients measured out, pour in the beer slowly, being careful to avoid too much fizzing up. Pour with one hand and mix gently with the other hand, adding the entire bottle of beer. Both warm and cold beer work perfectly fine for this recipe.", "img": "https://www.wikihow.com/images/thumb/4/47/Make-Beer-Bread-Step-3-Version-2.jpg/v4-460px-Make-Beer-Bread-Step-3-Version-2.jpg"}, {"summary": "Mix until just moist and all the flour is absorbed.", "description": "Continue stirring the mixture, scraping the sides of the bowl to avoid any dry spots. Keep mixing until the flour is absorbed into the wet beer and everything starts to look uniform. It should be a little lumpy-looking, not quite as thin as pancake batter, and about the consistency of corn-bread mix.", "img": "https://www.wikihow.com/images/thumb/0/02/Make-Beer-Bread-Step-4-Version-2.jpg/v4-460px-Make-Beer-Bread-Step-4-Version-2.jpg"}, {"summary": "Spoon the dough into greased loaf pan.", "description": "Beer bread is best in a loaf pan. Use about a half tablespoon of butter to thoroughly grease the bottom and sides of the loaf pan, so it won't stick, then spoon the mixture in and flatten the top with the spoon. You can also use olive oil, canola oil, or any other kind of cooking oil you want.", "img": "https://www.wikihow.com/images/thumb/6/6b/Make-Beer-Bread-Step-5-Version-2.jpg/v4-460px-Make-Beer-Bread-Step-5-Version-2.jpg"}, {"summary": "Bake at 375ºF for 40 to 50 minutes.", "description": "Preheat your oven to 375 and pop it in. Check on it periodically, to make sure its baking evenly and consistently, turning it around if necessary. Remove the bread when the edges are golden brown, or crisp looking. Check using a knife or a toothpick in the middle. If it comes back without any wet dough on it, it's done.", "img": "https://www.wikihow.com/images/thumb/f/f0/Make-Beer-Bread-Step-6.jpg/v4-460px-Make-Beer-Bread-Step-6.jpg"}]}}