{"conversation": [{"text": "Hello, today we are going to be making bread. What kind of bread would you prefer cooking, a sweet beard or a more savory one?", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I don't really like sweets, so I guess I would prefer a more savory bread. How should we start?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Start by preheating the oven to 350 degree F and spraying a 9 x 5 inch loaf pan with cooking spray", "evidence": ["Turn the oven on to 350 degrees F (180 C).", "Spray a 9 x 5-inch (23 x 13-cm) loaf pan with cooking spray. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, and what is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Let's start by whisking together our dry ingredients. Mix together 2 cups of all purpose flour, 1/2 cup of white sugar, 1 1/2 teaspoons of baking powder, 1/2 teaspoon of baking soda, and 1 teaspoon of salt", "evidence": ["Measure all of the dry ingredients into a medium-sized mixing bowl. ", " Whisk the ingredients together for about 30 seconds", "You'll need: 2 cups (240 g) all-purpose flour 1/2 cup (100 g) white sugar 1 1/2 teaspoons baking powder 1/2 teaspoon baking soda 1 teaspoon salt"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, how long should I mix the ingredients for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Mix them together until they are incorporated together. For about 30 seconds. Do your ingredients look well mixed?", "evidence": ["Whisk the ingredients together for about 30 seconds, so they're incorporated."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, all the ingredients look well mixed. What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Do you like mind cooking with butter?", "evidence": ["If you don't want to use butter, you can substitute the same amount of olive or vegetable oil."], "id": "Agent", "dialog_act": "ask question"}, {"text": "No, I don't mind cooking with butter. I cook with butter all the time.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay good! So in a separate bowl let's melt 1/4 cup of unsalted butter. Afterward, let's add 1 cup of buttermilk and 1 large egg and then whisk until the the egg is well mixed.", "evidence": ["Melt 1/4 cup (56 g) of unsalted butter in a separate mixing bowl.", "Add 1 cup (240 ml) of buttermilk and 1 large egg.", "Whisk the wet mixture until the egg is well mixed."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I've done that now. How should we proceed?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Okay, now let's combine the dry and wet ingredients. After we combine them, let's use a rubber spatula to gently stir them until they are combined.", "evidence": ["Pour the wet mixture into the bowl with the dry ingredients.", " Use a rubber spatula to gently stir the mixtures together until they're just combined. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I've mixed the ingredients together and it looks combined. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Okay, so you said you prefer savory bread. What kind of spices or flavour would you like to add to your bread?", "evidence": ["Stir in any optional flavors.", "You can easily make sweet or savory flavored quick bread."], "id": "Agent", "dialog_act": "ask question"}, {"text": "I really like garlic bread. Would garlic powder and parmesan be good to add to this mix?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! Garlic powder and parmesan cheese would combine well in this mix. So let's mix those in with ingredients we've just combined. Are you ready to move on?", "evidence": ["garlic powder", "Cheese: parmesan, cheddar"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I've added the parmesan and garlic powder. I am now ready to move on", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay, let's scoop the mixture into our bread pan and put it into the oven for 45 to 50 minutes.", "evidence": ["Scoop the no-yeast quick bread dough into your prepared pan and put it in the preheated oven. ", "Bake the bread for 45 to 50 minutes. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, and how will I know when the bread is ready?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "To know if it's ready, stick a toothpick in the center. If it comes out clean, then the bread is ready", "evidence": ["To test if the bread is done, stick a toothpick into the center of the loaf. It should come out clean."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, so is that all? Do you have any other things I should know?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yeah! When the bread is ready I suggest letting it sit for 15 minutes before serving. This bread tastes best the day it is cooked!", "evidence": ["Cool the loaf in the pan for 15 minutes.", "While the quick bread is best the same day it's baked,"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, but I don't know if I'll be able to eat the whole loaf today. Can I store it and save it for another day?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Sure! Just make sure to wrap it tightly and it should be fine to eat for a few days!", "evidence": ["While the quick bread is best the same day it's baked, you can wrap it tightly and store it for a few days."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, perfect. Thank you very much!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem! I hope you had fun and enjoy your tasty bread!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Yes, it was a lot of fun!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I'm glad!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Okay, thanks again and I hope you have a good day!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Dough Without Yeast", "url": "https://www.wikihow.com/Make-Dough-Without-Yeast", "category": ["Food and Entertaining", "Recipes", "Baking"], "procedure": [{"summary": "Preheat the oven and prepare a pan.", "description": "Turn the oven on to 350 degrees F (180 C). Spray a 9 x 5-inch (23 x 13-cm) loaf pan with cooking spray. This will prevent the bread from sticking to the pan.", "img": "https://www.wikihow.com/images/thumb/3/3a/Make-Dough-Without-Yeast-Step-6.jpg/v4-459px-Make-Dough-Without-Yeast-Step-6.jpg"}, {"summary": "Whisk together the dry ingredients.", "description": "Measure all of the dry ingredients into a medium-sized mixing bowl. Whisk the ingredients together for about 30 seconds, so they're incorporated. You'll need:\n2 cups (240 g) all-purpose flour\n1/2 cup (100 g) white sugar\n1 1/2 teaspoons baking powder\n1/2 teaspoon baking soda\n1 teaspoon salt", "img": "https://www.wikihow.com/images/thumb/2/2a/Make-Dough-Without-Yeast-Step-7.jpg/v4-460px-Make-Dough-Without-Yeast-Step-7.jpg"}, {"summary": "Melt the butter and stir in the wet ingredients.", "description": "Melt 1/4 cup (56 g) of unsalted butter in a separate mixing bowl. Add 1 cup (240 ml) of buttermilk and 1 large egg. Whisk the wet mixture until the egg is well mixed. If you don't want to use butter, you can substitute the same amount of olive or vegetable oil.", "img": "https://www.wikihow.com/images/thumb/9/91/Make-Dough-Without-Yeast-Step-8.jpg/v4-460px-Make-Dough-Without-Yeast-Step-8.jpg"}, {"summary": "Combine the wet ingredients with the dry ingredients.", "description": "Pour the wet mixture into the bowl with the dry ingredients. Use a rubber spatula to gently stir the mixtures together until they're just combined. If you'll be adding optional flavors, it's fine if there's still a little dry mixture in the dough.", "img": "https://www.wikihow.com/images/thumb/3/36/Make-Dough-Without-Yeast-Step-9.jpg/v4-460px-Make-Dough-Without-Yeast-Step-9.jpg"}, {"summary": "Stir in any optional flavors.", "description": "You can easily make sweet or savory flavored quick bread. Just stir the added flavors in until they're just combined, since you don't want to over-mix the dough. You can add up to 1 1/2 cups of mix-ins (like the dried fruits or nuts), or add seasonings and herbs according to your taste. Good options for quick bread include:\n\nFruit: cranberries, dried cherries, apples, blueberries, orange zest, raisins\n\nNuts: walnuts, pecans, almonds\n\nHerbs and spices: dill, pesto, caraway seeds, chili powder, garlic powder\n\nCheese: parmesan, cheddar", "img": "https://www.wikihow.com/images/thumb/8/87/Make-Dough-Without-Yeast-Step-10.jpg/v4-460px-Make-Dough-Without-Yeast-Step-10.jpg"}, {"summary": "Bake the quick bread.", "description": "Scoop the no-yeast quick bread dough into your prepared pan and put it in the preheated oven. Bake the bread for 45 to 50 minutes. To test if the bread is done, stick a toothpick into the center of the loaf. It should come out clean. Cool the loaf in the pan for 15 minutes. Then take the bread out and serve it. While the quick bread is best the same day it's baked, you can wrap it tightly and store it for a few days.", "img": "https://www.wikihow.com/images/thumb/3/32/Make-Dough-Without-Yeast-Step-11.jpg/v4-460px-Make-Dough-Without-Yeast-Step-11.jpg"}]}}