{"conversation": [{"text": "I'll teach how to cook pot barley", "evidence": ["Recipe"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do we go about it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "First, rinse the barley off in a strainer and pick out the fragments too.", "evidence": ["Rinse the barley off under lukewarm water.", "Pour all of the barley into a strainer, then set the strainer in your sink", "If you notice any shells or other fragments among the barley, pick them out and throw them away."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright, I've done that", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Combine the barley and water at a reasonable ratio. Half a cup of barley to one and half cups of water.", "evidence": ["Pour everything into a pot on your stove, stirring the grain until it is all submerged", " Try to keep the ratio at 1 part barley to 3 parts water to ensure the barley has plenty of water to cook in"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright, keeping an eye out for that", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Do you prefer flavoring with your barley?", "evidence": ["For additional flavoring, cook the barley in stock or broth instead of water"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I'd like to. How do I do that?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can either cook the barley in stock or broth instead of water", "evidence": [" For additional flavoring, cook the barley in stock or broth instead of water."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright. What is next after cooking the barley?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "What heat level are you using to boil the barley?", "evidence": ["Bring the water to a boil before reducing the heat.", "Bring the water to a boil before reducing the heat."], "id": "Agent", "dialog_act": "ask question"}, {"text": "I just kept it a a constant high temperature", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Are you keeping to the barley - water ratio?", "evidence": ["Try to keep the ratio at 1 part barley to 3 parts water to ensure the barley has plenty of water"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, 1 part of barley to 3 parts of water", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Does the barley in the pot look done? It should look about 3 times bigger than what you put in the pot.", "evidence": ["Check for doneness or taste the barley for a soft, chewy texture."], "id": "Agent", "dialog_act": "ask question"}, {"text": "The volume has quite increased, yes.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Do you like your barley soft and chewy? Taste it and find out the texture", "evidence": [" try the barley – if it's a soft and chewy"], "id": "Agent", "dialog_act": "ask question"}, {"text": "I prefer it soft and chewy.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "If it is soft and chewy, then it is done. Different barleys have different taste and texture. Check for yours.", "evidence": ["if it's a soft and chewy, it's done!"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "My barley is almost soft and chewy but the water content is low.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Your barley has absorbed most of the water so add more water to it and be mindful of the ratio.", "evidence": ["Your barley may have absorbed all of the water in the pot, even if it isn't finished yet"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What is the next step to take?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "If the consistency of the barley texture and taste is good, drain the water from the pot", "evidence": ["Drain any remaining water from the pot."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long does it take to reach consistency?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No exact time but check every 5 minutes to make sure of it", "evidence": [" Check the barley every 5 minutes or so to prevent it from overcooking and add more water as needed"], "id": "Agent", "dialog_act": "answer question"}, {"text": "The consistency of the taste and texture is fine now.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "To prevent sticking, stir the barley while it is still on the pot to prevent the grain from sticking due to starch being released.", "evidence": ["Fluff the barley with a fork before serving it."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I confirm no sticking of grains?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The grains should not stick so much to each other.", "evidence": ["stir it with a form to prevent the grain from turning sticky due to released starch."], "id": "Agent", "dialog_act": "answer question"}, {"text": "The grains look fine and not sticky.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, dish and store your leftover barley in an airtight container in the fridge.", "evidence": ["Move the barley into an airtight plastic container within 2 hours of cooking it, then refrigerate it right away to avoid harmful bacterial growth."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long can I keep the barley stored?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you have a fridge and airtight containers?", "evidence": ["Store leftover barley in a sealed container in the fridge for up to 5 days."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes I do have them here.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "If the stored barley get mushy, dispose of it quickly", "evidence": ["Dispose of any leftover barley when t gets too mushy or begins rotting. You can also store the barley in a sealed bag or container in the freezer for up to 1 month."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long can I keep the barley stored for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can store the barley for up to a month.", "evidence": ["You can also store the barley in a sealed bag or container in the freezer for up to 1 month."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I think I can consume this before the month period.", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thank you very much for your helpful tips and recipe for making barley!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook Pot Barley", "url": "https://www.wikihow.com/Cook-Pot-Barley", "category": ["Food and Entertaining", "Recipes", "Cereal Grains"], "procedure": [{"summary": "Rinse the barley off under lukewarm water.", "description": "Pour all of the barley into a strainer, then set the strainer in your sink. Use the water to wash off dust and other debris. If you notice any shells or other fragments among the barley, pick them out and throw them away.", "img": "https://www.wikihow.com/images/thumb/e/ea/Cook-Pot-Barley-Step-1.jpg/v4-459px-Cook-Pot-Barley-Step-1.jpg"}, {"summary": "Combine 1 cup (225 g) of barley with 3 cups (710 mL) of water.", "description": "Pour everything into a pot on your stove, stirring the grain until it is all submerged. You can cook more barley if you need to, but adjust the amount of water you use to compensate. Try to keep the ratio at 1 part barley to 3 parts water to ensure the barley has plenty of water to cook in. For example, to make ½ cup (112.5 g) of barley, use only 1 ⁄2 cups (350 mL) of water. For additional flavoring, cook the barley in stock or broth instead of water.", "img": "https://www.wikihow.com/images/thumb/d/d1/Cook-Pot-Barley-Step-2.jpg/v4-459px-Cook-Pot-Barley-Step-2.jpg"}, {"summary": "Simmer the barley over medium-low heat for an hour.", "description": "Bring the water to a boil before reducing the heat. Then, cover the pot to reduce the amount of time needed for the barley to boil. Set your timer, checking the pot on occasion to make sure the water continues to gently bubble. The required cooking time may vary depending on your stove’s settings. You can cook the barley without a lid. You may need to boil the barley for a little longer, but it will eventually cook through.", "img": "https://www.wikihow.com/images/thumb/f/fb/Cook-Pot-Barley-Step-3.jpg/v4-459px-Cook-Pot-Barley-Step-3.jpg"}, {"summary": "Check for doneness or taste the barley for a soft, chewy texture.", "description": "Barley expands as it cooks, so the finished product will look about 3 times bigger than what you put in the pot. If you’re still unsure that it is done, try the barley – if it's a soft and chewy, it's done! If you are familiar with other types of barley, pot barley is a little chewier than pearl barley but not as much as hulled barley.", "img": "https://www.wikihow.com/images/thumb/c/c2/Cook-Pot-Barley-Step-4.jpg/v4-459px-Cook-Pot-Barley-Step-4.jpg"}, {"summary": "Add more water if the barley isn’t done cooking and the pot is dry.", "description": "Your barley may have absorbed all of the water in the pot, even if it isn't finished yet. Try adding about ⁄4 to ⁄2 cup (59 to 118 mL) of water and cooking until the barley reaches the consistency you desire. If you still see water, you don’t need to add any more. Check the barley every 5 minutes or so to prevent it from overcooking and add more water as needed. Take it out of the pot when it reaches the consistency you desire.", "img": "https://www.wikihow.com/images/thumb/5/5c/Cook-Pot-Barley-Step-5.jpg/v4-459px-Cook-Pot-Barley-Step-5.jpg"}, {"summary": "Drain any remaining water from the pot.", "description": "Put on a pot-holder or use an oven mitt to avoid scorching your hands, then take the pot to the sink. The easiest way to drain excess water is by pouring the pot's contents into a strainer. You can also try tipping the pot to let out the excess water or moving the barley out of the pot with a slotted spoon. If you don’t see a lot of water in the pot, you may be better off letting the barley absorb it. Cover the pot and let the barley rest for about 10 minutes.", "img": "https://www.wikihow.com/images/thumb/7/75/Cook-Pot-Barley-Step-6.jpg/v4-459px-Cook-Pot-Barley-Step-6.jpg"}, {"summary": "Fluff the barley with a fork before serving it.", "description": "While the barley is still in the pot, stir it with a form to prevent the grain from turning sticky due to released starch.", "img": "https://www.wikihow.com/images/thumb/b/b2/Cook-Pot-Barley-Step-7.jpg/v4-459px-Cook-Pot-Barley-Step-7.jpg"}, {"summary": "Store leftover barley in a sealed container in the fridge for up to 5 days.", "description": "Move the barley into an airtight plastic container within 2 hours of cooking it, then refrigerate it right away to avoid harmful bacterial growth. Dispose of any leftover barley when t gets too mushy or begins rotting. You can also store the barley in a sealed bag or container in the freezer for up to 1 month.", "img": "https://www.wikihow.com/images/thumb/c/c8/Cook-Pot-Barley-Step-8.jpg/v4-459px-Cook-Pot-Barley-Step-8.jpg"}]}}