{"conversation": [{"text": "Preheat the oven to 400 degrees Farenheit", "evidence": ["Preheat the oven to 400 °F"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great! Whats the first step for cooking?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Start by removing the crust from the packaging and placing it on a round or square baking sheet. Brush the top with olive oil lightly.", "evidence": ["Remove the unbaked crust from the packaging", "Place it on a round or rectangular baking sheet", "Use a pastry brush to spread a thin coating of olive oil over the top of the crust"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks, so what is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Spread your pizza sauce on the crust (if you want a tomato base pizza, if not, leave this out).", "evidence": ["Spread pizza sauce on the crust"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wow, so how much sauce, and what type of sauce do I then use? I'm a saucy person so I need the specifics.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Whatever you like! Add as much or as little sauce as you want, and any sauce of your preference, be it tomato or olive base.", "evidence": ["purely a matter of personal preference", "If you love a lot of sauce, go ahead and slather it on", "If you love a lot of sauce, go ahead and slather it on"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks so much. What do I use to spread it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can spoon a few dollops in the middle of the crust, and use the back of the spoon to spiral the sauce around.", "evidence": ["spoon a little in the middle and spread it around in a thin layer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Cool. What is the next step then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next is layering time! Layer as many or as little topping as you please on top of the sauce.", "evidence": ["Layer your favorite toppings over the sauce", "Continue until your pizza is loaded with the amount of toppings you like"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yay, my favourite part! Can I use meats as a layer?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You are welcome to use meat like sausage or beef mince, but make sure it is thoroughly cooked before you place it on your pizza! The oven is hot, but won't cook the meat from raw.", "evidence": ["If you're using ground beef, sausage, chicken, or another meat, cook it thoroughly in a pan on the stove or in the oven and drain the grease before you add it to your pizza"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks for the advice. Should I use vegetables like onions as well? I love balsamic and onions!", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can definitely add onions, but add it as the base layer with your meat, and the lighter toppings on top. If you add too many, your base may get soggy, so be careful.", "evidence": ["if you add too many vegetable toppings, your pizza crust may turn out a little soggy", "Put the heavier toppings, like onions, chicken or sausage, on the bottom layer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great. Just done that now, nearly ready to cook and eat!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Sprinkle as much mozzarella cheese on top as you please, or cheddar if you like.", "evidence": ["Sprinkle mozzarella cheese over the toppings"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh! I'm a cheddar fella, I love the flavour it gives. Done this!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Bake your delicious pizza for about 20 minutes, or until all the cheese has melted and the crust is golden brown.", "evidence": ["ave it bake for about 20 minutes, or until the crust is golden brown"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Delicious. Can I take a bite right away? I'm starving!", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If you don't want to burn the inside of your mouth, I would recommend waiting a few minutes before slicing and eating it.", "evidence": ["allow it to cool for a few minutes before slicing."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Aw. I will try my best but I'm not sure how much longer I can wait!", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Yay! This was so easy to prep and cook. I'll definitely be making more pizza!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Pizza", "url": "https://www.wikihow.com/Make-Pizza", "category": ["Food and Entertaining", "Recipes", "Sandwiches and Quick Meals", "Pizza"], "procedure": [{"summary": "Preheat the oven to 400 °F (204 °C).", "description": "The oven should be piping hot before you start cooking the pizza.", "img": "https://www.wikihow.com/images/thumb/5/5d/Make-Pizza-Step-1-Version-8.jpg/v4-459px-Make-Pizza-Step-1-Version-8.jpg"}, {"summary": "Prepare the crust.", "description": "Remove the unbaked crust from the packaging. Place it on a round or rectangular baking sheet, depending on what you have on hand. Use a pastry brush to spread a thin coating of olive oil over the top of the crust.", "img": "https://www.wikihow.com/images/thumb/c/ca/Make-Pizza-Step-2-Version-8.jpg/550px-nowatermark-Make-Pizza-Step-2-Version-8.jpg"}, {"summary": "Spread pizza sauce on the crust.", "description": "How much pizza sauce you add is purely a matter of personal preference. If you love a lot of sauce, go ahead and slather it on. If you prefer your pizza on the dry side, spoon a little in the middle and spread it around in a thin layer. If you want to make a white pizza, add a little extra olive oil and skip the pizza sauce. You can make a quick pizza sauce using tomato paste, a can of diced tomatoes, and some spices. Simmer the paste and tomatoes (without draining them first) together over low heat. Add salt, oregano and pepper to taste. Continue simmering until the sauce cooks down to the consistency of pizza sauce.", "img": "https://www.wikihow.com/images/thumb/9/97/Make-Pizza-Step-3-Version-8.jpg/550px-nowatermark-Make-Pizza-Step-3-Version-8.jpg"}, {"summary": "Add toppings.", "description": "Layer your favorite toppings over the sauce. Add as many or as few toppings as you want. Put the heavier toppings, like onions, chicken or sausage, on the bottom layer, and add lighter toppings, like spinach leaves or peppers, on the top layer. Continue until your pizza is loaded with the amount of toppings you like. Other than pepperoni and ham which are pre-cooked, meat toppings should always be cooked before you put them on the pizza. They'll get heated when you bake the pizza, but they won't fully cook. If you're using ground beef, sausage, chicken, or another meat, cook it thoroughly in a pan on the stove or in the oven and drain the grease before you add it to your pizza. Remember that if you add too many vegetable toppings, your pizza crust may turn out a little soggy. The water from the vegetables moistens the dough. Limit the amount of spinach and other \"watery\" vegetables you put on your pizza if you're worried about this happening.", "img": "https://www.wikihow.com/images/thumb/8/86/Make-Pizza-Step-4-Version-8.jpg/550px-nowatermark-Make-Pizza-Step-4-Version-8.jpg"}, {"summary": "Add the cheese.", "description": "Sprinkle mozzarella cheese over the toppings. Layer it on thick if you like it that way, or add a thin layer if you're going for a lighter pizza. Use Cheddar if you like.", "img": "https://www.wikihow.com/images/thumb/f/f5/Make-Pizza-Step-5-Version-8.jpg/v4-460px-Make-Pizza-Step-5-Version-8.jpg"}, {"summary": "Bake the pizza.", "description": "Place the pizza in the oven and have it bake for about 20 minutes, or until the crust is golden brown and the cheese is melted. Remove it from the oven and allow it to cool for a few minutes before slicing.", "img": "https://www.wikihow.com/images/thumb/a/a7/Make-Pizza-Step-6-Version-8.jpg/v4-460px-Make-Pizza-Step-6-Version-8.jpg"}]}}