{"conversation": [{"text": "For the first step, gather all of your ingredients and supplies.", "evidence": ["Gather your ingredients and supplies."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay I did that, what should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Put 5cm cubes of cake into the food processor and use the pulse function until the cake is broken up into crumbs.", "evidence": ["Place two-inch (5-cm) cubes of cake into the food processor and pulse until the cake is broken up into fine crumbs."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it matter how many cubes I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It depends on how large of a serving you want to prepare.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay. What do I do with these cake crumbs?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Move the crumbs into a bowl, then add a dollop of frosting. Mix them.", "evidence": ["Transfer the crumbs to a mixing bowl. Add a dollop of frosting and stir to completely combine the cake and frosting."], "id": "Agent", "dialog_act": "answer question"}, {"text": "How long should I mix the crumbs and the frosting?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Stir until the dough becomes the consistency of clay.", "evidence": ["Stir in another dollop of frosting as necessary, until the dough becomes the consistency of clay."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, what do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Move the dough to an airtight space and chill it in a fridge overnight.", "evidence": ["Transfer the dough to an airtight container and transfer it to the fridge to chill overnight."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is there a reason I can't go into the next step without chilling the dough first?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can move on to the next step without waiting overnight, but the dough will not be as cooperative. If you choose you can instead move the dough to the freezer for an hour.", "evidence": ["This will make the dough easier to work with and form into cake balls.If you don’t have that much time, place the cake dough into a container and transfer it to the freezer for about an hour."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay I'll do that instead. I'll come back in an hour. What would my next step be?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Use your hands to mold the dough into eggs. Set them aside for 30 minutes so they can warm up.", "evidence": ["Roll the dough around between your hands to work it into an egg shape. Transfer the cake egg to the baking sheet", "Set the eggs aside for about 30 minutes and allow them to warm to room temperature."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "It's been an hour and now I've done this step. What should I do after molding the eggs and waiting 30 minutes?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Separate the cadies by color, into bowls. Place each bowl on top of a saucepan, filled with 2.5cm of water and heat the saucepans over medium heat.", "evidence": ["Transfer each color of candy melt to a separate glass bowl.", "Fill three saucepans with an inch (2.5 cm) of water and place the glass bowls on top. Heat each saucepan over medium heat, stirring regularly, until the melts have melted."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "These are very specific steps, now I understand why I needed so many bowls. What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Insert a half-inch of a lollipop stick into the bowl of yellow candy.", "evidence": ["To turn your cake eggs into cake pop eggs, insert the final half-inch (1.3 cm) of a lollipop stick into the yellow candy melt colors."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I guess I'll be dipping the eggs into each color. Which comes next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You insert the sticks into the fat part of the egg, then you take the entire egg and dip it into the blue candy. Let the egg set for 5 minutes.", "evidence": ["Then insert that end into the fat end of the egg, pushing it about halfway into the egg.", "Take each cake pop egg and dip the entire ball of cake into the blue candy melt.", "transfer them to the fridge for five minutes to set."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I assume I repeat the process for each color. What comes next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You want to dip two-thirds of the egg into the pink candy then let it sit for 5 minutes. Then you dip the top third of the egg into the yellow candy and let it sit for 5 minutes.", "evidence": ["Now dip the top two-thirds of each cake pop into the pink candy melt.", " When you’ve dipped all the pops into the pink, transfer them to the fridge again to set for another five minutes.", "Finally, dip the top third of each cake pop into the yellow.", "return the cake pops to the fridge and let them set for another five minutes before serving."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Are there any more steps? It looks like it's finished.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's it, you're finished!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you for your help!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You're welcome!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "This service is great!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Easter Treats", "url": "https://www.wikihow.com/Make-Easter-Treats", "category": ["Food and Entertaining", "Recipes", "Chocolate and Candy"], "procedure": [{"summary": "Gather your ingredients and supplies.", "description": "To make cake pops, you'll need a homemade or store-bought cake (cooled), homemade or commercial frosting, and a few supplies:Cake pop stand or piece of Styrofoam\nFood processor\nLarge mixing bowl\nMixing spoon\nParchment-lined baking sheet\nCookie dough scoop, coffee scoop, or ice cream scoop\nLollipop sticks or paper straws\nThree small glass bowls", "img": null}, {"summary": "Make the cake ball dough.", "description": "Place two-inch (5-cm) cubes of cake into the food processor and pulse until the cake is broken up into fine crumbs. Transfer the crumbs to a mixing bowl. Add a dollop of frosting and stir to completely combine the cake and frosting. Stir in another dollop of frosting as necessary, until the dough becomes the consistency of clay.If you don’t have a food processor, place the chunks of cake into a mixing bowl and mash them with a fork or break them up with your hands.", "img": null}, {"summary": "Chill the dough.", "description": "Transfer the dough to an airtight container and transfer it to the fridge to chill overnight. This will make the dough easier to work with and form into cake balls.If you don’t have that much time, place the cake dough into a container and transfer it to the freezer for about an hour.", "img": null}, {"summary": "Form the cake balls.", "description": "When the dough has had time to chill, remove it from the fridge or freezer. Use your cookie dough scoop to portion out a scoop of dough. Roll the dough around between your hands to work it into an egg shape. Transfer the cake egg to the baking sheet. Repeat with the remaining dough until you have formed all the cake into cake eggs. Set the eggs aside for about 30 minutes and allow them to warm to room temperature.", "img": null}, {"summary": "Melt the candy melts.", "description": "Transfer each color of candy melt to a separate glass bowl. Fill three saucepans with an inch (2.5 cm) of water and place the glass bowls on top. Heat each saucepan over medium heat, stirring regularly, until the melts have melted. Turn the heat on all the saucepans to low to keep the melts liquid. Alternatively, you can also melt the candy melts in the microwave. Heat the candy melts in the microwave in 30-second bursts, stirring in between, until the candy melts have completely melted. The microwave method is faster, but the candy melts will start to harden faster, and you'll have to work quickly.", "img": null}, {"summary": "Insert lollipop sticks into the cake eggs.", "description": "To turn your cake eggs into cake pop eggs, insert the final half-inch (1.3 cm) of a lollipop stick into the yellow candy melt colors. Then insert that end into the fat end of the egg, pushing it about halfway into the egg.Push the opposite end of the lollipop stick into a piece of Styrofoam or a cake pop stand. Repeat until all the cake eggs have sticks inserted.", "img": null}, {"summary": "Decorate the eggs with blue candy melt.", "description": "Take each cake pop egg and dip the entire ball of cake into the blue candy melt. Pull the cake pop out at a 45-degree angle, twist it 90-degrees, and tap the stick against the side of the bowl to remove excess. Set the cake pops back into their places in the Styrofoam or cake pop stand and transfer them to the fridge for five minutes to set. If you want to mix up the order of the egg coloring, don’t dip all the cake eggs into the blue. Dip one-third into the blue, one-third into the pink, and one third into the yellow.", "img": null}, {"summary": "Add the pink.", "description": "When the blue candy melt has set, remove the cake pops from the fridge. Now dip the top two-thirds of each cake pop into the pink candy melt. Pull the cake pop out at an angle, twist it, and tap it to remove excess. When you’ve dipped all the pops into the pink, transfer them to the fridge again to set for another five minutes. If you divided the base color of your cake pops, make sure you dip each set of cake pops into a different color this time.", "img": null}, {"summary": "Add the yellow.", "description": "Finally, dip the top third of each cake pop into the yellow. When you’ve removed the excess, return the cake pops to the fridge and let them set for another five minutes before serving. For divided cake pop colors, dip each cake pop into the color you haven't yet decorated it with.", "img": null}]}}