{"conversation": [{"text": "First add 350g all purpose flour to a mixing bowl", "evidence": ["Measure 2 1/2 cups (350 g) of all-purpose flour into a mixing bowl."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it need to be sifted?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, simply add it to the bowl for now", "evidence": ["Whisk together the dry ingredients"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, what should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now add in 2 and 3 quarter teaspoons of baking powder to the same bowl, followed by a teaspoon of salt.", "evidence": ["Add 2 3/4 teaspoons of baking powder and 1 teaspoon of salt."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, do I mix the ingredients together in the bowl now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes that's right! Now you're going to whisk the ingredients in your bowl together, for around 30 seconds. We're trying to make sure the baking powder is spread through evenly.", "evidence": ["Whisk the ingredients for about 30 seconds, so the baking powder is evenly distributed."], "id": "Agent", "dialog_act": "answer question"}, {"text": "How do I know if it is spread through evenly when I'm done whisking?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If it's been 30 seconds of whisking, you should have done just fine. You can also check the colour to make sure you can't see any chunks of baking powder not mixed in.", "evidence": ["Whisk the ingredients for about 30 seconds"], "id": "Agent", "dialog_act": "answer question"}, {"text": "They're very similar colours, but I think it's all mixed in! What do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next you're going to add in 1 tablespoon of oil, followed by 180ml of water.", "evidence": ["Pour in 1 tablespoon of vegetable, olive, or canola oil and 3/4 cup (180 ml) of water."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it matter what type of oil I have?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can use any of vegetable, canola or olive oil. If you have all of them you could try smelling them and using whichever you think smells the best! Or if you have a taste preference use that one.", "evidence": ["vegetable, olive, or canola oil"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay I usually use canola oil so I'll use that for this recipe! What do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next you're going to stir your mixture together until it becomes a nice round ball shape. If it isn't quite working you can try adding more water... Try adding it a tablespoon at a time if you need to so it doesn't make your dough sticky.", "evidence": ["Stir the pizza dough until it forms into a ball. You may need 1/4 cup (60 ml) more water, if your flour absorbs a lot of the water. Ensure that you add the extra water a tablespoon or two at a time. Avoid adding so much water that the dough becomes sticky"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I think my dough needs more water.. do I add as many spoonfuls as I want?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I wouldn't use more than 60ml extra water right now, you don't want to make the dough sticky!", "evidence": ["You may need 1/4 cup (60 ml) more water"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay I managed to get my dough looking right with only 30ml extra! Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Okay now we're going to knead our dough! Sprinkle some flour on your work surface and then put your dough on there! We're going to knead it for a few minutes with whatever technique you want. The main thing is just to get our dough smooth and stretchy!", "evidence": ["Sprinkle a little flour on your work surface and scoop the pizza dough onto it. Knead the dough for 3 to 4 minutes, so the dough becomes smooth and elastic. You can knead the dough however you like. The important thing is that the dough is stretched and folded repeatedly. This will develop the gluten in the flour.", "This will develop the gluten in the flour."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Why do I need to knead the dough? Can't I just roll it out with a rolling pin?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Your dough needs to be stretched and folded over and over, to develop the gluten in the flour. That's why we're doing it by hand. Are you ready to move on?", "evidence": ["The important thing is that the dough is stretched and folded repeatedly. This will develop the gluten in the flour."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oh! I understand now! Yes I'm ready to move on, I think my dough is nice and smooth now.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Since you asked, now you can use a rolling pin if you like! It's time to shape your dough for cooking! You can roll it into a preferred shape, or you can simply stretch it in the pan to be as big as will fit! (My preference)", "evidence": ["You can use a rolling pin to roll the pizza out to any shape you like"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh good! I have the rolling pin ready already, I usually like a thinner pizza crust does that matter when I do this part?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It does matter, good point! If you'd like a thinner crust you can split the dough into 2 and roll 2 thinner bases, using all the dough for one pizza will get you a thick crust pizza!", "evidence": ["If you want to make two thin-crust pizzas, just divide the dough in half and roll them until they're as thin as you'd like."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Perfect! I'll use half the dough for each pizza, hopefully it's nice and crispy!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Okay, now we're onto the best step! The toppings! But first we want to preheat the oven to 200c so it'll be ready when we've topped the pizza!", "evidence": ["Preheat your oven to 400 degrees F (200 C)."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes! That's what I was waiting for! Does it matter that I have a fan oven?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It shouldn't matter too much that you have a fan oven, just make sure you keep a close eye on your pizzas once they go in the oven so as not to burn them!", "evidence": ["If you're making two thin crust pizzas, they may only need 10 to 15 minutes.", "Preheat your oven to 400 degrees F (200 C)."], "id": "Agent", "dialog_act": "answer question"}, {"text": "It's okay I honestly prefer them a little crispy! I'll keep a close eye on them though. Do I just put my toppings on now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Not just yet! First you need to spread the top of your dough with sauce, pesto or oil. I'd always go for a classic tomato sauce, but pesto is great too!", "evidence": ["Spread the dough with sauce, pesto, or oil. Sprinkle your choice of pizza toppings across the top and bake the pizza for 15 to 25 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Hmm I'm gonna go with pesto for a change... I always get tomato usually! Now I just add my toppings and cook?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes the last step is adding your toppings of choice then cooking the pizza for 15 to 25 minutes... we're going to go for 15 minutes, keeping an eye on it towards the end since we know you like it crispy!", "evidence": ["Sprinkle your choice of pizza toppings across the top and bake the pizza for 15 to 25 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great! I've gone for Ham, Mushroom, Cheese and Onions! Is that everything? Now I just let it cook?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes that's the recipe finished! Just make sure you keep an eye on the pizza towards the end of cooking, we don't want to overcook it!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay I'll be sure to keep close watch after 10 minutes or so, thanks :)", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thank you! It was great learning!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Dough Without Yeast", "url": "https://www.wikihow.com/Make-Dough-Without-Yeast", "category": ["Food and Entertaining", "Recipes", "Baking"], "procedure": [{"summary": "Whisk together the dry ingredients.", "description": "Measure 2 1/2 cups (350 g) of all-purpose flour into a mixing bowl. Add 2 3/4 teaspoons of baking powder and 1 teaspoon of salt. Whisk the ingredients for about 30 seconds, so the baking powder is evenly distributed.", "img": "https://www.wikihow.com/images/thumb/7/7a/Make-Dough-Without-Yeast-Step-1.jpg/v4-460px-Make-Dough-Without-Yeast-Step-1.jpg"}, {"summary": "Stir in the oil and water.", "description": "Pour in 1 tablespoon of vegetable, olive, or canola oil and 3/4 cup (180 ml) of water. Stir the pizza dough until it forms into a ball. You may need 1/4 cup (60 ml) more water, if your flour absorbs a lot of the water. Ensure that you add the extra water a tablespoon or two at a time. Avoid adding so much water that the dough becomes sticky.", "img": "https://www.wikihow.com/images/thumb/c/c1/Make-Dough-Without-Yeast-Step-2.jpg/v4-460px-Make-Dough-Without-Yeast-Step-2.jpg"}, {"summary": "Knead the dough.", "description": "Sprinkle a little flour on your work surface and scoop the pizza dough onto it. Knead the dough for 3 to 4 minutes, so the dough becomes smooth and elastic. You can knead the dough however you like. The important thing is that the dough is stretched and folded repeatedly. This will develop the gluten in the flour.", "img": "https://www.wikihow.com/images/thumb/c/c3/Make-Dough-Without-Yeast-Step-3.jpg/v4-460px-Make-Dough-Without-Yeast-Step-3.jpg"}, {"summary": "Shape the dough.", "description": "You can use a rolling pin to roll the pizza out to any shape you like, or you can place it into your pizza pan and stretch the dough to fit the pan. Keep in mind that the pizza crust will be thick if you make one pizza out of this dough. If you want to make two thin-crust pizzas, just divide the dough in half and roll them until they're as thin as you'd like.", "img": "https://www.wikihow.com/images/thumb/b/ba/Make-Dough-Without-Yeast-Step-4.jpg/v4-460px-Make-Dough-Without-Yeast-Step-4.jpg"}, {"summary": "Top and bake the pizza.", "description": "Preheat your oven to 400 degrees F (200 C). Spread the dough with sauce, pesto, or oil. Sprinkle your choice of pizza toppings across the top and bake the pizza for 15 to 25 minutes. If you're making two thin crust pizzas, they may only need 10 to 15 minutes.", "img": "https://www.wikihow.com/images/thumb/c/cc/Make-Dough-Without-Yeast-Step-5.jpg/v4-460px-Make-Dough-Without-Yeast-Step-5.jpg"}]}}