{"conversation": [{"text": "Hello! What do you want to cook?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Hi! I'd like to make candied oranges but I don't know how. How do I start?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Okay! First we need four oranges. You need to have a clean work area, and you need to carefully wash and dry your oranges first.", "evidence": ["Wash 4 oranges"], "id": "Agent", "dialog_act": "answer question"}, {"text": "How big are the oranges supposed to be?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The size doesn't matter, as long as they're a good size. Do you have them prepared?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I do! What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Okay. We start by cutting up the oranges. Cut each orange into four wedges of about equal size by cutting from the top to the bottom.", "evidence": ["Wash 4 oranges and use a sharp knife to cut each orange into four pieces or wedges"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Do I leave the peel on or do I peel them next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We peel the skin off of the oranges after cutting them into wedges. Next, we need to get a spoon and scrape away the pith (the middle part) because we don't want that part. Then we need to cut the peels into strips around 6mm wide and set them aside.", "evidence": ["Pull the fruit away from the peels. ", "ake a spoon and scrape away as much of the white pith as you can."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok! I've done that. Do I use the fruit for anything or do we just continue?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you have the peels cut?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, I've cut the peels. Do I put the fruit aside?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can eat the fruit if you like. For now, you need to put the peels of a saucepan of water. You put the stove to high and bring the water to a boil with the peels, starting from cold.", "evidence": ["Place the strips of orange peel into a large saucepan and pour in enough water to cover them. Turn the heat on to high and bring the water to a boil. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What do I do when the water boils?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "When the water is boiled, you turn off the heat. You need to drain all the water out and put the peels back in the saucepan. Repeat this two more times.", "evidence": ["When the water boils, you can turn off the heat and place a colander in the sink. Drain the water through the colander and return the strips to the saucepan.", "Boil and drain the strips two more times."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Why do I boil and drain the peels two more times?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It's to remove all the bitterness from the peel. If we don't do this the bitterness will have a weird taste! Ok, next we have to make the syrup. Remove the peels and put them aside. Place 600 grams of sugar and 1 cup of water into the saucepan and gently bring to a boil while stirring constantly. The sugar should dissolve into a syrup. Make sure you stir constantly.", "evidence": ["Place 3 cups (600 g) of sugar into the empty saucepan and pour in 1 cup (240 ml) of water. ", "Stir the mixture and turn the heat to high so it begins to boil. The sugar should dissolve and turn into a syrup."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How will I know when it's ready?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Two ways: when it starts to thicken and get really sticky. If you have an instant-read thermometer, you should also use it now. The syrup has to be hot enough (110 degrees/230 F) in order to candy the peels properly. What we want to do now is place all the peels into the syrup -- slowly!! -- and stir them in. Turn the heat down to a simmer and stop stirring. Now you need to let the strips simmer for 30 minutes. It could be more or less depending on the temperature.", "evidence": ["Insert an instant-read thermometer to check the temperature of the syrup. Once the temperature is at 230 degrees F (110 degrees C), stir in the orange peel strips.", "Turn the heat down to a gentle bubble and let the strips simmer for about 30 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How will I know when it's simmered for long enough?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The strips will look almost clear/translucent. Once they are at that point, you need to dry the strips out. Turn off the burner and scoop the strips out with a fork or slotted spoon. Spread them out on a wire rack with some paper towel underneath and leave them somewhere cool and dry for 4-5 hours. Once they're as dry as you like, they're ready to eat.", "evidence": ["The strips should become almost clear once they've finished cooking.", "Turn off the heat and use a slotted spoon to scoop the orange peel strips out of the saucepan. Place them in a single layer on a wire rack and let them cool for 4 to 5 hours.", "They should completely dry out. For an extra crunch, you can roll the strips in some granulated sugar before you dry them."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Can I add anything else to the strips? Like sugar or spices?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! If you'd like some extra flavour, you should roll the strips in sugar or powdered spices now, while they're sticky and before they start drying out. Once dry, they're finished! You can use them in many different ways, like in desserts, or you can just eat them on their own. You can dip them in chocolate as well, but if you do make sure they are stored in the fridge.", "evidence": [" For an extra crunch, you can roll the strips in some granulated sugar before you dry them.", "Eat the strips or garnish desserts with them as soon as they're dried. You can store the leftover candied orange strips in an airtight container for up to 3 months", "You can also dip the candied orange strips in melted chocolate. Let the chocolate harden and eat the strips or store them in the refrigerator."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks! I think I'll try them with dark choclate and a little salt!", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "I'm excited to try them!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Candied Orange Peel", "url": "https://www.wikihow.com/Make-Candied-Orange-Peel", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Citrus Fruits"], "procedure": [{"summary": "Wash and cut the oranges.", "description": "Wash 4 oranges and use a sharp knife to cut each orange into four pieces or wedges. If you're concerned about consuming pesticides, use organic oranges in this recipe.", "img": "https://www.wikihow.com/images/thumb/c/c1/Make-Candied-Orange-Peel-Step-11-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-11-Version-2.jpg"}, {"summary": "Peel and cut the peels into strips.", "description": "Pull the fruit away from the peels. Take a spoon and scrape away as much of the white pith as you can. Use a knife to cut the peels into long, narrow strips. They should be about ⁄4 inch (0.6 cm) (6 mm) wide. You can eat the fruit or save it to use in another recipe.", "img": "https://www.wikihow.com/images/thumb/b/b6/Make-Candied-Orange-Peel-Step-12-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-12-Version-2.jpg"}, {"summary": "Boil and drain the strips.", "description": "Place the strips of orange peel into a large saucepan and pour in enough water to cover them. Turn the heat on to high and bring the water to a boil. When the water boils, you can turn off the heat and place a colander in the sink. Drain the water through the colander and return the strips to the saucepan.", "img": "https://www.wikihow.com/images/thumb/6/60/Make-Candied-Orange-Peel-Step-13-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-13-Version-2.jpg"}, {"summary": "Boil and drain the strips two more times.", "description": "Fill the pot with new water so the orange peel strips are covered. Bring the water to boil and drain it again. Repeat this another time for a total of three times. Drain the strips into the colander. Boiling the strips and draining them three times removes the bitterness from the peel.", "img": "https://www.wikihow.com/images/thumb/8/88/Make-Candied-Orange-Peel-Step-14-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-14-Version-2.jpg"}, {"summary": "Create a simple syrup.", "description": "Place 3 cups (600 g) of sugar into the empty saucepan and pour in 1 cup (240 ml) of water. Stir the mixture and turn the heat to high so it begins to boil. The sugar should dissolve and turn into a syrup.", "img": "https://www.wikihow.com/images/thumb/4/48/Make-Candied-Orange-Peel-Step-15-Version-2.jpg/v4-460px-Make-Candied-Orange-Peel-Step-15-Version-2.jpg"}, {"summary": "Add the strips and simmer them for 30 minutes.", "description": "Insert an instant-read thermometer to check the temperature of the syrup. Once the temperature is at 230 degrees F (110 degrees C), stir in the orange peel strips. Turn the heat down to a gentle bubble and let the strips simmer for about 30 minutes. The strips should become almost clear once they've finished cooking. If you live at a high elevation, you may need a much longer cooking time.", "img": "https://www.wikihow.com/images/thumb/3/3f/Make-Candied-Orange-Peel-Step-16.jpg/v4-460px-Make-Candied-Orange-Peel-Step-16.jpg"}, {"summary": "Dry the strips for 4 to 5 hours.", "description": "Turn off the heat and use a slotted spoon to scoop the orange peel strips out of the saucepan. Place them in a single layer on a wire rack and let them cool for 4 to 5 hours. They should completely dry out. For an extra crunch, you can roll the strips in some granulated sugar before you dry them.", "img": "https://www.wikihow.com/images/thumb/c/c3/Make-Candied-Orange-Peel-Step-17.jpg/v4-460px-Make-Candied-Orange-Peel-Step-17.jpg"}, {"summary": "Use or store the candied orange strips.", "description": "Eat the strips or garnish desserts with them as soon as they're dried. You can store the leftover candied orange strips in an airtight container for up to 3 months. You can also dip the candied orange strips in melted chocolate. Let the chocolate harden and eat the strips or store them in the refrigerator.", "img": "https://www.wikihow.com/images/thumb/f/f3/Make-Candied-Orange-Peel-Step-18.jpg/v4-460px-Make-Candied-Orange-Peel-Step-18.jpg"}]}}