{"conversation": [{"text": "Hello, I would like to help you try out a new recipe. Would you be interested in learning how to make coconut oil cakes. I can walk you through it and you can ask my for whatever help you need.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I would love to learn how to make that. Can you really help me?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "To start with you will have to turn on the oven and prepare your pan. Preheat your oven to 350 and spray 2 9 inch pans with baking spray. If you prefer, this will make 24 cupcakes.", "evidence": ["Turn on the oven and prepare your pan"], "id": "Agent", "dialog_act": "answer question"}, {"text": "That's easy enough. What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next you will mix 3 cups of flour, 2 cups of sugar, 6 tablespoons of cocoa, 2 teaspoons of baking soda and half a teaspoon of salt. Mix together until combine.", "evidence": ["Mix the dry ingredients"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I know when it is mixed enough?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will want to whisk until the ingredients are a uniform tan color. Now you will pour in 2 cups of water and turn the mixer on low.", "evidence": ["Continue whisking until the dry ingredients are a uniform tan color."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Should I be using hot water?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will want to add cold water. When the mixer is running add 3/4 cup of coconut oil, 2 tablespoons of vinegar and 1 tablespoon of vanilla.", "evidence": ["Pour in 2 cups (470 ml) of cold water"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have rice wine vinegar will that work?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will want to use white vinegar. Mix the batter and divide into your prepared pans.", "evidence": ["2 tablespoons of white vinegar"], "id": "Agent", "dialog_act": "answer question"}, {"text": "How long should I mix the batter for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Mix the batter until it is smooth.", "evidence": ["Keep mixing the ingredients until the batter is smooth."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it and now they are ready to go in the oven?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now bake your cakes for 30 minutes.", "evidence": ["If you're using the 9-inch cake pans, bake the cakes for about 30 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How will I know if they are done?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The tops should feel firm and spring back. If your finger leaves an indent they are not quite ready. You can also check with a cake tester, they are done if it comes out clean.", "evidence": ["They should feel firm and spring back."], "id": "Agent", "dialog_act": "answer question"}, {"text": "And is there anything else to it?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You will just want to cook the cake for 15 to 20 minutes on a cooling rack. You can then flip them out of the pans to finish cooling. If you want to frost them just make sure they are completely cool before doing so!", "evidence": ["Cool the cake"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "That's great! I can't wait to make these.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Coconut Oil Cakes", "url": "https://www.wikihow.com/Make-Coconut-Oil-Cakes", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes"], "procedure": [{"summary": "Turn on the oven and prepare your pan.", "description": "Preheat the oven to 350 degrees F (175 C). Spray two 9-inch cake pans with baking spray. If you'd like more layers, you can also bake the cake in three 8-inch cake pans. Set the pans aside while you mix the cake batter. If you want to make cupcakes, you can prepare a muffin tin. This recipe will also make 24 chocolate cupcakes made with coconut oil.", "img": "https://www.wikihow.com/images/thumb/0/0a/Make-Coconut-Oil-Cakes-Step-7.jpg/v4-460px-Make-Coconut-Oil-Cakes-Step-7.jpg"}, {"summary": "Mix the dry ingredients.", "description": "Place 3 cups (375 g) of flour, 2 cups of (450 g) of sugar, 6 tablespoons of cocoa, 2 teaspoons of baking soda, and ½ teaspoon of salt into a large mixing bowl. Whisk the dry ingredients until the mixture is combined. You shouldn't see any pockets of flour or cocoa. Continue whisking until the dry ingredients are a uniform tan color.", "img": "https://www.wikihow.com/images/thumb/5/5d/Make-Coconut-Oil-Cakes-Step-8.jpg/v4-460px-Make-Coconut-Oil-Cakes-Step-8.jpg"}, {"summary": "Add the wet ingredients.", "description": "Pour in 2 cups (470 ml) of cold water into the dry ingredients and turn your mixer on low. While the mixer runs, add ¾ cup (155 g) of coconut oil, 2 tablespoons of white vinegar, and 1 tablespoon of vanilla extract. Keep mixing the ingredients until the batter is smooth. Since this recipe doesn't rely on butter or eggs for volume, you don't need to worry about over beating the cake batter.", "img": "https://www.wikihow.com/images/thumb/7/71/Make-Coconut-Oil-Cakes-Step-9.jpg/v4-460px-Make-Coconut-Oil-Cakes-Step-9.jpg"}, {"summary": "Bake the chocolate cake.", "description": "Divide the batter among your prepared cake pans. Smooth the tops with an offset spatula and place the cake pans in the preheated oven. If you're using the 9-inch cake pans, bake the cakes for about 30 minutes. If you're using the 8-inch cake pans, bake them for about 25 minutes. Check to see if they're done before removing them from the oven. You can carefully touch the tops of the cakes. They should feel firm and spring back. If your finger leaves an indentation, the cakes need to bake longer. You can also insert a cake tester which should come out clean.", "img": "https://www.wikihow.com/images/thumb/e/e8/Make-Coconut-Oil-Cakes-Step-10.jpg/v4-460px-Make-Coconut-Oil-Cakes-Step-10.jpg"}, {"summary": "Cool the cake.", "description": "Remove the baked cakes from the oven and place them on a cooling rack for 15 to 20 minutes. You can then flip them out of the pans and onto the cooling rack to finish cooling completely. Frost the cakes with any kind of frosting or glaze. Just ensure that the cake is completely cool before you frost it or the frosting will slide off or soak into the cake.", "img": "https://www.wikihow.com/images/thumb/3/34/Make-Coconut-Oil-Cakes-Step-11.jpg/v4-460px-Make-Coconut-Oil-Cakes-Step-11.jpg"}, {"summary": "Finished.", "description": "", "img": "https://www.wikihow.com/images/thumb/0/05/Make-Coconut-Oil-Cakes-Final.jpg/v4-460px-Make-Coconut-Oil-Cakes-Final.jpg"}]}}