{"conversation": [{"text": "Hello, I am here to assist you with making Fry Sauce.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Okay - great. First of all, what ingredients do I need?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You don't actually necessarily need too many ingredients. We can make this with as few ingredients as just ketchup and mayonnaise. However, we can also make substitutions (like ketchup with barbeque sauce, or mayonaise with miracle whip). Also optional are ground spices, hot sauce, vinegar, and pickle juice if you have it.", "evidence": ["2 parts mayonnaise and 1 part ketchup", "Miracle Whip, or low-fat version mayo", "Add vinegar for tangier, smoother sauce recipes", " salt, pepper, and a little vinegar", "hot sauce for an added kick", " BBQ sauce for ketchup to get a smokier flavor", " spices and sauces", " 1/4 cup white sugar", " 1/4 cup white sugar", " 1/4 cup white sugar", "pickle juice"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, well I've got ketchup and mayo for sure. I also have some garlic powder, paprika, and tobasco. Can you show me how to make fry sauce using just these ingredients?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, we can absolutely make a fry sauce using only these ingredients. Are you ready to begin?", "evidence": [" To make it, simply mix together some ketchup and twice as much mayo"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I am absolutely ready. Please tell me what to do first!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "First, I want you to mix two parts mayonnaise to one part ketchup. The quantity is up to you and will depend on how much sauce you want.", "evidence": ["Mix 2 parts mayonnaise and 1 part ketchup."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, that was easy. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Are you interested in having a spicy sauce?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I think that'd be quite nice!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "In that case, add the hot sauce you mentioned having earlier. I'd also ask you to double check your cupboards and see if you have any ground spices that may impart heat, such as cayenne pepper or hot chili powder, for example.", "evidence": ["Mix in 1 tablespoon hot sauce for an added kick", "Mix up spices and sauces for a decadent spiced fry sauce"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh! Yeah, I do have hot chili powder as well as tobasco. I'll add both. Should I target a specific amount?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It is difficult and perhaps meaningless to provide a specific amount since what is \"right\" will depend on your tastes and preferences. Just to try have fun and estimate based on your own spiciness tolerance. I'd recommend erring on the side of caution. You can always add more hot sauce to taste later on, but you won't be able to take it out!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oh, that's a good point. Okay. I'll just add a tiny bit of tobasco and hot chili powder. Done. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now just mix everything together!", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wow! I can't believe it's that easy! I can't wait to try this out. Uh, what do you think I can use this for, anyway?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's entirely up to you - but in general, anything that you would add ketchup to, you can add your special fry sauce to! E.g., hamburgers, hot dogs", "evidence": ["Serve fry sauce with anything you'd eat with ketchup", "no wrong way to use fry sauce, "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great! I can't wait to try this out with some potato patties. I think it'll taste really good. Thanks again!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You're welcome :) Anything else I can help you with?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Nope - I think I've got it all figured out. Thanks again! Goodbye!", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Awesome! How do I exit this thing now...", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Fry Sauce", "url": "https://www.wikihow.com/Make-Fry-Sauce", "category": ["Food and Entertaining", "Recipes", "Jams Preserves and Condiments", "Sauces"], "procedure": [{"summary": "Mix 2 parts mayonnaise and 1 part ketchup.", "description": "The most common fry sauce is simply a mixture of two classic condiments. To make it, simply mix together some ketchup and twice as much mayo. So, if you used 1/2 cup ketchup, you'd mix in 1 full cup of mayonnaise. For healthier sauce, try using Miracle Whip, or low-fat version mayo.", "img": "https://www.wikihow.com/images/thumb/e/e3/Make-Fry-Sauce-Step-1-Version-2.jpg/v4-460px-Make-Fry-Sauce-Step-1-Version-2.jpg"}, {"summary": "Add vinegar for tangier, smoother sauce recipes.", "description": "Looking for a little extra flavor in your fry sauce? Mix things up with some salt, pepper, and a little vinegar for an added punch. Because there is vinegar, a common ingredient in ketchup, you actually need less of the red stuff. In a bowl, mix the following ingredients well:\n1/4 cup mayonnaise\n2 tablespoons ketchup\n1 teaspoon vinegar\n1/2 teaspoon ground black pepper\n1/2 teaspoon sea salt", "img": "https://www.wikihow.com/images/thumb/a/a5/Make-Fry-Sauce-Step-2-Version-2.jpg/v4-460px-Make-Fry-Sauce-Step-2-Version-2.jpg"}, {"summary": "Mix in 1 tablespoon hot sauce for an added kick.", "description": "In order to get a little heat in your life, throw in a dash (1-2 tablespoons) of your favorite hot sauce.", "img": "https://www.wikihow.com/images/thumb/4/48/Make-Fry-Sauce-Step-3.jpg/v4-460px-Make-Fry-Sauce-Step-3.jpg"}, {"summary": "Substitute BBQ sauce for ketchup to get a smokier flavor.", "description": "The base of most barbecue sauces, tomato paste and vinegar, are the same basic ingredients as ketchup. BBQ sauce simply has spices already added, and usually has a richer flavor than ketchup. Mix in 1 part BBQ and 2 parts mayo for your final fry sauce.", "img": "https://www.wikihow.com/images/thumb/d/d1/Make-Fry-Sauce-Step-4.jpg/v4-460px-Make-Fry-Sauce-Step-4.jpg"}, {"summary": "Mix up spices and sauces for a decadent spiced fry sauce.", "description": "It is easy to customize and change fry sauce to meet your needs, and the following spices all go well with the mixture. Try them individually, or try them all together for a rich, delectable sauce. Note that the following mixtures are measured out for a base of 1 cup mayo, 1/2 cup ketchup. 2 tablespoons mayonnaise\n1/4 cup white sugar\n1/2 teaspoon salt\n1/8 teaspoon paprika\n1/4 teaspoon ground mustard\n1/2 teaspoon onion powder\n1 teaspoon garlic powder\n2 tablespoons red wine vinegar\n1 teaspoon Worcestershire sauce", "img": "https://www.wikihow.com/images/thumb/f/ff/Make-Fry-Sauce-Step-5.jpg/v4-460px-Make-Fry-Sauce-Step-5.jpg"}, {"summary": "Try a few teaspoons of pickle juice for some tangy kick.", "description": "It might sound odd, but pickle juice is mostly vinegar, and it's already been established that it goes well with fry sauce. Start with roughly 1 teaspoon at a time, testing each time. The sauce can quickly become \"pickley\" if you're not careful.", "img": "https://www.wikihow.com/images/thumb/e/ec/Make-Fry-Sauce-Step-6.jpg/v4-460px-Make-Fry-Sauce-Step-6.jpg"}, {"summary": "Serve fry sauce with anything you'd eat with ketchup.", "description": "Of course fry sauce is good on french fries. But it is also incredible on burgers, sandwiches, chicken nuggets. There is, of course, no wrong way to use fry sauce, but it is generally best with comfort food or anything you would put ketchup or mayonnaise on separately. Many other countries have made and adapted Fry Sauces, often calling them \"American Sauce.\" In French-speaking countries like Belgium, \"sauce American\" is a popular condiment with fries.", "img": "https://www.wikihow.com/images/thumb/7/7a/Make-Fry-Sauce-Step-7.jpg/v4-460px-Make-Fry-Sauce-Step-7.jpg"}]}}