{"conversation": [{"text": "You need 1 cup of rice for the pan.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "What kind of rice do I need to use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Type of rice does not matter, once you add herbs and spices, those will incorporate to the flavor", "evidence": ["Put 1 cup (175-185 grams) of rice into a pan", "Put 1 cup (175-185 grams) of rice into a pan", "Put 1 cup (175-185 grams) of rice into a pan", "Your choice of herbs and spices will depend on the specific flavor profile or ethnic cuisine you're interested in making."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you. What is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Use 1 tablespoon of oil (type also does not matter, however, it is better ot use fattier oils like sesame or coconut to add to the flavor).", "evidence": ["pour enough cooking oil or butter in to evenly coat it, usually 1 tablespoon", "Avoid grapeseed and canola oil. Instead, use fattier oils like sesame oil, coconut oil, or olive oil to get more flavor."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What should the rice look like when toasting?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It will start to get a brown color and have a nutty aroma.", "evidence": ["You'll know it's starting to toast once you smell a nutty aroma."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, it looks light brown is that correct?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, the is correct!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, what is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next mix in your herbs and spices (usually in amounts between 1/4 teaspoon and 1 teaspoon, depending on what you like). As said earlier, this will add the flavor.", "evidence": ["Mix in the herbs and spices of your choice.", "Your choice of herbs and spices will depend on the specific flavor profile or ethnic cuisine you're interested in making.", "amounts between ¼ teaspoon (1 gram) and 1 teaspoon (4 grams) depending on your tastes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it matter what types of spices? I like garlic personally.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, whatever suits you! Garlic and shallots will give lots of flavor, but oregano, parsley, turmeric all still go well with rice!", "evidence": ["a single shallot, a clove of garlic, or 1 tablespoon (14 grams) of chopped ginger) will give your rice tons of flavor.", "Seasonings like oregano, pepper, parsley and turmeric go well with brown rice, "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Awesome, I used garlic, shallots, oregano, and parsley.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Would you like to know the next step?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Yes, I would like to know the next step", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Boil 2.5 cups of water separately in a pot, once it boils, add to rice.", "evidence": ["While your rice is toasting, boil water separately in a pot or kettle."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Do I add to rice while it is still toasting?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! pour over the seasoned rice.", "evidence": ["When it has reached a boil, pour it over your seasoned rice in the pan."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Awesome, that is complete. What is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Stir the rice, cover, and let sit for 20 minutes. I suggest setting a timer.", "evidence": ["Cook the mixture on low for 20 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Timer just went off! What do I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Let the ride stay in the pot covered for 5 minutes. Then fluff with a fork.", "evidence": ["Once the rice is cooked, let it stand for 5 minutes, then uncover it and fluff it with a fork."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright! Am I done?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yes! Great job and enjoy the rice!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I will! Thank you for the help!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Season Brown Rice", "url": "https://www.wikihow.com/Season-Brown-Rice", "category": ["Food and Entertaining", "Recipes", "Rice and Beans"], "procedure": [{"summary": "Combine your rice  with cooking oil or melted butter in a pan.", "description": "Put 1 cup (175-185 grams) of rice into a pan and pour enough cooking oil or butter in to evenly coat it, usually 1 tablespoon (15 mL). Toast the rice in the oil over medium heat. You'll know it's starting to toast once you smell a nutty aroma. Avoid grapeseed and canola oil. Instead, use fattier oils like sesame oil, coconut oil, or olive oil to get more flavor.", "img": "https://www.wikihow.com/images/thumb/4/49/Season-Brown-Rice-Step-1-Version-2.jpg/550px-nowatermark-Season-Brown-Rice-Step-1-Version-2.jpg"}, {"summary": "Mix in the herbs and spices of your choice.", "description": "Your choice of herbs and spices will depend on the specific flavor profile or ethnic cuisine you're interested in making. Regardless of what seasonings you choose, sprinkle them over your toasting rice a little bit at a time until they are at the strength you like based on your own tastes. Seasonings like oregano, pepper, parsley and turmeric go well with brown rice, usually in amounts between ¼ teaspoon (1 gram) and 1 teaspoon (4 grams) depending on your tastes. Adding aromatic seasonings in small amounts (a single shallot, a clove of garlic, or 1 tablespoon (14 grams) of chopped ginger) will give your rice tons of flavor.", "img": "https://www.wikihow.com/images/thumb/9/97/Season-Brown-Rice-Step-2-Version-2.jpg/550px-nowatermark-Season-Brown-Rice-Step-2-Version-2.jpg"}, {"summary": "Add 2.5 cups (590 mL) of boiling water to the pan.", "description": "While your rice is toasting, boil water separately in a pot or kettle. When it has reached a boil, pour it over your seasoned rice in the pan.", "img": "https://www.wikihow.com/images/thumb/b/ba/Season-Brown-Rice-Step-3-Version-2.jpg/550px-nowatermark-Season-Brown-Rice-Step-3-Version-2.jpg"}, {"summary": "Simmer the rice for 20 minutes.", "description": "After adding the boiling water, stir the contents of your pan and then cover it with a lid. Cook the mixture on low for 20 minutes. Once the rice is cooked, let it stand for 5 minutes, then uncover it and fluff it with a fork.", "img": "https://www.wikihow.com/images/thumb/5/56/Season-Brown-Rice-Step-4-Version-2.jpg/550px-nowatermark-Season-Brown-Rice-Step-4-Version-2.jpg"}]}}