{"conversation": [{"text": "Looks like you're cooking riblets. I'm here to help! :)", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I'm not sure what a Riblet is", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Well let's get started! Do you have the required ingredients?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, where do I start?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Before cooking, let's season your riblets straight into flavor town! Use salt, pepper, and garlic to your hearts content.", "evidence": [" sprinkle them with salt and pepper according to your taste", "you want spicy riblets, use up to 1 tablespoon (8 g) of minced garlic", "you want spicy riblets, use up to 1 tablespoon (8 g) of minced garlic"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "ok Guy Fieri, what next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Well that depends, how are you cooking these Riblets?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "A stove, of course", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Perhaps you would like to try an oven instead. You wont make it very far with a stove.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "That's what I meant", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Then that's what you should have said, silly :) Preheat your OVEN to 275 degrees farenheit. (135 Celsius for our metric folks) and stick those bad boys in the broiler", "evidence": ["275 degrees"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "You're a sassy agent. What if I don't have a broiler?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You're smart you'll figure it out :) And  when you do, make sure you get those piggies cooking until they hit 155 degrees Farenheit", "evidence": ["set the riblets on a sheet.", "Cook the riblets until they're at 155 degrees F (70 degrees C)."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long does that take?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Cooking is more of an art than a science. You can always eyeball it and hope for the best, but its going to be several minutes one side, flip, and a few more on the other until you reach the proper temperature.", "evidence": [" broil them for several minutes", " flip the riblets over. Put them back under the broiler for a few more minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, so I did that. Am I done? Can I eat?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "My friend, we are just getting started! There's more cooking to do, we wouldn't want you getting sick would we? Get those riblets in a roaster, stat. Add 1 cup water, and 1/4 cup liquid smoke flavoring.", "evidence": ["Place the riblets in a roaster with steaming liquid.", "Pour 1/4 cup (60 ml) of liquid smoke flavoring and 1 cup (240 ml) of water into the bottom of the roasting pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How can smoke be a liquid? Why is that a flavor?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I am a cook not a chemist. We have a lot of steps to cover, are you done questioning me?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes. Sorry. I'll keep working on the recipe", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Let me know when you need help again. I'm sure I'll see you soon", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I'm making the sauce. What kind of mustard did I need again?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No one stopping you from using any mustard you want. But the recipe calls for dry mustard. 2 teaspoons of it to be exact.", "evidence": ["2 teaspoons (4 g) dry mustard"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you, its looking good so far!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That's what I'm here for. How do you like your sauce cooked?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I like it thicccc, with four c's", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Don't be weird. Once your sauce is in the saucepan, simmer it for 20 minutes at least to thicken it.", "evidence": ["Stir the sauce occasionally and simmer it for 20 minutes, so the sauce thickens a little.", "Stir the sauce occasionally and simmer it for 20 minutes, so the sauce thickens a little."], "id": "Agent", "dialog_act": "other"}, {"text": "Ok I got the sauce, my riblets are ready, do I just pour the sauce over them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "This is America, you can do whatever you want. But I recommend using a brush to coat your riblets. You can use all the extra sauce you saved for dipping, if you really want to.", "evidence": ["Dip a brush into the sauce and spread it over the cooked riblets.", "extra sauce on the side for dipping"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great, all done thank you so much!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Again always happy to help. Bone apple teeth!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "What does that even mean?", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook Riblets", "url": "https://www.wikihow.com/Cook-Riblets", "category": ["Food and Entertaining", "Recipes", "Meat", "Pork"], "procedure": [{"summary": "Season the riblets and preheat the oven.", "description": "Get out 2.2 pounds (1 kg) of pork riblets and sprinkle them with salt and pepper according to your taste. Rub minced garlic into the riblets for a little extra flavor. If you want spicy riblets, use up to 1 tablespoon (8 g) of minced garlic. Turn the oven on to 275 degrees F (135 degrees C).", "img": "https://www.wikihow.com/images/thumb/6/69/Cook-Riblets-Step-1.jpg/v4-459px-Cook-Riblets-Step-1.jpg"}, {"summary": "Broil the riblets until they're dark.", "description": "Turn on your broiler to high and set the riblets on a sheet. Set the riblets a few inches below the heating element and broil them for several minutes. The meat should turn dark. Carefully remove the sheet and use tongs to flip the riblets over. Put them back under the broiler for a few more minutes so they're seared. Cook the riblets until they're at 155 degrees F (70 degrees C). Insert an instant read thermometer into the riblet meat to check the temperature. If you don't want to broil the riblets, you can sear them on a gas or charcoal grill.", "img": "https://www.wikihow.com/images/thumb/d/dc/Cook-Riblets-Step-2.jpg/v4-460px-Cook-Riblets-Step-2.jpg"}, {"summary": "Place the riblets in a roaster with steaming liquid.", "description": "Place a rack in the bottom of a roasting pan and set the riblets on the rack. They shouldn't be touching the bottom of the pan. Pour 1/4 cup (60 ml) of liquid smoke flavoring and 1 cup (240 ml) of water into the bottom of the roasting pan. Wrap the pan tightly with several layers of aluminum foil. The steaming liquid shouldn't touch the riblets or they'll become bitter. If you're using a smaller roasting pan, you may not need all of the water and liquid smoke.", "img": "https://www.wikihow.com/images/thumb/c/cf/Cook-Riblets-Step-3.jpg/v4-460px-Cook-Riblets-Step-3.jpg"}, {"summary": "Cook the riblets for several hours.", "description": "Put the pan of riblets in the preheated oven and bake them for 2 to 5 hours. Check the temperature of the riblets occasionally and cook them until they're tender. They should reach 155 degrees F (70 degrees C) once they've finished cooking. Cooking time will depend on how many riblets you're cooking, the size of the pan, and the accuracy of your oven.", "img": "https://www.wikihow.com/images/thumb/b/bc/Cook-Riblets-Step-4.jpg/v4-460px-Cook-Riblets-Step-4.jpg"}, {"summary": "Simmer the sauce for 20 minutes.", "description": "Mix together all of the sauce ingredients in a small saucepan. Stir the sauce occasionally and simmer it for 20 minutes, so the sauce thickens a little. You'll need to combine:\n1 cup (240 g) ketchup\n1⁄2 cup (155 g) corn syrup\n1⁄2 cup (170 g) honey\n1⁄4 cup (60 ml) apple cider vinegar\n1⁄4 cup (60 ml) water\n2 tablespoons (43 g) molasses\n2 teaspoons (4 g) dry mustard\n2 teaspoons (4 g) garlic powder\n1 teaspoon (2 g) chili powder\n1 teaspoon (2 g) onion powder", "img": "https://www.wikihow.com/images/thumb/c/cf/Cook-Riblets-Step-5.jpg/v4-459px-Cook-Riblets-Step-5.jpg"}, {"summary": "Brush the sauce on the riblets.", "description": "Dip a brush into the sauce and spread it over the cooked riblets. Serve the riblets while they're still warm and offer extra sauce on the side for dipping.", "img": "https://www.wikihow.com/images/thumb/c/c8/Cook-Riblets-Step-6.jpg/v4-460px-Cook-Riblets-Step-6.jpg"}]}}