{"conversation": [{"text": "Hi, this task is how to make creamy salsa verde chicken enchiladas.  Would you like to get started with the first step?", "evidence": ["Gather the ingredients"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes! What do I need to do first?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great.  First you'll need to gather the ingredients.  The recipe gives 3 to 4 servings and uses store-bought salsa verde to speed up the assembly.", "evidence": ["Gather the ingredients"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What kind of salsa verde do I need?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You'll need a jar of salsa verde with medium heat, or hotter.", "evidence": ["Look for jarred salsa verde with medium heat (or hotter). "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, I've got medium heat salsa verde.  What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Now we'll make the creamy salsa verde sauce.  You'll need to place a medium-sized skillet over a medium heat, add the minced garlic and cook for 1 minute.  Got that?", "evidence": ["Make the creamy salsa verde sauce."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sure, what do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Ok, now you spoon in the salsa verde, stir it in with the garlic, and cook for another minute.  Then remove the skillet from the heat, add the sour cream and chopped cilantro and mix up well.  Season it to taste.", "evidence": ["Spoon in the store-bought salsa verde, stir them together and cook for another minute. Remove the skillet from the heat.", "Add the sour cream and chopped cilantro and mix well. Season the sauce with salt and pepper (to taste)."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What do I season it with?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Season it with salt and pepper, and taste it to check the spiciness of it.  How does it taste, is the spice level right for you?", "evidence": ["Season the sauce with salt and pepper (to taste)."], "id": "Agent", "dialog_act": "answer question"}, {"text": "It's a bit too spicy.  how can I make it less spicy?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add in a little more sour cream if it's too spicy.  Does that taste ok now?", "evidence": ["If, upon tasting, the creamy sauce is too spicy for you, mix in a little more sour cream to temper it."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes it's better now.  What do I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Divide the sauce, set 1 cup of sauce aside.  Once we've done that we can move on to the next step to create the enchilada filling, are you ready?", "evidence": ["Divide the sauce, setting aside 1 cup (120 grams)."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sure.  How do I make the filling?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Mix the shredded chicken and half of the shredded cheese into the main sauce mixture and stir it all together.  Does that look well mixed?", "evidence": ["Place the shredded rotisserie chicken and half of the shredded cheese into the main sauce mixture (not the reserved cup) and stir the ingredients together until mixed well."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What's the main sauce mixture?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It's the mixture that you just created in step one, not the reserved cup that you set aside.  Have you mixed the main sauce together with the chicken and the cheese?", "evidence": ["(not the reserved cup)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes.  what do I do with the reserved cup of sauce?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You need to coat a large baking dish with non-stick cooking spray, then spoon a small amount of your reserved sauce over the bottom of the dish.  Have you done that?", "evidence": ["Coat a large baking dish with non-stick cooking spray. Spoon a small amount of the reserved creamy sauce all over the bottom of the dish."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes it's in the dish now.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Great! Now we're ready to build the enchiladas.  Lay your tortillas out flat, then spoon about 1/3 cup of the chicken filling into each tortilla.  Then roll them up to create the enchiladas.  Have you rolled them up?", "evidence": ["Lay the tortillas out flat. Spoon about 1/3 cup (75 grams) of the chicken filling onto the middle of each one. Roll them up tightly, like cigars, to create the enchiladas."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I roll them up?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Roll them up tightly so they look like cigars.  Have you done that?", "evidence": ["Roll them up tightly, like cigars, to create the enchiladas."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes.  What do I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Now you transfer the rolled enchiladas to the baking dish, lay them side-by-side, seam-side down.  Drizzle the remaining reserved sauce over the top, then scatter the rest of the shredded cheese over the whole dish. Have you transferred all the enchiladas to the dish?", "evidence": ["Transfer the folded enchiladas to the baking dish, one at a time, using a spatula. Lay them side by side, seam-side down. Drizzle the remaining reserved sauce over the top of the enchiladas. Scatter the remaining shredded cheese over the entire dish."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "No how do I transfer them without them all falling apart?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Transfer them one at a time, using a spatula.  Have you done that and covered them?", "evidence": ["one at a time, using a spatula."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes ok that's done now.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Great! Now they're ready to bake.  Cover the dish with foil, put it in the oven, and bake for 15 minutes.  Then check they're heated through, take off the foil, and bake for 10 more minutes.  Then the cheese should go bubbly and lightly browned on top.  How do they look?", "evidence": ["Tightly cover the baking dish with aluminum foil and carefully place it into the oven. Bake for 15 minutes. Check to make sure the enchiladas are heated through, and then take off the foil. ", "Bake for 10 more minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "They're cooking, they look light brown", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Sounds good!  Once the cheese is lightly browned they're ready to serve!  Plate them up and serve immediately.  Do you want to know how to garnish them?", "evidence": ["Plate the enchiladas and serve immediately. Garnish with cilantro, chopped tomato and avocado slices (optional). Serve with tortilla chips (if desired)."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes what's the garnish", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can garnish with cilantro, chopped tomato, and avocado slices if you have them.  And you can serve with tortilla chips on the side.  All optional - the enchiladas are tasty by themselves too!  Enjoy!", "evidence": ["Garnish with cilantro, chopped tomato and avocado slices (optional).", "Serve with tortilla chips (if desired)."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks.  What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's it, you're done... bon appetit!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks for the recipe", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thanks, I enjoyed it", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Creamy Salsa Verde Chicken Enchiladas", "url": "https://www.wikihow.com/Make-Spicy-Chicken-Enchiladas", "category": ["Food and Entertaining", "Recipes", "World Cuisines", "Central and South American Cuisine", "Enchiladas"], "procedure": [{"summary": "Gather the ingredients.", "description": "This is another easy-to-assemble enchilada dish that can be ready and on the table in less than an hour. Prep time is only 10 minutes. Cook time is 30 minutes. The recipe makes use of store-bought salsa verde, which speeds up the assembly quite a bit. Look for jarred salsa verde with medium heat (or hotter). The yield is 3 to 4 servings.", "img": "https://www.wikihow.com/images/thumb/a/a6/Make-Spicy-Chicken-Enchiladas-Step-13.jpg/v4-460px-Make-Spicy-Chicken-Enchiladas-Step-13.jpg"}, {"summary": "Make the creamy salsa verde sauce.", "description": "Heat the canola oil in a medium-sized skillet over medium heat. Add the minced garlic and cook for approximately one minute. Spoon in the store-bought salsa verde, stir them together and cook for another minute. Remove the skillet from the heat. Add the sour cream and chopped cilantro and mix well. Season the sauce with salt and pepper (to taste). If, upon tasting, the creamy sauce is too spicy for you, mix in a little more sour cream to temper it. Divide the sauce, setting aside 1 cup (120 grams).", "img": "https://www.wikihow.com/images/thumb/1/16/Make-Spicy-Chicken-Enchiladas-Step-14.jpg/v4-460px-Make-Spicy-Chicken-Enchiladas-Step-14.jpg"}, {"summary": "Preheat the oven to 350°F (176°C) and create the enchilada filling.", "description": "Place the shredded rotisserie chicken and half of the shredded cheese into the main sauce mixture (not the reserved cup) and stir the ingredients together until mixed well. Coat a large baking dish with non-stick cooking spray. Spoon a small amount of the reserved creamy sauce all over the bottom of the dish.", "img": "https://www.wikihow.com/images/thumb/7/7e/Make-Spicy-Chicken-Enchiladas-Step-15.jpg/v4-460px-Make-Spicy-Chicken-Enchiladas-Step-15.jpg"}, {"summary": "Build the enchiladas.", "description": "Lay the tortillas out flat. Spoon about 1/3 cup (75 grams) of the chicken filling onto the middle of each one. Roll them up tightly, like cigars, to create the enchiladas. Transfer the folded enchiladas to the baking dish, one at a time, using a spatula. Lay them side by side, seam-side down. Drizzle the remaining reserved sauce over the top of the enchiladas. Scatter the remaining shredded cheese over the entire dish.", "img": "https://www.wikihow.com/images/thumb/1/1a/Make-Spicy-Chicken-Enchiladas-Step-16.jpg/v4-460px-Make-Spicy-Chicken-Enchiladas-Step-16.jpg"}, {"summary": "Bake the enchiladas for 15 minutes.", "description": "Tightly cover the baking dish with aluminum foil and carefully place it into the oven. Bake for 15 minutes. Check to make sure the enchiladas are heated through, and then take off the foil. Bake for 10 more minutes, so that the cheese gets bubbly and lightly browned on top. Plate the enchiladas and serve immediately. Garnish with cilantro, chopped tomato and avocado slices (optional). Serve with tortilla chips (if desired).", "img": "https://www.wikihow.com/images/thumb/9/96/Make-Spicy-Chicken-Enchiladas-Step-17.jpg/v4-460px-Make-Spicy-Chicken-Enchiladas-Step-17.jpg"}]}}