{"conversation": [{"text": "Hi there! You're going to need to mix egg, cheese, rice and spices in a bowl.", "evidence": ["Mix cooked rice, egg, cheese, and spices in a bowl."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Hey! Could you give me instructions on what to cook?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You're going to need to combine the 200g rice and 1 egg together in a bowl. Once you've done that, go ahead and add 59.147mL of cheese.", "evidence": ["Combine 200 g (1 c) rice with 1 egg in a bowl. Then add 59.147 mL (0.25000 c) cheese."], "id": "Agent", "dialog_act": "answer question"}, {"text": "200g rice... 1 egg... and 59.147mL of cheese. Alright, done. What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Well done! If you would like to, you can add some spices for some extra flavor. The recipe suggests that you should add in 1tsp of minced garlic, half of a small chopped onion, parsley, red pepper flakes and onion powder.", "evidence": ["mixing half of a small onion (chopped), 4.929 mL (1.000 tsp) minced garlic, and red pepper flakes, onion powder, and parsley"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay! How much pepper flakes, parsley and onion powder should I add though?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add as much as you prefer. If you like spice, you might add a little bit extra. If you aren't a fan of spice, you might skip this step entirely.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "I went ahead and added the spice. Thank you for the suggestion. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now you should form rice patties with the mixture of rice, egg, cheese and spices you have in your bowl. You can make the patties small or you can make them big. It is entirely up to you.", "evidence": ["The size of the patties is up to you — they can be cookie-sized or pancake-sized."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "The patties are shaped like mini-pizzas now! But they look slightly yellow. Is that supposed to happen?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, that's completely fine. They're only yellow because of the egg you added in earlier. Can you also make sure that the rice is sticking together well enough?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "The rice isn't sticking together too well. It's falling apart. What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Go ahead and add another egg into the mixture. This way, it won't fall apart and the rice mixture will be stickier.", "evidence": ["add another egg to the mixture to increase the stickiness."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I went ahead and added an extra egg and mixed it together for a little longer. Now it's so much more sticky! What's the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Place the patties in the fridge for a minimum of 30 minutes. This way, the patties maintain their shape during the frying process.", "evidence": ["be sure they have at least 30 minutes to chill."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'm back! The patties have been in the fridge for around 32 minutes. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, pour 1-2 tbsp of olive oil in a frying pan or skillet on medium/high heat. Wait until you hear the oil crackling and popping, then send me a message back.", "evidence": ["Heat 14.79 to 29.57 milliliters (1.0 fl oz) (1-2 tbsp) of olive oil in a skillet on medium high heat"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "The oil is crackling! I believe it's ready. What's the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Finally, you're going to need to fry the patties for 5 minutes on both sides. Since you're patties are smaller, 5 minutes should be just enough. You will have to be slightly careful when flipping them though, because they are quite delicate.", "evidence": ["Fry the patties for about 5 minutes on each side."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "The patty is becoming brown on one side... is that supposed to happen?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, perfect! Go ahead and flip it and make sure the other side is golden brown. Once both sides are golden brown, bon appetit!", "evidence": ["You'll know that they're ready when the surface of the rice becomes golden brown"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you! These are delicious. I'll be making them again sometime soon! :)", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "My pleasure! Enjoy!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I'll see you soon! Looking forward to making some more meals with you.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Cheesy Rice Cakes", "url": "https://www.wikihow.com/Make-Rice-Cakes", "category": ["Food and Entertaining", "Recipes", "Rice and Beans"], "procedure": [{"summary": "Mix cooked rice, egg, cheese, and spices in a bowl.", "description": "Combine 200 g (1 c) rice with 1 egg in a bowl. Then add 59.147 mL (0.25000  c) cheese. It's super easy because all the mixing is done in one bowl! If you'd like, you can dress up this recipe by mixing half of a small onion (chopped), 4.929 mL (1.000  tsp) minced garlic, and red pepper flakes, onion powder, and parsley to taste. This recipe also lends itself really well to experimenting. Add your favorite vegetables and spices to make the patties your own. Carrots or green onions might be yummy additions.", "img": "https://www.wikihow.com/images/thumb/e/e4/Make-Rice-Cakes-Step-8-Version-3.jpg/550px-nowatermark-Make-Rice-Cakes-Step-8-Version-3.jpg"}, {"summary": "Form small patties with the rice.", "description": "The size of the patties is up to you — they can be cookie-sized or pancake-sized. However, just remember that the larger the patties are, the longer they'll need to cook. If you feel like your rice is not sticking together enough, add another egg to the mixture to increase the stickiness.", "img": "https://www.wikihow.com/images/thumb/b/b8/Make-Rice-Cakes-Step-9-Version-3.jpg/550px-nowatermark-Make-Rice-Cakes-Step-9-Version-3.jpg"}, {"summary": "Chill the patties for at least 30 minutes in the fridge.", "description": "This will help them retain their shape when you fry them afterward. You'll want the rice to stick together as much as possible. You can leave them in the fridge for longer than this if necessary, but be sure they have at least 30 minutes to chill.", "img": "https://www.wikihow.com/images/thumb/e/e8/Make-Rice-Cakes-Step-10-Version-3.jpg/550px-nowatermark-Make-Rice-Cakes-Step-10-Version-3.jpg"}, {"summary": "Heat 14.79 to 29.57 milliliters (1.0  fl oz) (1-2 tbsp) of olive oil in a skillet on medium high heat.", "description": "The oil should form a thick coat over the bottom of the pan. You'll want the oil to be crackling and popping before you put the patties in.", "img": "https://www.wikihow.com/images/thumb/6/6d/Make-Rice-Cakes-Step-11-Version-3.jpg/550px-nowatermark-Make-Rice-Cakes-Step-11-Version-3.jpg"}, {"summary": "Fry the patties for about 5 minutes on each side.", "description": "You'll know that they're ready when the surface of the rice becomes golden brown. Remember, larger patties will probably need a few extra minutes to fully cook. Be careful when flipping the patties, as they can easily break. This won't affect the taste at all, but they just won't look pretty on a plate. It's best to eat cheesy rice cakes right after eating them, as the oil will go rancid if you try to store it.", "img": "https://www.wikihow.com/images/thumb/8/8b/Make-Rice-Cakes-Step-12-Version-3.jpg/550px-nowatermark-Make-Rice-Cakes-Step-12-Version-3.jpg"}]}}