{"conversation": [{"text": "Hi, I am going to teach you how to make Ricotta Cheese. You should start by preparing the strainer", "evidence": ["Prepare the strainer"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What will I need?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will first need to line a fine-mesh strainer with a large piece of cheesecloth and set it over a nonreactive bowl.", "evidence": ["strainer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Done. What's next? First though, what ingredients will I need??", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will need milk, cream, salt and lemon juice.", "evidence": ["milk, cream and salt", "lemon juice"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, I have the ingredients. What is next after I have put the cheesecloth over a nonreactive bowl?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "We will now go to the next step. Start by placing the milk, cream and salt in a saucepan and heating over a medium-high heat until it reaches 200 degrees F.", "evidence": ["Set this contraption on your work surface so to have it ready for the cheese mixture", "Place the milk, cream and salt in the saucepan and heat the mixture over medium-high heat. Allow it to heat until it reaches 200 degrees F."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "All done. Is there anything to do while that is being done?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should decide on the flavour of your cheese ricotta. You can use vinegar, lime or animal rennet for a more traditional touch. I recommend using lime.", "evidence": ["The curdling agent in this case is vinegar, but some people prefer to use other substances", "Try substituting 3 tablespoons (44.4 ml) of lemon juice for a different flavor", "For a more traditional touch, try using animal rennet as your coagulant"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have the lime ready", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Once the mixture is hot enough, turn off heat and allow to cool down for about 5 minutes. You should also stir the mixture to prevent it from scorching on the bottom.", "evidence": ["When the mixture is hot enough, turn off the heat and move the saucepan so the milk can begin to cool. It should take about 5 minutes to reach the correct temperature", "Stir the mixture as it's heating to prevent it from scorching on the bottom"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Done. I am ready to move on. What is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Before that, you have to check that it has reached the right temperature. If you don't let it cook long enough, the curds won't seperate from the whey and if you overcook, the texture will be ruined.", "evidence": ["Use your candy thermometer or an instant-read thermometer to determine whether the mixture has reached the right temperature", "If you don't let it cook long enough, the curds won't separate from the whey", "If you overcook it, the texture will be ruined"], "id": "Agent", "dialog_act": "ask question"}, {"text": "What do I need to check the temperature?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Use either a candy thermometer or an instant-read thermometer. After that, we will move on to the last steps.", "evidence": ["Use your candy thermometer or an instant-read thermometer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I am ready to move on", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Slowly pour in 3 tablespoons of lime (44.4 ml) whilst the other hand stirs. Then, you will have to wait 10-20 minutes for the the coagulant to work and cause the curds to separate from the whey. It's ready when the curds have floated to the top to form a thick layer.", "evidence": ["Use one hand to stir constantly while the other hand slowly pours", "3 tablespoons (44.4 ml) of lemon juice"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "All done, what's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Scoop out the tick layer of curds and ladle them over the cheesecloth-covered strainer. Keep ladling until all that is left is the whey. You can then discard the whey.", "evidence": ["Ladle the curds into the strainer", "Scoop out the thick top layer of curds and ladle them over the cheesecloth-covered strainer", "Keep ladling out the curds until all that's left in the saucepan is the whey", "You can discard the whey at this point"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Are we nearly done?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We have reached the last two steps. First, wait at least an hour for the whey to drain from the ricotta through the cheesecloth into the bowl. It will take about 30 minutes for the ricotta to fully drain. DO NOT stir or push it through the cheesecloth. Once the allotted time has passed, the ricotta is ready to be used in your favourite recipe. Enjoy", "evidence": ["Let the ricotta drain", "Spoon the ricotta into a bowl"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thank you so much", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Goodbye", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Goodbye and thanks again.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Ricotta Cheese", "url": "https://www.wikihow.com/Make-Ricotta-Cheese", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy", "Cheese"], "procedure": [{"summary": "Prepare the strainer.", "description": "Line the fine-mesh strainer with a large piece of cheesecloth, and set it over the nonreactive bowl. Set this contraption on your work surface so to have it ready for the cheese mixture. If you don't use cheesecloth, it will be difficult to separate the cheese curds from the whey. You can substitute a double layer of paper towels or a thin cotton dishcloth in a pinch.", "img": "https://www.wikihow.com/images/thumb/e/ee/Make-Ricotta-Cheese-Step-1.jpg/v4-460px-Make-Ricotta-Cheese-Step-1.jpg"}, {"summary": "Heat the milk, cream and salt.", "description": "Place the milk, cream and salt in the saucepan and heat the mixture over medium-high heat. Allow it to heat until it reaches 200 degrees F. When the mixture is hot enough, turn off the heat and move the saucepan so the milk can begin to cool. It should take about 5 minutes to reach the correct temperature. Stir the mixture as it's heating to prevent it from scorching on the bottom. Use your candy thermometer or an instant-read thermometer to determine whether the mixture has reached the right temperature. If you don't let it cook long enough, the curds won't separate from the whey. If you overcook it, the texture will be ruined.", "img": "https://www.wikihow.com/images/thumb/d/d2/Make-Ricotta-Cheese-Step-2.jpg/v4-460px-Make-Ricotta-Cheese-Step-2.jpg"}, {"summary": "Slowly add the vinegar.", "description": "Use one hand to stir constantly while the other hand slowly pours the vinegar into the heated milk and cream mixture. The vinegar will cause the curds to coagulate and separate from the whey. You'll see solid bits forming and floating to the top of the liquid. Keep stirring until all of the vinegar has been added. The curdling agent in this case is vinegar, but some people prefer to use other substances. Try substituting 3 tablespoons (44.4 ml) of lemon juice for a different flavor. For a more traditional touch, try using animal rennet as your coagulant. Mix 1 teaspoon of rennet with 1/4 cup of cold water, then stir it into the milk mixture.", "img": "https://www.wikihow.com/images/thumb/1/15/Make-Ricotta-Cheese-Step-3.jpg/v4-460px-Make-Ricotta-Cheese-Step-3.jpg"}, {"summary": "Let the mixture sit until it's thick.", "description": "Wait about 10 - 20  minutes for the coagulant to go to work and cause the curds to separate from the whey. It's ready when the curds have floated to the top to form a thick layer, leaving the liquid whey underneath.", "img": "https://www.wikihow.com/images/thumb/9/96/Make-Ricotta-Cheese-Step-4.jpg/v4-460px-Make-Ricotta-Cheese-Step-4.jpg"}, {"summary": "Ladle the curds into the strainer.", "description": "Scoop out the thick top layer of curds and ladle them over the cheesecloth-covered strainer. Keep ladling out the curds until all that's left in the saucepan is the whey. You can discard the whey at this point.", "img": "https://www.wikihow.com/images/thumb/6/61/Make-Ricotta-Cheese-Step-5.jpg/v4-460px-Make-Ricotta-Cheese-Step-5.jpg"}, {"summary": "Let the ricotta drain.", "description": "Wait at least an hour for the last of the whey to drain from the ricotta through the cheesecloth into the bowl. It will take about half an hour for the ricotta to fully drain. Don't attempt to stir it or push it through the cheesecloth, as this will just push the curds into the cloth. If you'd like a creamier final product, stop draining the ricotta after 5 - 10 minutes. For a drier final product, wait an hour for it to drain.", "img": "https://www.wikihow.com/images/thumb/0/05/Make-Ricotta-Cheese-Step-6.jpg/v4-460px-Make-Ricotta-Cheese-Step-6.jpg"}, {"summary": "Spoon the ricotta into a bowl.", "description": "The finished ricotta is now ready to use in your favorite recipe. It's delicious as part of a savory dish or a dessert. Ricotta will keep in the refrigerator for about a week.", "img": "https://www.wikihow.com/images/thumb/c/c8/Make-Ricotta-Cheese-Step-7.jpg/v4-460px-Make-Ricotta-Cheese-Step-7.jpg"}]}}