{"conversation": [{"text": "Hello, this is your first step in creating a delicious breakfast - eggs on toast!", "evidence": ["Warm a greased skillet over medium heat."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Hello, what equipment and ingredients do I need first?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will need: a medium-sized skillet and a knob of your preferred cooking fat (e.g., butter, oil). Add the cooking fat to the pan and turn on medium heat on your hob. Let the pan heat up for 1 minute before moving onto the next step.", "evidence": ["Warm a greased skillet over medium heat", "Add butter, oil, or any other type of cooking fat to a medium-sized skillet", "Let the pan heat up for about a minute"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have added butter to the pan and let it heat up on medium for 1 minute. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now it's time to add the eggs to the heated pan. Before this, it is important to consider how many people you are feeding and how you like your eggs (e.g., fried, over-easy, scrambled)", "evidence": ["Add your eggs to the heated skillet and cook over medium heat.", "Once your pan is warmed up, you can add the eggs. ", "Use any amount of eggs you like, depending on how many people you are feeding. ", "scrambled eggs", "fried or over-easy eggs"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I am feeding 2 people and we like our eggs fried.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "For two people, you can add 2-4 eggs depending on how hungry you are! To make fried eggs, all you need to do is crack the eggs directly into the pan. Or - if this makes you nervous, you can crack the eggs into a bowl to catch any stray shell pieces, and then pour this directly into the pan", "evidence": ["If you want fried or over-easy eggs, just crack the eggs into the pan.", "If you are nervous about cracking eggs directly into the pan, you can crack them in a bowl first to be sure you catch any stray shell pieces. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, I have cracked 4 eggs into the pan. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Good stuff. While the eggs are cooking, I suggest popping some bread into the toaster so that your toast is ready when your eggs are finished. Choose whichever bread you prefer.", "evidence": ["Toast your bread while your eggs are cooking.", "While your eggs cook, you will want to be sure to get your bread toasting, so it will be done when the eggs finish cooking"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, I have put some bread in the toaster. Do I need to do anything to the eggs in the pan?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, for fried eggs, you need to flip the eggs once the bottom has browned. How long have your eggs been on for?", "evidence": ["If you are making a fried or over-easy egg, flip the egg once the bottom has browned", "Flip the eggs once the bottoms have cooked completely."], "id": "Agent", "dialog_act": "ask question"}, {"text": "They've been on for about 2 minutes now. I've checked the bottom and they seem to be turning brown?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Ok, it usually takes around 3 minutes for eggs to brown. Keep an eye on them for the next minute and flip them when the bottom is brown.", "evidence": ["This usually takes about three minutes. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have flipped the eggs now. They're starting to look and smell good!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Well done! It all seems to be going well. You need to watch the eggs now - you want to make sure that the whites are completely cooked. This is when they are no longer translucent. Do you want me to share some ideas on how to make these eggs even more delicious?", "evidence": ["Cook your eggs until fully cooked", "watch them carefully and cook them until the whites are completely cooked."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I think the eggs are very nearly done. I'd love to know how to make them even better?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It's always a good idea to add some salt and pepper if you want a bit more flavour. Or even some cheese if you like it!", "evidence": ["Think about adding a little bit of cheese to make your eggs on toast that much more delicious", "Don’t forget to add salt and pepper"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you, I'll definitely do this! By the way - my toast has popped, what do i do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Before we move on, have you taken your eggs off of the heat?", "evidence": ["Butter your toast while your eggs cool slightly", "Once your toast is golden brown and toasted, you can spread a small amount of butter over your toast"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Oh... I hadn't - thanks for reminding me! I might have burned them otherwise", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Fantastic. Now it's time to butter your toast - this will also help to enhance the flavour!", "evidence": ["Butter your toast while your eggs cool slightly", "Once your toast is golden brown and toasted, you can spread a small amount of butter over your toast.", "Adding butter will enhance the overall flavor and will eliminate the dryness that can come with toasted bread"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok... I've buttered my toast. Do I just add the eggs now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes. You just need to place the eggs on top of the buttered toast and voila! Time to enjoy your delicious eggs on toast", "evidence": ["Assemble the eggs onto the toast.", "Once your eggs are cooked, and your toast is toasted, it is time to put it all together. ", " Place the eggs on the buttered toast and enjoy your breakfast."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok... all done! Thanks for your help", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem. Well done", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "It's wonderful, thank you", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Eggs on Toast", "url": "https://www.wikihow.com/Make-Eggs-on-Toast", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy", "Egg Basics"], "procedure": [{"summary": "Warm a greased skillet over medium heat.", "description": "Add butter, oil, or any other type of cooking fat to a medium-sized skillet. Let the pan heat up for about a minute, long enough that the eggs will start cooking as soon as they enter the pan but not too long that the butter browns.", "img": "https://www.wikihow.com/images/thumb/9/9f/Make-Eggs-on-Toast-Step-1-Version-2.jpg/v4-460px-Make-Eggs-on-Toast-Step-1-Version-2.jpg"}, {"summary": "Add your eggs to the heated skillet and cook over medium heat.", "description": "Once your pan is warmed up, you can add the eggs. Use any amount of eggs you like, depending on how many people you are feeding. If you want fried or over-easy eggs, just crack the eggs into the pan. If you want to make scrambled eggs, you’ll also want to crack them into the pan but be sure to whisk them quickly. If you are making scrambled eggs, don’t forget to keep stirring them as they cook. If you are nervous about cracking eggs directly into the pan, you can crack them in a bowl first to be sure you catch any stray shell pieces. For scrambled eggs, you can whisk them in the bowl and then add them to the pan.", "img": "https://www.wikihow.com/images/thumb/e/e8/Make-Eggs-on-Toast-Step-2-Version-2.jpg/550px-nowatermark-Make-Eggs-on-Toast-Step-2-Version-2.jpg"}, {"summary": "Toast your bread while your eggs are cooking.", "description": "While your eggs cook, you will want to be sure to get your bread toasting, so it will be done when the eggs finish cooking. Toast the bread until it is golden brown. Use whatever kind of bread you like.", "img": "https://www.wikihow.com/images/thumb/a/a0/Make-Eggs-on-Toast-Step-3-Version-2.jpg/v4-460px-Make-Eggs-on-Toast-Step-3-Version-2.jpg"}, {"summary": "Flip the eggs once the bottoms have cooked completely.", "description": "If you are making a fried or over-easy egg, flip the egg once the bottom has browned. This usually takes about three minutes. If you are making scrambled eggs, continue stirring until the eggs are no longer liquid.", "img": "https://www.wikihow.com/images/thumb/4/40/Make-Eggs-on-Toast-Step-4-Version-2.jpg/550px-nowatermark-Make-Eggs-on-Toast-Step-4-Version-2.jpg"}, {"summary": "Cook your eggs until fully cooked.", "description": "Whether you are going for a fried egg, an over-easy egg with a gooey center, or soft scrambled eggs, you'll want to watch them carefully and cook them until the whites are completely cooked. Cook scrambled eggs until they hold their shape and are no longer liquid. Don’t forget to add salt and pepper. Think about adding a little bit of cheese to make your eggs on toast that much more delicious.", "img": "https://www.wikihow.com/images/thumb/3/38/Make-Eggs-on-Toast-Step-5-Version-2.jpg/v4-460px-Make-Eggs-on-Toast-Step-5-Version-2.jpg"}, {"summary": "Butter your toast while your eggs cool slightly.", "description": "Once your toast is golden brown and toasted, you can spread a small amount of butter over your toast. Adding butter will enhance the overall flavor and will eliminate the dryness that can come with toasted bread. You can absolutely use dairy-free butter.", "img": "https://www.wikihow.com/images/thumb/b/be/Make-Eggs-on-Toast-Step-6-Version-2.jpg/550px-nowatermark-Make-Eggs-on-Toast-Step-6-Version-2.jpg"}, {"summary": "Assemble the eggs onto the toast.", "description": "Once your eggs are cooked, and your toast is toasted, it is time to put it all together. Place the eggs on the buttered toast and enjoy your breakfast.", "img": "https://www.wikihow.com/images/thumb/f/f1/Make-Eggs-on-Toast-Step-7-Version-2.jpg/v4-460px-Make-Eggs-on-Toast-Step-7-Version-2.jpg"}]}}