{"conversation": [{"text": "how do I know when the onions are cooked?", "evidence": ["Cook for 2-3 minutes, until the raw smell is gone and the onions are starting to turn clear."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "how do I know when the onions are cooked?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Once they have started to turn clear", "evidence": ["Cook for 2-3 minutes, until the raw smell is gone and the onions are starting to turn clear."], "id": "Agent", "dialog_act": "answer question"}, {"text": "what do I do after I have pureed the spinach", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Heat the ghee and chopped onion", "evidence": ["heat the ghee until melted "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "do you recommend any particular spices", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "we recommend you play around with the seasoning but garam masala is highly recommended to get a restaurant quality taste to your dish", "evidence": ["garam masala is highly recommended to get a subtle, rich, and restaurant-quality taste."], "id": "Agent", "dialog_act": "answer question"}, {"text": "what texture should the paneer cubes be when they are ready to serve", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "they will start to go golden brown on the edges", "evidence": ["edges are golden brown "], "id": "Agent", "dialog_act": "answer question"}, {"text": "great is there anything else to do before the dish is served", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "your dish is ready once you have cooked the paneer cubes", "evidence": ["Then toss them in the paneer for 2-3 minutes and serve!"], "id": "Agent", "dialog_act": "answer question"}, {"text": "thank you for your help", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thank you I look forward to trying the next one", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Palak Paneer", "url": "https://www.wikihow.com/Make-Palak-Paneer", "category": ["Food and Entertaining", "Recipes", "World Cuisines", "Indian Cuisine", "Vegetarian Indian Dishes"], "procedure": [{"summary": "Clean the spinach, then drop it in boiling water for 2 minutes.", "description": "Blanching the spinach quickly cooks it while leaving the bright, attractive color intact. Once the water is boiling in a big saucepot, drop the spinach in and stir it once. After two minutes, remove it and drain off the boiling water. Add a tablespoon of salt to the water, like making pasta, for stronger flavored spinach. The timing here is important. Do not leave the spinach on for more than 3 minutes.", "img": "https://www.wikihow.com/images/thumb/7/7f/Make-Palak-Paneer-Step-1-Version-2.jpg/v4-459px-Make-Palak-Paneer-Step-1-Version-2.jpg"}, {"summary": "As soon as the spinach comes off the heat, rinse it in cold water for 1 minute.", "description": "This immediately removes the heat from the spinach, halting the cooking process to keep the spinach nice and green.", "img": "https://www.wikihow.com/images/thumb/b/b2/Make-Palak-Paneer-Step-2-Version-2.jpg/v4-459px-Make-Palak-Paneer-Step-2-Version-2.jpg"}, {"summary": "Drain the water, then blend the spinach into a smooth puree.", "description": "Some people like a few chunks of spinach in their dish, while others want a completely smooth green curry. You can blend the spinach for as long as you want to get your desired consistency. If you didn't salt the water when blanching, add a pinch of salt now.", "img": "https://www.wikihow.com/images/thumb/5/52/Make-Palak-Paneer-Step-3-Version-2.jpg/v4-459px-Make-Palak-Paneer-Step-3-Version-2.jpg"}, {"summary": "In a large saucepan, heat the ghee until melted and add the chopped onion.", "description": "Turn the stove on medium and plop in a tablespoon of ghee. Chop one large onion finely and get it cooking once the oil is hot. Add a pinch of salt as soon as the onions hit the pan, and stir occasionally to prevent burning.", "img": "https://www.wikihow.com/images/thumb/0/02/Make-Palak-Paneer-Step-4-Version-2.jpg/v4-459px-Make-Palak-Paneer-Step-4-Version-2.jpg"}, {"summary": "After 1-2 minutes, add 4-5 cloves minced garlic, 2-3 chopped green chilis, and 1 tablespoon finely minced ginger.", "description": "Add them to the onions shortly after they start cooking, then stir well to make sure everything is coated. Cook for 2-3 minutes, until the raw smell is gone and the onions are starting to turn clear.", "img": "https://www.wikihow.com/images/thumb/3/36/Make-Palak-Paneer-Step-5-Version-2.jpg/v4-459px-Make-Palak-Paneer-Step-5-Version-2.jpg"}, {"summary": "Toss in any of your desired spices or tomatoes, if desired.", "description": "Some recipes call for one can of crushed tomatoes, or freshly cut tomatoes, and some Indian chefs like to spice their curry with a few different flavors. If you want a simple, but still delicious curry, just move on. If you're a little more adventurous, now is the time to add the following ingredients. Cook for about a minute, stirring constantly. 1 12oz can crushed red tomatoes OR 1 cup chopped cherry tomatoes. 1 teaspoon dry fenugreek leaves (sold sometimes as \"kasuri methi; highly recommended)\n\n1/2 teaspoon crushed red pepper and/or cayenne\n1/2 teaspoon turmeric and/or ground cumin\n1/4 teaspoon ground cardamon", "img": "https://www.wikihow.com/images/thumb/3/34/Make-Palak-Paneer-Step-6-Version-2.jpg/v4-459px-Make-Palak-Paneer-Step-6-Version-2.jpg"}, {"summary": "Add the spinach puree, 3-4 tablespoons milk or heavy cream, and cook for 2 minutes.", "description": "Keep the heat on medium and add in your spinach mixture. The cream or milk will help cut some of the spice and lead to a richer, fuller dish, but you could also use coconut milk, water, or chicken stock for a lighter dish. The mixture should be brought to a light simmer, with small bubbles breaking the surface.", "img": "https://www.wikihow.com/images/thumb/3/30/Make-Palak-Paneer-Step-7.jpg/v4-459px-Make-Palak-Paneer-Step-7.jpg"}, {"summary": "Add salt, pepper, and garam masala to taste.", "description": "This is the point where you should be sampling heavily. If it tastes great, leave it alone as it cooks. More likely than not, you'll want to play with the seasonings, and garam masala is highly recommended to get a subtle, rich, and restaurant-quality taste.", "img": "https://www.wikihow.com/images/thumb/5/5d/Make-Palak-Paneer-Step-8.jpg/v4-459px-Make-Palak-Paneer-Step-8.jpg"}, {"summary": "Add the paneer cubes and stir, cooking together for 2-3 minutes before serving.", "description": "The paneer just needs to get hot, and the dish is ready to serve. For an even tastier dish, fry the paneer cubes until the edges are golden brown in a separate dish, cooking them in a little bit of ghee or olive oil. Then toss them in the paneer for 2-3 minutes and serve!", "img": "https://www.wikihow.com/images/thumb/6/6b/Make-Palak-Paneer-Step-9.jpg/v4-459px-Make-Palak-Paneer-Step-9.jpg"}]}}