{"conversation": [{"text": "The first step in the recipe is", "evidence": ["Prepare your fruits"], "id": "Agent", "dialog_act": "other"}, {"text": "How do you make stewed fruit taste good?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The best way to make this as tasty as possible is to do this step", "evidence": ["Remember to select a seasonal fruit so your stewed fruit will be as fresh and tasty as possible. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "What would be a good example of fruits to add?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Any tart and sweet fruits like berries, cherries and apples", "evidence": ["If you're using fruits with pits, like cherries, discard the pits while preparing the fruit."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, how long should I stew them for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "To make good quality stewed fruits, always check consistency throughout and make sure to take them off the heat to prevent them from going too burnt", "evidence": ["Times will vary greatly depending on the type of fruit. Tougher fruits tend to take longer to soften than more delicate fruits."], "id": "Agent", "dialog_act": "answer question"}, {"text": "What kind of sugar should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Caster sugar is the best ingredient to use and adjust according to fruit sweetness", "evidence": ["ou should caster sugar in stirred fruit, which you may be able to find at a grocery store"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What heat should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Always use low to medium heat to avoid the fruit burning or the sugar caramelizing too fast", "evidence": ["Place your pan over medium heat and add two tablespoons of water."], "id": "Agent", "dialog_act": "answer question"}, {"text": "What should I serve this with?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Stewed fruit pairs nicely with a variety of things and should be a great addition to your diet", "evidence": ["You can use your stewed fruit on things like cereals, yogurts, pancakes, and granola."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Should they be eaten warm or cold?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Let the fruit cool down before serving", "evidence": ["llow the fruit to sit until it has a fairly thick consistency. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you for the recipe", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thanks. It was a great learning experience", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Stewed Fruit", "url": "https://www.wikihow.com/Make-Stewed-Fruit", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables"], "procedure": [{"summary": "Prepare your fruits.", "description": "To start making your stewed fruit, prepare all the fruits you're using. Remember to select a seasonal fruit so your stewed fruit will be as fresh and tasty as possible. If you don't have a kitchen scale, invest in one so you can measure out roughly 500 grams of your chosen fruit. Cut up all the fruit into bite sized pieces. If you're using fruits with pits, like cherries, discard the pits while preparing the fruit.", "img": "https://www.wikihow.com/images/thumb/7/7b/Make-Stewed-Fruit-Step-1-Version-2.jpg/v4-460px-Make-Stewed-Fruit-Step-1-Version-2.jpg"}, {"summary": "Mix the fruit and sugar.", "description": "Place your fruit in a large cooking pan. You should caster sugar in stirred fruit, which you may be able to find at a grocery store. If not, you can order online. As fruits vary greatly in sweetness, there is no precise amount to add. Taste small pieces of your fruit as you go along and add extra sugar as needed. Start by mixing in a small amount of sugar, like one to two teaspoons. After the sugar is equally dispersed in the fruit, taste your fruit. If the fruit does not feel sweet enough, add an additional teaspoon at a time until your fruit reaches your desired level of sweetness.", "img": "https://www.wikihow.com/images/thumb/3/3e/Make-Stewed-Fruit-Step-2-Version-2.jpg/v4-460px-Make-Stewed-Fruit-Step-2-Version-2.jpg"}, {"summary": "Cook your fruit.", "description": "Place your pan over medium heat and add two tablespoons of water. Check the pan every few minutes as your fruit cooks. Once all the fruit is soft and tender to the touch, remove the pan from the heat. Times will vary greatly depending on the type of fruit. Tougher fruits tend to take longer to soften than more delicate fruits.", "img": "https://www.wikihow.com/images/thumb/5/58/Make-Stewed-Fruit-Step-3-Version-2.jpg/v4-460px-Make-Stewed-Fruit-Step-3-Version-2.jpg"}, {"summary": "Remove the lid and let the liquid evaporate.", "description": "Once your fruit is soft, remove the lid. Much of liquid surrounding the fruit will evaporate on its own. Allow the fruit to sit until it has a fairly thick consistency. You can use your stewed fruit on things like cereals, yogurts, pancakes, and granola.", "img": "https://www.wikihow.com/images/thumb/3/36/Make-Stewed-Fruit-Step-4-Version-2.jpg/v4-460px-Make-Stewed-Fruit-Step-4-Version-2.jpg"}]}}