{"conversation": [{"text": "First, scatter the chips onto a large microwave safe plate", "evidence": ["Scatter chips onto a large microwave safe plate or platter."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright. What is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Put 1 cup of refried beans into a seperate microwave safe container", "evidence": ["Scoop 1 cup of refried beans into a microwave safe bowl"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long do I microwave it for? Is that all I put in?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No. Add a 1/2 cup of Pico de Gallo into the refried beans and heat for 30 seconds.", "evidence": ["Add 1/2 cup of Pico de Gallo and microwave for 30 seconds."], "id": "Agent", "dialog_act": "ask question"}, {"text": "i have done that.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Stir together. If the beans are still too firm microwave in 15 second increments until soft.", "evidence": ["Mix together. If your beans are still too firm to easily mix after 30 seconds, microwave them in 15 second increments until soft."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Whats the next step", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, scoop the Pico de Gallo bean mixture all over the chips you previously prepared.", "evidence": ["Scoop the bean and Pico de Gallo mixture all over the surface of your chip pile."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is there an easy way to do so?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It's easier to drop globs of the mixture all over rather than spreading it over the chips.", "evidence": ["you might find it easier to drop globs all over rather than trying to spread them over the chips."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Can I go to the next step now", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Sprinkle shredded cheese evenly until you have used 2 cups.", "evidence": ["Take a few pinches of your shredded cheese and evenly distribute it until you have used 2 cups."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What else can I add on top", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can sprinkle 4 tablespoons of diced green chilies if you like it spicy.", "evidence": ["Sprinkle 4 tablespoons of diced green chilies on top if you prefer a spicy kick to your nachos"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What kind of cheese should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can use a store bought Mexican blend cheese or grate your own cheese. Freshly grated cheese tends to melt easier.", "evidence": ["a prepackaged bag of Mexican blend cheese or grate your own cheese. Freshly grated cheese may melt easier in the microwave."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have added the cheese and chilies. Whats next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Heat the dish for 1-2 minutes. If the beans are still cool after 2 minutes, microwave again 30 seconds at a time until desired temperature is reached.", "evidence": ["Place the platter in the microwave and cook for 1-2 minutes. If the beans are still cool after 2 minutes, microwave them in 30 second increments until they are hot."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What else can I add on top of the nachos", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can scoop 1/2 cup of sour cream and/or 1/2 cup of guacamole on top or spread across your nachos.", "evidence": ["scoop 1/2 cup of sour cream and 1/2 cup of guacamole directly on top in the center or across the entire platter"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Do i need to let them cool", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make \"Quick 'n Easy\" Nachos", "url": "https://www.wikihow.com/Make-%22Quick-%27n-Easy%22-Nachos", "category": ["Food and Entertaining", "Recipes", "World Cuisines", "Central and South American Cuisine", "Nachos"], "procedure": [{"summary": "Scatter chips onto a large microwave safe plate or platter.", "description": "If you are making nachos for a group, use the entire bag. If you prefer a smaller portion, pour as many chips as you would like (you can try half a bag or 1/4). If you are making more nachos than one plate can support, you can use two plates and microwave separate batches.", "img": "https://www.wikihow.com/images/thumb/3/3d/Make-%22Quick-%27n-Easy%22-Nachos-Step-1-Version-3.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-1-Version-3.jpg"}, {"summary": "Scoop 1 cup of refried beans into a microwave safe bowl.", "description": "Add 1/2 cup of Pico de Gallo and microwave for 30 seconds. Mix together. If your beans are still too firm to easily mix after 30 seconds, microwave them in 15 second increments until soft. Only microwave them until they are warm, you don't need to get them hot.", "img": "https://www.wikihow.com/images/thumb/e/e7/Make-%22Quick-%27n-Easy%22-Nachos-Step-2-Version-3.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-2-Version-3.jpg"}, {"summary": "Build your nachos.", "description": "Here comes the fun part. Scoop the bean and Pico de Gallo mixture all over the surface of your chip pile. Because the refried beans may be a little sticky, you might find it easier to drop globs all over rather than trying to spread them over the chips.", "img": "https://www.wikihow.com/images/thumb/9/91/Make-%22Quick-%27n-Easy%22-Nachos-Step-3-Version-3.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-3-Version-3.jpg"}, {"summary": "Sprinkle cheese on top.", "description": "Take a few pinches of your shredded cheese and evenly distribute it until you have used 2 cups. You can use less cheese if you prefer. Sprinkle 4 tablespoons of diced green chilies on top if you prefer a spicy kick to your nachos. You can use a prepackaged bag of Mexican blend cheese or grate your own cheese. Freshly grated cheese may melt easier in the microwave. Spread the cheese evenly over the tortilla chips. You do not want any naked chips.", "img": "https://www.wikihow.com/images/thumb/c/c8/Make-%22Quick-%27n-Easy%22-Nachos-Step-4-Version-3.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-4-Version-3.jpg"}, {"summary": "Microwave your nachos.", "description": "Place the platter in the microwave and cook for 1-2 minutes. If the beans are still cool after 2 minutes, microwave them in 30 second increments until they are hot. Don't let the beans get so hot that they boil, this will cause them to dry out and get crusty. When refried beans boil, they can also make a mess in your microwave. Be careful when removing your platter from the microwave, it may be hot enough to burn you.", "img": "https://www.wikihow.com/images/thumb/0/0f/Make-%22Quick-%27n-Easy%22-Nachos-Step-5-Version-3.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-5-Version-3.jpg"}, {"summary": "Top off your nachos.", "description": "Remove the platter from the microwave once your beans are hot and scoop 1/2 cup of sour cream and 1/2 cup of guacamole directly on top in the center or across the entire platter. You can use more or less guacamole and sour cream if you desire. Drop another spoonful of salsa or Pico de Gallo on top if you prefer.", "img": "https://www.wikihow.com/images/thumb/5/5d/Make-%22Quick-%27n-Easy%22-Nachos-Step-6-Version-2.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-6-Version-2.jpg"}, {"summary": "Enjoy!", "description": "Depending on how hot your nachos are you may need to let them cool on the countertop for about a minute before enjoying. Serve warm and gather extra plates and napkins for sharing. Enjoy as a meal or an entree with tacos, burritos, hot wings, or anything you like!", "img": "https://www.wikihow.com/images/thumb/9/9f/Make-%22Quick-%27n-Easy%22-Nachos-Step-7-Version-2.jpg/v4-460px-Make-%22Quick-%27n-Easy%22-Nachos-Step-7-Version-2.jpg"}]}}