{"conversation": [{"text": "Hi there! Ready to make some Whipped Cream?", "evidence": ["Recipe"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes, let's get started! What do I need to do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "First, you'll want to add 1/4 cup of cold water into a medium sized saucepan", "evidence": ["Pour ⁄4 cup (59 mL) of cold water into a small or medium-sized saucepan"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it, then what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "The you'll want to add unflavored gelatin to the water.", "evidence": ["Sprinkle 2 teaspoons (10 g) of unflavored gelatin over the water."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How much gelatin should I add?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you have gelatin on hand? If not or if you don't like gelatin, you may use agar as an alternative.", "evidence": ["If you don't have gelatin or prefer not to use it, use agar agar instead."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Gelatin is fine. How much should I add?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add 10 g of gelatin. This would be about 2 teaspoons", "evidence": ["Sprinkle 2 teaspoons (10 g)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I've added the gelatin. What should I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Once you're ready, you will want to cook this mixture on low heat. It should only take a few minutes to cook. It will be done when the gelatin dissolves and the water turns clear.", "evidence": ["Cook the mixture over low-heat until it turns clear, stirring often"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I've heated the mixture for a few minutes, but it isn't turning clear?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Did you use milk instead of water? In that case wait until the granules of gelatin completely dissolve.", "evidence": ["Note that if you used milk, the mixture will not turn clear."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oops, my bad. I can't see the gelatin anymore. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Have all of the granules dissolved? There are no flakes in the mixture?", "evidence": [" Simply wait for the granules or flakes to dissolve"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I'm sure it has completely dissolved.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now that the gelatin has dissolved, take the saucepan off the burner and let it cool.", "evidence": ["Let the mixture cool, then whisk it into whole milk for a few seconds."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long do I let it cool?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You'll want to let the mixture sit until it is room temperature.", "evidence": ["cool to room temperature"], "id": "Agent", "dialog_act": "answer question"}, {"text": "The mixture is cool now. What do I add next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next we add milk. Wisk it into the mixture for about 30 seconds.", "evidence": ["Next, pour 1 cup (240 mL) of milk into a bowl, then add in the cooled gelatin mixture. Stir it with a whisk for about 20 to 30 seconds to combine."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it matter what kind of milk?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, it must be whole milk. Other types do not have enough fat content.", "evidence": ["You must use whole milk, as it has a higher fat content. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "The whole milk has been mixed in. What do I add next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next we add in sugar and flavoring. For the sugar, you must use powdered, icing, or confectioners sugar. As for flavoring, do you have a preference?", "evidence": ["Whisk in the powdered sugar and vanilla extract"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I do prefer almond to vanilla.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great! You'll want to add 7.5 ml of almond extract and 1/4 cup of powdered sugar. Whisk them in until the color and texture are consistent, with no lumps remaining.", "evidence": ["You can use a different type of extract if you prefer a different flavor, such as almond. "], "id": "Agent", "dialog_act": "other"}, {"text": "Got it! Next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next we need to refrigerate the mixture. Place some plastic wrap over the bowl and put it in the fridge.", "evidence": ["Refrigerate the mixture for about 90 minutes, stirring it every 15 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long do I need to chill it for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "For about 15 minutes. After which you need to take it out and mix it again. This helps prevent the ingredients from separating. Can you chill your wisk?", "evidence": ["Every 15 to 20 minutes"], "id": "Agent", "dialog_act": "ask question"}, {"text": "I can, but why?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It will help speed up the process. You will need to do this a few times until 60 to 90 minutes have passed.", "evidence": ["This will help speed up the overall process and prevent separating."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, check back in an hour.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Has the mixture stayed together?", "evidence": [" prevent separating"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, what is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we will mix the mixture with a hand-held mixer.", "evidence": ["Whip the mixture with a hand-held mixer until it turns creamy."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Got it. I've mixed it for a few seconds.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Has the mixture formed soft peaks? Are you sure to have gotten all the edges?", "evidence": ["Keep mixing until the mixture thickens and starts to form soft peaks."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I have. Now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now you're done! Be sure to keep the cream in a sealed container. It should keep for up to two days!", "evidence": ["Store the whipped cream in the fridge for up to 2 days"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thank you! Any recommendations for use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "This is a lighter cream, so it's good from dipping toppings in or as cake filler.", "evidence": [" It is best used for toppings (i.e. : waffles, pancakes, strawberries, etc."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Got it. Thanks for your help.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Whipped Cream from Milk", "url": "https://www.wikihow.com/Make-Cream-from-Milk", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy"], "procedure": [{"summary": "Combine water and unflavored gelatin, then wait 5 minutes.", "description": "Pour ⁄4 cup (59 mL) of cold water into a small or medium-sized saucepan. Sprinkle 2 teaspoons (10 g) of unflavored gelatin over the water. Wait 5 minutes for the gelatin to absorb the water and turn spongy. Do not turn the heat on the stove just yet. If you don't have gelatin or prefer not to use it, use agar agar instead. For a richer cream, use ⁄4 cup (59 mL) of cold whole milk instead of water. Do not use Jello or flavored gelatin. It contains additional sugars and flavors, which may affect the overall flavor of the cream.", "img": "https://www.wikihow.com/images/thumb/1/13/Make-Cream-from-Milk-Step-6-Version-11.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-6-Version-11.jpg"}, {"summary": "Cook the mixture over low-heat until it turns clear, stirring often.", "description": "This should only take a few minutes. It the mixture takes too long to heat up, use medium-low heat instead. Once the gelatin dissolves and the water turns clear, you're ready for the next step. Note that if you used milk, the mixture will not turn clear. Simply wait for the granules or flakes to dissolve.", "img": "https://www.wikihow.com/images/thumb/3/38/Make-Cream-from-Milk-Step-7-Version-11.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-7-Version-11.jpg"}, {"summary": "Let the mixture cool, then whisk it into whole milk for a few seconds.", "description": "Take the saucepan off the burner and set it aside so that it can cool to room temperature. Next, pour 1 cup (240 mL) of milk into a bowl, then add in the cooled gelatin mixture. Stir it with a whisk for about 20 to 30 seconds to combine. How long it takes for the gelatin mixture to cool depends on the temperature in your kitchen. It will probably take around 10 to 15 minutes. You must use whole milk, as it has a higher fat content. Other types of milk won't give you the same results due to their low-fat content.", "img": "https://www.wikihow.com/images/thumb/d/dd/Make-Cream-from-Milk-Step-8-Version-9.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-8-Version-9.jpg"}, {"summary": "Whisk in the powdered sugar and vanilla extract.", "description": "Pour in ½ tablespoon (7.5 mL) of vanilla extract and ¼ cup (30 g) of powdered sugar. Stir the mixture once more with a whisk until the color and texture are consistent, and no streaks or lumps remain. You can use a different type of extract if you prefer a different flavor, such as almond. You must use powdered, icing, or confectioners sugar. Do not use regular, granulated sugar. For a less-sweet cream, use just 2 tablespoons (15 g) of powdered and omit the vanilla extract.", "img": "https://www.wikihow.com/images/thumb/2/29/Make-Cream-from-Milk-Step-9-Version-9.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-9-Version-9.jpg"}, {"summary": "Refrigerate the mixture for about 90 minutes, stirring it every 15 minutes.", "description": "Cover the bowl with plastic wrap, and place it in the fridge. Every 15 to 20 minutes, take the bowl out of the fridge, give the mixture a brief stir with a whisk, then put it back into the fridge. Do this a few more times until 60 to 90 minutes have passed. As the mixture sits in the fridge, the ingredients will start to come together and thicken. Whisking the mixture will prevent the ingredients from separating. For better results, chill your whisk as well. This will help speed up the overall process and prevent separating.", "img": "https://www.wikihow.com/images/thumb/a/a3/Make-Cream-from-Milk-Step-10-Version-8.jpg/v4-460px-Make-Cream-from-Milk-Step-10-Version-8.jpg"}, {"summary": "Whip the mixture with a hand-held mixer until it turns creamy.", "description": "Take the bowl out of the fridge and begin to whip the mixture with a hand-held mixer. Keep mixing until the mixture thickens and starts to form soft peaks. Make sure that you go all around the edges of the bowl as you mix. The cream will double in size as you whip it. How long this takes depends on the temperature of the cream, the speed of your mixer, and your desired consistency. It shouldn't take more than a few seconds, however. If you don't have a hand-held mixer, you can use an electric mixer or a food processor fitted with whisks instead.", "img": "https://www.wikihow.com/images/thumb/7/76/Make-Cream-from-Milk-Step-11-Version-8.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-11-Version-8.jpg"}, {"summary": "Store the whipped cream in the fridge for up to 2 days.", "description": "A glass jar or bottle with a lid will work the best. Not only will it help perverse the flavor, but it will be more convenient to use. Avoid plastic containers, as the chemicals can leach into the cream and affect the flavor. Although this cream is similar to what you would get with heavy cream, it is not quite the same thing. It is best used for toppings (i.e. : waffles, pancakes, strawberries, etc.) or cake fillings.", "img": "https://www.wikihow.com/images/thumb/3/36/Make-Cream-from-Milk-Step-12-Version-8.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-12-Version-8.jpg"}]}}