{"conversation": [{"text": "Hello, are you ready to start cooking?", "evidence": ["Clean your rice"], "id": "Agent", "dialog_act": "other"}, {"text": "Yes, what is the first step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "First, wash your rice, then add other ingredients if you wish, such as dates or beans.", "evidence": ["Pour tap water into your rice bowl and swirl the water around by shaking the bowl in up and down circles. Then, pour out the water carefully to make sure no rice is spilled.", "Add dates, red beans, green beans, or other beans into your bowl so you can make your congee taste better."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I washed the rice, drained it, and added beans, what next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Pour water into your rice bowl, the amount depends on the texture you want for the congee. Add more water to make it more watery.", "evidence": ["You can change the amount of water you add into your rice to make your congee more watery or drier than usual."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What happens if I only add a little water?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If you don't add a lot of water, the congee will have a drier texture. Do you want a specific texture of your congee?", "evidence": ["make your congee more watery or drier than usual."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I don't like soft, mushy rice, so I want it to be drier.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Then you shouldn't add too much water, nor let the rice soak for too long. The next step is to put the rice in the rice cooker, are you ready?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, how long will it cook for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "There should be a button on the rice cooker labeled \"congee\" that will cook it for you.", "evidence": ["Then press the button labeled \"Congee\" or \"Soup\"."], "id": "Agent", "dialog_act": "answer question"}, {"text": "After it's finished cooking, what do I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You can serve it now.", "evidence": ["open the cap of the rice cooker and stir it since the rice would have fallen to the bottom of the bowl. Then, scoop out the congee into bowls."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, it seems to be done.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Congee", "url": "https://www.wikihow.com/Make-Congee", "category": ["Food and Entertaining", "Recipes", "Rice and Beans"], "procedure": [{"summary": "Clean your rice.", "description": "To produce healthy congee, you need clean rice. Pour tap water into your rice bowl and swirl the water around by shaking the bowl in up and down circles. Then, pour out the water carefully to make sure no rice is spilled. Do this twice and your rice should be clean. Go Further! Add dates, red beans, green beans, or other beans into your bowl so you can make your congee taste better. However, make sure to clean these beans correctly; you don't want to be sick!", "img": null}, {"summary": "Add in the water.", "description": "Add your water into the bowl that can match into your rice cooker. You can change the amount of water you add into your rice to make your congee more watery or drier than usual. You can also let your rice sit for a while if you want your rice to be softer and more water soaked.", "img": null}, {"summary": "Put your bowl into your rice cooker and start the cooking period.", "description": "Match your rice cooker bowl with the rice into the rice cookers hole and close the cap. Then press the button labeled \"Congee\" or \"Soup\". All of these functions should work and produce congee as you want it.", "img": null}, {"summary": "Serve.", "description": "When your congee is done, you want to open the cap of the rice cooker and stir it since the rice would have fallen to the bottom of the bowl. Then, scoop out the congee into bowls. Make sure you don't just get rice or the rice water that should be in the rice cooker. If you get too much wet or solid rice, your congee will not taste as good as when the amounts are equal.", "img": null}, {"summary": "Decorate.", "description": "You can add things to your congee to make it taste and look better. The following are commonly used in congee; olive sidish, meat ground, bean curd, sesame seeds, green onion chop, salt and spices. Once your congee is well-presented--serve warm and enjoy!", "img": null}]}}