{"conversation": [{"text": "This is how to skim fat off soup. Do you have an questions?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "What is the first step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "First, you must bring your soup to a gentle simmer on the stove. You can do this by setting your heat to medium-high.", "evidence": ["Bring your soup to a gentle simmer on the stove", "turn the heat down to medium-high so that the soup gently simmers"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, how will I know if it's ready?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will start to see some fat particles floating or foaming on the top. Make sure you don't let the soup continue at a rolling boiling.", "evidence": ["You’ll start to see the fat particles floating or foaming towards the top of the stockpot", "Don’t allow the soup to continue at a rolling boil."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Huh?? Why? What does that mean?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Boiling soup could melt the fat which will make it blend into the broth, making it difficult to remove. Do you see the fat particles floating at the top now?", "evidence": [" Boiling soup over high heat melts the fat, meaning it will blend into the broth. This makes it harder to remove."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes I think so! What should I do now??", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, you need to stir the liquid to ensure the fat particles move to the edges of the pot.", "evidence": ["Stir the liquid so the foaming fat moves to the edges of the stockpot"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I only have a regular metal spoon. It's kinda hard to remove it", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Using a wooden spoon or a long-handled ladle would be a lot more useful and safer!", "evidence": ["Submerge a long-handled ladle or wooden spoon into the center of the pot"], "id": "Agent", "dialog_act": "other"}, {"text": "Ok, now what do I do? Just stir it or?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! Just keep stirring it to get the simmering liquid to swirl in a circle. The stirring will help the oil foam to move towards the outside edges of the pot which is what we want!", "evidence": ["Stir it around to get the simmering liquid swirling in a circle."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, it seems to be working. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you see the oils foaming and floating towards the top of the soup?", "evidence": ["Once the oils start to foam up and float on the top of the soup"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes I do. What do I do with them", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Perfect! Now you must scoop up that foaming fat using a fine mesh skimming utensil.", "evidence": ["Scoop up the foaming fat with a fine mesh skimming utensil."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What?? How do I do that exactly?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You just take the edge of your skimming utensil and dip it just below the surface of the soup. Do you see some of the foamy fat stuck to the inside of the mesh?", "evidence": ["dip the edge of the shallow skimming utensil just below the surface of the soup.", "ift it upwards quickly to scoop up the foam and fat"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oooh yea I do! Is that right or am I doing something wrong?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, that's exactly what we want :) Just keep scooping all the fat until there's enough collected in the mesh to discard.", "evidence": ["Continue scooping up the fat until there’s enough collected in the mesh to discard."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oh great. Ok well... I think I have enough?", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great! If your mesh skimmer is covered with the fat then it's time to get rid of it.", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh ok! Yeah, it's a lot. Do I throw it out now or like what do I do exactly", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, and to do that, all you have to do is dunk the mesh skimmer in a bowl of water or you may also rinse it off under water to remove the residue.", "evidence": ["Dunk the mesh skimmer in a bowl of water or rinse it off under running water to remove the fat residue"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great! Thank you for the help!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Glad I could be of assistance. Is there anything else you might need help with today?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "No, that'll be it for now. Thanks again :D", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Anytime! Please feel free to reach out if you need help with anything else.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I will for sure. Bye!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Skim Fat Off Soup", "url": "https://www.wikihow.com/Skim-Fat-Off-Soup", "category": ["Food and Entertaining", "Recipes", "Soups"], "procedure": [{"summary": "Bring your soup to a gentle simmer on the stove.", "description": "When you’re ready to skim off the fat, turn the heat down to medium-high so that the soup gently simmers. You’ll start to see the fat particles floating or foaming towards the top of the stockpot. Don’t allow the soup to continue at a rolling boil. Boiling soup over high heat melts the fat, meaning it will blend into the broth. This makes it harder to remove.", "img": "https://www.wikihow.com/images/thumb/9/92/Skim-Fat-Off-Soup-Step-1-Version-2.jpg/v4-460px-Skim-Fat-Off-Soup-Step-1-Version-2.jpg"}, {"summary": "Stir the liquid so the foaming fat moves to the edges of the stockpot.", "description": "Submerge a long-handled ladle or wooden spoon into the center of the pot. Stir it around to get the simmering liquid swirling in a circle. The stirring movements will cause the oily foam and globules to migrate to the outside edges of the stockpot.", "img": "https://www.wikihow.com/images/thumb/a/af/Skim-Fat-Off-Soup-Step-2-Version-2.jpg/550px-nowatermark-Skim-Fat-Off-Soup-Step-2-Version-2.jpg"}, {"summary": "Scoop up the foaming fat with a fine mesh skimming utensil.", "description": "Once the oils start to foam up and float on the top of the soup, dip the edge of the shallow skimming utensil just below the surface of the soup. Then lift it upwards quickly to scoop up the foam and fat. You’ll see some of the foamy fat stuck to the inside of the mesh. Continue scooping up the fat until there’s enough collected in the mesh to discard. Dunk the mesh skimmer in a bowl of water or rinse it off under running water to remove the fat residue. This method works particularly well for skimming chicken stock.", "img": "https://www.wikihow.com/images/thumb/a/a7/Skim-Fat-Off-Soup-Step-3-Version-2.jpg/550px-nowatermark-Skim-Fat-Off-Soup-Step-3-Version-2.jpg"}, {"summary": "Use the back of a cold metal spoon if you don’t have a mesh skimming utensil.", "description": "Place a handful of ice cubes into a deep metal spoon or ladle to chill it down. Keep the ice cubes in the spoon while you touch the back of the spoon to the surface of the soup. Glide the back of the spoon gently across the fatty globules. The fat will solidify and stick onto the back of the spoon. Lift up the spoon and discard any fat that’s stuck to the bottom. When the cold metal touches the hot soup, the fat that has gathered near the surface will quickly coagulate onto the spoon so you can peel it off. Wipe off the fat onto a paper towel and repeat the process to remove all of the fat. You must use a metal spoon for this method. A wooden or plastic spoon won’t get as cold. Don’t submerge the whole spoon into the soup. Just hold it parallel to the surface of the liquid while the fat gathers on the back of the spoon.", "img": "https://www.wikihow.com/images/thumb/b/b1/Skim-Fat-Off-Soup-Step-4-Version-2.jpg/550px-nowatermark-Skim-Fat-Off-Soup-Step-4-Version-2.jpg"}]}}