{"conversation": [{"text": "Hello, today you will learn how to make heavy cream from milk.  Are you ready to learn something fun?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "That sounds interesting.  What do I need to make this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You will need unsalted butter and milk.  Plus a saucepan to cook in.  Let me know when you are ready to start", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "what do I do first", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Make sure you use unsalted butter - margarine and salted butter will not give you the correct taste", "evidence": ["Place ⅓ cup (75 g) of unsalted butter into a saucepan.", "Turn the heat up to low, and wait for the butter to melt;"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Once the butter is melted, what do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Have you been stirring your butter as it melts?  This will prevent it from burning", "evidence": ["stir it occasionally with a spoon or rubber spatula. "], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes.  What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "This step is very important, known as tempering.", "evidence": ["Stir 1 tablespoon (15 mL) of the melted butter into the cold milk"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What sort of milk should I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Adding milk gradually prevents the milk from being heated up too fast and curdle", "evidence": ["Whole milk will give you the best results, but you can use 2% milk as well"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have added the 15ml, now what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "What is the consistency of your milk?  If your milk has not curdled, it is time to move to the next step", "evidence": ["the milk will heat up too fast and curdle"], "id": "Agent", "dialog_act": "ask question"}, {"text": "My milk is still fine.  Not curdled", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Now that you have tempered the milk you can add it to the saucepan containing the rest of the butter.", "evidence": ["Pour the milk into the rest of the butter and cook it over low-heat"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "do I stir this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, keep stirring the milk.  Turn the heat up to low until the milk starts to steam.  Is your milk steaming?", "evidence": ["stirring it often with a whisk.", "Turn the heat up to low and wait for the milk to heat up,", " Once the milk starts to steam, you are ready for the next step"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I can see steam.  I think I am ready for the next step", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Do you have a blender you can use to thicken the cream?", "evidence": ["Mix the cream until it thickens"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "No, but I have beaters.  Will that be okay?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, beaters will work fine.", "evidence": ["A blender will work the best, but you can use a food processor, an electric mixer, or even a hand-held mixer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Using your beaters.  Mix until you get a thick, creamy consistency - that of heavy cream.  It may take a few minutes", "evidence": ["Mix the cream until it thickens", "You are looking for a thick, creamy consistency--just like heavy cream. ", "expect it to take a few minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I think I have the correct consistency now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You are finished.  Allow it to cool to room temperature, then put it into a container (with a lid).  It can be kept in the fridge for 1 week.  I suggest putting a date on it to remember.", "evidence": ["Allow the mixture to cool to room temperature first, then transfer it into a lidded container and put it into the fridge"], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you - is there anything else I should know?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You may find the cream will separate over time.  This is ok.  Give the container a good shake.  Alternatively, you could reheat it over low heat and then give it a stir.  You can use this cream as a substitute for most receipes that call for heavy cream.  Enjoy!", "evidence": [" The cream will separate over time", "If that happens, simply give the container a good shake", "You can also reheat it over low-heat, then give it a stir.", "You can use this as a substitute for most recipes that call for heavy cream"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you for your help.  I will be adding this to my recipe book!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Your Welcome", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Dialogue has now finished", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Heavy Cream from Milk", "url": "https://www.wikihow.com/Make-Cream-from-Milk", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy"], "procedure": [{"summary": "Melt the unsalted butter in a saucepan over low-heat.", "description": "Place ⅓ cup (75 g) of unsalted butter into a saucepan. Turn the heat up to low, and wait for the butter to melt; you can stir it occasionally with a spoon or rubber spatula. Do not use margarine or salted butter, as the resulting heavy cream won't taste right.", "img": "https://www.wikihow.com/images/thumb/d/df/Make-Cream-from-Milk-Step-1-Version-11.jpg/v4-460px-Make-Cream-from-Milk-Step-1-Version-11.jpg"}, {"summary": "Stir 1 tablespoon (15 mL) of the melted butter into the cold milk.", "description": "This is known as \"tempering\" and is very important. If you pour all of the melted butter into the milk at once, the milk will heat up too fast and curdle. Whole milk will give you the best results, but you can use 2% milk as well. Do this in a separate container; a large measuring cup would be ideal. You are using the entire ⁄4 cup (180 mL) of cold milk for this step.", "img": "https://www.wikihow.com/images/thumb/a/a0/Make-Cream-from-Milk-Step-2-Version-12.jpg/v4-460px-Make-Cream-from-Milk-Step-2-Version-12.jpg"}, {"summary": "Pour the milk into the rest of the butter and cook it over low-heat.", "description": "Pour the tempered milk into the saucepan containing the rest of the butter. Turn the heat up to low and wait for the milk to heat up, stirring it often with a whisk. Once the milk starts to steam, you are ready for the next step. Do not let the milk come to a boil.", "img": "https://www.wikihow.com/images/thumb/1/1b/Make-Cream-from-Milk-Step-3-Version-12.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-3-Version-12.jpg"}, {"summary": "Mix the cream until it thickens.", "description": "A blender will work the best, but you can use a food processor, an electric mixer, or even a hand-held mixer. How long it takes for the cream to thicken depends on which tool you use; expect it to take a few minutes, however. You are looking for a thick, creamy consistency--just like heavy cream. This recipe will not thicken into a whipped cream consistency.", "img": "https://www.wikihow.com/images/thumb/f/fa/Make-Cream-from-Milk-Step-4-Version-12.jpg/550px-nowatermark-Make-Cream-from-Milk-Step-4-Version-12.jpg"}, {"summary": "Keep the cream in the fridge and use it within 1 week.", "description": "Allow the mixture to cool to room temperature first, then transfer it into a lidded container and put it into the fridge. You can use this as a substitute for most recipes that call for heavy cream. The cream will separate over time. If that happens, simply give the container a good shake. You can also reheat it over low-heat, then give it a stir.", "img": "https://www.wikihow.com/images/thumb/d/d4/Make-Cream-from-Milk-Step-5-Version-11.jpg/v4-460px-Make-Cream-from-Milk-Step-5-Version-11.jpg"}]}}