{"conversation": [{"text": "hello how's the preparation going?", "evidence": ["the cakes will be a bit shallower"], "id": "Agent", "dialog_act": "ask question"}, {"text": "or the moment everything seems to be going well but I would like to know how to proceed", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Ok starts with pre-heating the oven", "evidence": ["Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius)"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I had guessed this, I wanted to know how to start the preparation", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "start by mixing the flour with the other dry ingredients in a large bowl", "evidence": ["Combine the first portion of dry ingredients."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "can you tell me which dry ingredients please?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "After combining the ingredients, take the eggs", "evidence": ["the rice flour, baking powder, and salt"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What are eggs used for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "With the eggs you have to create a cream by whisking them together sugar and melted butter", "evidence": ["Create the egg mixture."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I mixed the ingredients and now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Did you turn out a smooth and creamy mixture?", "evidence": ["until well combined"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, it looks very good, what should I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now add the flour and coconut milk to the cream you made", "evidence": ["Add the flour and coconut milk"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Do I put it all together in one go?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Noo, stop. Add a little flour at a time and the same for the milk", "evidence": ["Alternate adding the flour mixture and coconut milk to the egg mixture"], "id": "Agent", "dialog_act": "answer question"}, {"text": "The cream looks great! Can we bake it now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "First we need to pour the mixture into the molds", "evidence": ["Pour the batter into the prepared pans"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "You're right, I almost forgot, then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "did you butter the molds?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Oh you're right I don't want cakes to burn!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Now we can cook them by putting them in the oven for 20-25 minutes", "evidence": ["Bake the cakes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "While I am waiting for them to be ready, how can I know when to remove them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Try to check by piercing the center and seeing if it is no longer wet, please keep them under control!", "evidence": [" Check for doneness by inserting a toothpick into the center of each cake"], "id": "Agent", "dialog_act": "answer question"}, {"text": "They seem to look delicious! missing a few minutes, what do I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Try to give it an inviting look by making them brown, I recommend not burning them", "evidence": ["Brown the tops"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh no they look .... PERFECT! can we taste them now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Don't you want to burn your tongue?", "evidence": ["Finish and serve the cakes"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Are you right, do I let them cool down?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If you want you can add some decoration too", "evidence": ["Remove the cakes from the oven and let cool for a few minutes."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I don't think I can resist the temptation, I prefer to enjoy them as they are", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "calm the temptation and first try to serve them in an inviting way", "evidence": [" Place each cake on an individual serving platter and enjoy."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "You're absolutely right, I got tempted by the smell and the inviting look", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thanks! without your help I would have set the whole house on fire!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Bibingka", "url": "https://www.wikihow.com/Make-Bibingka", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes"], "procedure": [{"summary": "Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius).", "description": "Bibingka is a popular cake served during special occasions in the Philippines. Prepare four tart pans or ramekins by lining them with cut banana leaves. If you want the cakes to look as traditional as possible, bake them in 6-inch (15.25-cm) ramekins. You could use 4-oz (10-cm) ramekins, but the cakes will be thicker than usual and will also take longer to cook. Similarly, if baked in tart pans, the cakes will be a bit shallower than usual and may bake quicker. You could also use a standard 8-inch (20.3-cm) round baking pan with a depth of 3 inches (7.6 cm) if you do not have a tart pan, ramekins, or ramekin-like miniature baking pans. The banana leaves are an essential aspect of this recipe if you want it to be as traditional as possible. They add to both the appearance and fragrance of the finished cakes.", "img": "https://www.wikihow.com/images/thumb/1/12/Make-Bibingka-Step-1.jpg/v4-460px-Make-Bibingka-Step-1.jpg"}, {"summary": "Combine the first portion of dry ingredients.", "description": "In a large bowl, whisk together the rice flour, baking powder, and salt until well combined. Most traditional recipes only use standard rice flour and do not used sweet or glutinous rice flour.", "img": "https://www.wikihow.com/images/thumb/f/f0/Make-Bibingka-Step-2.jpg/v4-460px-Make-Bibingka-Step-2.jpg"}, {"summary": "Create the egg mixture.", "description": "In a separate bowl, beat the eggs lightly with a whisk. Add the sugar and beat again. Add the melted butter and beat once more. Granulated sugar is used in most traditional recipes for bibingka, but for a slightly different taste, you could use brown sugar, instead.", "img": "https://www.wikihow.com/images/thumb/4/45/Make-Bibingka-Step-3.jpg/v4-460px-Make-Bibingka-Step-3.jpg"}, {"summary": "Add the flour and coconut milk.", "description": "Alternate adding the flour mixture and coconut milk to the egg mixture, beating with a whisk after each addition. Only beat until the mixture is just blended, and avoid over-beating the batter.", "img": "https://www.wikihow.com/images/thumb/a/a7/Make-Bibingka-Step-4.jpg/v4-460px-Make-Bibingka-Step-4.jpg"}, {"summary": "Pour the batter into the prepared pans.", "description": "Divide the batter evenly amongst the four prepared pans, pouring it directly into the banana leaves. Traditionally, you should lay slices of salted egg on top of each cake before baking it. Duck eggs are the most traditional, but salted chicken eggs will also work.", "img": "https://www.wikihow.com/images/thumb/e/e8/Make-Bibingka-Step-5.jpg/v4-460px-Make-Bibingka-Step-5.jpg"}, {"summary": "Bake the cakes.", "description": "Place the cakes on the top rack of the oven and bake for 20 to 25 minutes, or until the cakes are cooked through. Check for doneness by inserting a toothpick into the center of each cake. If it comes out clean, then the cakes are fully cooked.", "img": "https://www.wikihow.com/images/thumb/1/1f/Make-Bibingka-Step-6.jpg/v4-460px-Make-Bibingka-Step-6.jpg"}, {"summary": "Brown the tops.", "description": "Switch the broiler on to low and broil the cakes for another 2 to 3 minutes, or until the top of each cake browns. Watch the cakes carefully during this time to prevent them from burning. Note that this step is only optional. It will have very little bearing on the taste of the cake, but it can create a more appealing appearance.", "img": "https://www.wikihow.com/images/thumb/9/90/Make-Bibingka-Step-7.jpg/v4-460px-Make-Bibingka-Step-7.jpg"}, {"summary": "Finish and serve the cakes.", "description": "Remove the cakes from the oven and let cool for a few minutes. Brush them with additional melted butter, and if desired, sprinkle with additional sugar, grated coconut, and grated cheese. Serve while still warm. You could eat the cakes out of the ramekins you baked them in, but for a better presentation, you should slide them out of their baking dishes before adding the butter, sugar, coconut, and cheese. Carefully tip each ramekin onto its side and gently slide the cake and banana leaves out. Place each cake on an individual serving platter and enjoy.", "img": "https://www.wikihow.com/images/thumb/c/c2/Make-Bibingka-Step-8.jpg/v4-460px-Make-Bibingka-Step-8.jpg"}]}}