{"conversation": [{"text": "What would you like to make?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I have a great black pudding recipe, its easy and delicious!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Here is the recipe", "evidence": ["Recipe"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thankyou, I can't wait to make this! What do I need to make this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You just need black pudding, its really cheap to buy", "evidence": ["Cut the pudding into thick slices."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great! What do I need to do first?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "How many slices should I cut this in to?", "evidence": ["Cut the pudding into thick slices."], "id": "Agent", "dialog_act": "answer question"}, {"text": "As many slices as you wish, tr to cut them into 1cm thick pieces", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, you need to remove the skin of the sausage.", "evidence": ["Remove the skin."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I remove the skin? Is the skin not edible?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Be careful not to pierce the sausage as you remove the skin", "evidence": ["Make a small incision at the edge of each slice with your knife "], "id": "Agent", "dialog_act": "answer question"}, {"text": "What do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Place your chopped sausage into a hot pan that is already pre heated.", "evidence": ["Place the pudding slices in a hot frying pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How hot does my pan need to be? Do I need oil in my pan?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can place a knob of butter or a spoonful of oil into the pan.", "evidence": ["Turn the stove on to a medium heat and begin heating a pan large enough to hold 2-3 pudding slices. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "How long do I let this cook for? How do I know when the sausage is cooked and safe to eat?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Keep an eye on them as they cook. It should only take 3-4 minutes to cook on each side. You can tell when the sausage is ready as it will get darker in colour.", "evidence": ["Fry for 3-4 minutes on each side."], "id": "Agent", "dialog_act": "answer question"}, {"text": "ok, what do I need to do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's it! Make sure not to make them overcooked and shrivelled but then you can eat!", "evidence": ["A properly fried pudding should be black and crisp on the outside, with a soft center slightly lighter in color."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Wow, that was easy. Thanks!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You're welcome", "evidence": ["Black pudding that has been overcooked will become shriveled and hard as it loses moisture."], "id": "Agent", "dialog_act": "other"}, {"text": "Thankyou, I can't wait to try this out!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Fry Black Pudding", "url": "https://www.wikihow.com/Cook-Black-Pudding", "category": ["Food and Entertaining", "Recipes", "Desserts and Sweets", "Puddings"], "procedure": [{"summary": "Cut the pudding into thick slices.", "description": "If you've bought a packaged black pudding, start by removing the plastic wrapping from the outside of the sausage. Lay the sausage on a cutting board and cut it into slices roughly half an inch thick using a sharp knife. The thicker slices will need to cook longer, but there will be less chance that the sausage filling will crumble as it heats. You can also begin slicing the sausage while it’s still in the plastic wrapper and remove the plastic and the skin together. Blood sausages like black pudding have a more delicate consistency because they contain very little actual meat. The oats and grains inside will not hold up as well to cooking as meatier sausages.", "img": "https://www.wikihow.com/images/thumb/b/b9/Cook-Black-Pudding-Step-1-Version-2.jpg/v4-460px-Cook-Black-Pudding-Step-1-Version-2.jpg"}, {"summary": "Remove the skin.", "description": "Make a small incision at the edge of each slice with your knife and then peel away the skin. Be careful not to damage the sausage as you are cutting and peeling. Removing the skin the black pudding prior to cooking will allow it to get more evenly done, and will also make it easier to eat. Use a sharpened knife to keep from mashing the sausage as you slice it.", "img": "https://www.wikihow.com/images/thumb/2/27/Cook-Black-Pudding-Step-2-Version-2.jpg/v4-460px-Cook-Black-Pudding-Step-2-Version-2.jpg"}, {"summary": "Place the pudding slices in a hot frying pan.", "description": "Turn the stove on to a medium heat and begin heating a pan large enough to hold 2-3 pudding slices. If you prefer, you can use an ounce of butter or a tablespoon of oil to fry the black pudding, though this is not necessary due to the high fat content of the sausage. Place the slices flat in the pan and let them start cooking. Black pudding will cook just fine in its own fat, much like bacon or other varieties of sausage. Butter and oil can be used for flavor and to give the outer layer an extra crispy finish. For a traditional English breakfast, add other ingredients to the pan that can be fried at the same time—eggs, bacon, potatoes, and other sausages are all fair game.", "img": "https://www.wikihow.com/images/thumb/0/0e/Cook-Black-Pudding-Step-3-Version-2.jpg/v4-459px-Cook-Black-Pudding-Step-3-Version-2.jpg"}, {"summary": "Fry for 3-4 minutes on each side.", "description": "Fry the black pudding slices for 3-4 minutes before turning them. Keep a close eye on them as they cook—because of their dark color, it can be hard to tell when they are done. A properly fried pudding should be black and crisp on the outside, with a soft center slightly lighter in color. Black pudding that has been overcooked will become shriveled and hard as it loses moisture.", "img": "https://www.wikihow.com/images/thumb/0/0a/Cook-Black-Pudding-Step-4-Version-2.jpg/v4-460px-Cook-Black-Pudding-Step-4-Version-2.jpg"}]}}