{"conversation": [{"text": "This is a recipe on how to make bibingka, a popular cake in the Philippines served during special occasions.", "evidence": ["Bibingka is a popular cake served during special occasions in the Philippines."], "id": "Agent", "dialog_act": "other"}, {"text": "Ok, what do I do first?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "First start by preparing a baking pan (13-inch by 9-inch) with butter, shortening or nonstick cooking spray.", "evidence": ["Prepare a 13-inch by 9-inch (33-cm by 23-cm) baking pan by greasing it with butter, shortening, or nonstick cooking spray."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I don't have a baking pan. What else can I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "What do you have that can be used for baking?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I have a 24-inch baking tin", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "You can use the baking tin. We will adjust the amount of ingredients accordingly", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, combine half of the cream cheese with 1 cup (100ml) of sugar", "evidence": ["Combine the two ingredients in a large bowl and beat them together with an electric mixer on low speed for roughly 30 seconds, or until thoroughly creamed together."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I combine them together?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should beat them together with an electric mixer on low speed for roughly 30 seconds", "evidence": ["beat them together with an electric mixer on low speed for roughly 30 seconds, or until thoroughly creamed together."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I do not have an electric mixer. What can I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can use a ladle or whisk to blend the ingredients until they are thoroughly creamed together", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "What is next? I have done this", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Before moving on, have you scraped the sides of the bowl so that all the cream cheese and sugar have been blended in?", "evidence": ["Scrape the sides of the bowl to ensure that all the cream cheese and sugar have been blended in."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes. Done. What is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add half the eggs into the mixture and stir it in to blend them in", "evidence": ["Add the eggs to the cream cheese mixture"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How to stir the eggs?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should be stirring well enough to blend the egg in. Once you have blended in the eggs, you must add half of the baking powder, sweet rice flour, melted butter, vanilla, cream of coconut, milk and crushed pineapple to the mixture", "evidence": ["stirring well enough to blend the egg in after each additio"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Do I add them all at the same time?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, you should add them one at a time, and continue to stir the mixture until it is smooth. When you add the flour, you should mix 1/2 cup (125ml) at a time to minimize risk of lumps forming", "evidence": ["Add them one at a time, stirring after each addition"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What is next after this?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Have you mixed everything and is it smooth?", "evidence": ["our the batter into your prepared pan."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes it seems smooth now", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Now pour the batter into the baking tin you prepared earlier, and then sprinkle the top with half of the brown sugar and 1 tbsp (15ml) of granulated sugar", "evidence": ["Pour the batter into your prepared pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I am getting bumps. What do I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should break up lumps with a fork or spatula. Have you checked for any air bubbles?", "evidence": ["Break up any lumps with a fork or spatula"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes there are air bubbles. What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can remove any air bubbles by gently tapping the baking tin against the counter", "evidence": ["Remove any air bubbles by gently tapping the bottom of the pan against the counter."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, what's next now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You can put the baking tin with the batter in the over to bake for 1 hour.", "evidence": ["Bake for 1 hour"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How high do I set the oven?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The oven should be preheated to 350 degrees Fahrenheit (180 degrees Celsius).", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "How do I know when it is cooked?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The bibingka is done when the edges turn slightly crispy and the center is baked through. You can check the center by inserting a toothpick. If it comes out clean it is ready.", "evidence": ["The cake is done when the edges turn slightly crispy and the center is baked through"], "id": "Agent", "dialog_act": "answer question"}, {"text": "It is cooked now. Anything else?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You should let the cake cool to room temperature in the tin.", "evidence": ["Let the cake cool to room temperature in its pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I serve it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Do you want to serve it now or later?", "evidence": ["Serve while still somewhat warm, or place the squares in an airtight container and serve later"], "id": "Agent", "dialog_act": "ask question"}, {"text": "I want to keep it for later", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "If you plan to serve later, after the cake cools you can cut it into even squares and place them in an airtight container. Do you plan on eating it in the next 1 to 2 days or in 1 to 2 weeks?", "evidence": ["place the squares in an airtight container and serve later"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I want to keep them for a few weeks", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "To preserve the freshness, you can put the container in the refrigerator for up to 2 weeks.", "evidence": ["o preserve the freshness of the cake for 1 to 2 weeks, place it in the refrigerator."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks. Its all done now", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make a Gourmet Bibingka", "url": "https://www.wikihow.com/Make-Bibingka", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes"], "procedure": [{"summary": "Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius).", "description": "Bibingka is a popular cake served during special occasions in the Philippines. Prepare a 13-inch by 9-inch (33-cm by 23-cm) baking pan by greasing it with butter, shortening, or nonstick cooking spray. Note that this version of the recipe does not require the use of banana leaves.", "img": "https://www.wikihow.com/images/thumb/4/46/Make-Bibingka-Step-18.jpg/v4-460px-Make-Bibingka-Step-18.jpg"}, {"summary": "Cream together the cream cheese and 2 cups (500 ml) sugar.", "description": "Combine the two ingredients in a large bowl and beat them together with an electric mixer on low speed for roughly 30 seconds, or until thoroughly creamed together. Scrape the sides of the bowl to ensure that all the cream cheese and sugar have been blended in.", "img": "https://www.wikihow.com/images/thumb/3/3c/Make-Bibingka-Step-19.jpg/v4-460px-Make-Bibingka-Step-19.jpg"}, {"summary": "Stir the eggs in.", "description": "Add the eggs to the cream cheese mixture, stirring well enough to blend the egg in after each addition.", "img": "https://www.wikihow.com/images/thumb/7/7e/Make-Bibingka-Step-20.jpg/v4-460px-Make-Bibingka-Step-20.jpg"}, {"summary": "Mix in the remaining ingredients.", "description": "Add the baking powder, sweet rice flour, melted butter, vanilla, cream of coconut, milk, and crushed pineapple to the batter. Add them one at a time, stirring after each addition. When done, continue stirring until the batter is smooth. When adding the flour, you should mix it into the batter 1/2 cup (125 ml) at a time and stir after each addition. Doing so minimizes the risk of lumps forming in your batter.", "img": "https://www.wikihow.com/images/thumb/3/3b/Make-Bibingka-Step-21.jpg/v4-460px-Make-Bibingka-Step-21.jpg"}, {"summary": "Pour the batter into your prepared pan.", "description": "Once the batter is in the pan, sprinkle the top evenly with the brown sugar and an additional 2 Tbsp (30 ml) granulated sugar. Check the batter for lumps or air bubbles. Break up any lumps with a fork or spatula. Remove any air bubbles by gently tapping the bottom of the pan against the counter.", "img": "https://www.wikihow.com/images/thumb/0/04/Make-Bibingka-Step-22.jpg/v4-460px-Make-Bibingka-Step-22.jpg"}, {"summary": "Bake for 1 hour.", "description": "The cake is done when the edges turn slightly crispy and the center is baked through. Check the center by inserting a toothpick into the cake. If it comes out clean, the cake is ready. Let the cake cool to room temperature in its pan.", "img": "https://www.wikihow.com/images/thumb/d/d3/Make-Bibingka-Step-23.jpg/v4-460px-Make-Bibingka-Step-23.jpg"}, {"summary": "Serve warm.", "description": "After the cake cools to room temperature, cut it into 12 to 24 even squares and remove those squares from the pan. Serve while still somewhat warm, or place the squares in an airtight container and serve later. If you plan on eating the cake in the next 1 to 2 days, you can store it at room temperature. To preserve the freshness of the cake for 1 to 2 weeks, place it in the refrigerator.", "img": "https://www.wikihow.com/images/thumb/f/fa/Make-Bibingka-Step-24.jpg/v4-460px-Make-Bibingka-Step-24.jpg"}]}}