{"conversation": [{"text": "We're going to be baking a steak today.", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, how do I get started?  I think I have all the ingredients here...", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "First up, we need to preheat the oven.  This will take some time, so doing it early means we can do preparation work at the same time.  Preheat the oven to 400 degrees.", "evidence": ["Preheat the oven to 400 °F", "This typically takes about 20 to 30 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is that degrees F or C?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "400 degrees Fahrenheit.  It's 204 degrees Celcius, so you might need to round it to 200 or 205 depending on your oven.", "evidence": ["400 °F (204 °C)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, it's preheating now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "By the way, if your oven sometimes takes a while to get up to temperature, you can start off heating it up using the broiler setting, then swap it over to bake when you plan on using it.", "evidence": ["To preheat the oven faster, turn on the broiler first. Then switch it to the bake setting before you use it."], "id": "Agent", "dialog_act": "other"}, {"text": "Thanks for the tip, but I think it'll be fine.  We can just move onto the prep work now.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "How many servings of steak are you going to want?  It'll affect the next step.", "evidence": ["Lay out two 12 by 12 in (30 by 30 cm) sheets of aluminum foil."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Just two will be fine, I don't need more than that.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay, then you'll need two 12 inch square pieces of foil.  Lay them either on your counter, or on a cutting surface.", "evidence": ["Tear off your sheets and place them side by side on a flat surface. Smooth out any wrinkles with the palm of your hand so they’re com", "For extra protection, you can place the aluminum foil on a cutting board. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it matter whether it's on the counter or on my chopping board?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It's up to you whether you would find it easier to clean the countertop or the board at the end.", "evidence": ["If any stray pieces of steak or juice comes off the foil, it won’t contaminate the counter."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I'll put the foil directly on my countertop now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You'll need to cut strips of steak and place them across those two pieces of foil.  The steak should be around 2 inches thick, it's okay if you go a little thicker than this, but don't have too much variety.", "evidence": ["Cut the steak into even strips that are at least 2 in (5.1 cm) thic", "Don't cut pieces thicker than 4 inches (10 cm). Otherwise, your steak will be undercooked."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'll split the steak evenly onto both pieces of foil.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "What kind of steak do you have?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I think it's hanger steak.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Great choice, it works really well in this recipe, it soaks up marinade well.  When you're done, make sure to wash your hands, too!", "evidence": ["Skirt, hanger, or flank steak cuts work best for these packets. They're tender, easy to cut, and soak up marinade well. ", "Wash your hands with soap and warm water after handling the raw meat so you don’t spread bacteria."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "This is just a pile of meat at this point, where's the flavour?  Is that what happens now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yeah, exactly.  Now that we have meat on foil, we can start to add the seasonings.  A couple of tablespoons of olive oil, plus simple seasonings like salt and pepper.  If you've got other things available, add them in too!  More flavour is always better.", "evidence": ["Season the steak with the olive oil, salt, and pepper"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have a cupboard full of mixed dried herbs, I could add some of those, I only really use those in Italian ragu otherwise...", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Yeah, this is a place where you can be creative.  Add whatever you want, as long as you think it'll taste good, and then seal it up by squeezing together the foil edges extremely tightly.  It needs to stop moisture escaping.", "evidence": ["Seal the aluminum foil around the steak, forming a pack"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "This looks a bit loose... I'm worried that it's not tight enough...", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "If you're concerned, you can always open up the foil, move the steak onto a new square of foil, and try again.  Maybe you made the square a little smaller than you needed to?", "evidence": ["If you rip the foil, transfer the steak to a new sheet and wrap it again."], "id": "Agent", "dialog_act": "other"}, {"text": "Yeah, I probably mis-estimated, but I think I can probably squeeze this closed.  I'll try not to make this mistake again next time.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Is your oven already up to temperature?", "evidence": [" the oven t"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, the indicator light went off a few minutes ago.  Good timing!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay, the foil parcels are going to go into the oven, directly onto the rack.  Make sure the sealed edges face upwards to avoid leaks.  If you want, you can put a tray underneath just in case it drips.", "evidence": ["Place the packs in the oven to cook for 30 minutes", "Set the packs directly on the oven rack, making sure the side with the sealed edges is facing up", "To avoid a mess, you can place the packs on a baking sheet to catch any juice that may leak out of the foil"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What should I set the timer for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Half an hour should be good.", "evidence": ["30 minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What am I going to do after that?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Well, when it's done, then they'll come out of the oven.  Though that won't be the end, meat should always be rested before being served, so it'll be another five more minutes after that before it's done.", "evidence": ["Remove the packs from the oven and let them rest for 5 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'm not always going to have this much spare time to cook these...", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That's okay, this keeps great in the refrigerator for a few days.  You can use leftovers in salads and sandwiches.", "evidence": ["Store any leftover steak in an airtight container in the refrigerator for no more than 4 days"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "That sounds good, I hate food waste.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "After that, you're done!  You can just put it on a plate, serve it, and eat!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "That's amazing, thank you so much for helping me!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I hope you enjoy your meals.", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "The variety I'll be able to have by changing up the spices will really help keep it new and exciting between different times I do it.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "[The end submission button isn't appearing, this is not a real message, I'm just trying to get the button to appear]", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}], "recipe": {"title": "How to Bake a Steak", "url": "https://www.wikihow.com/Bake-a-Steak", "category": ["Food and Entertaining", "Recipes", "Meat", "Beef and Lamb", "Steak Dishes"], "procedure": [{"summary": "Preheat the oven to 400 °F (204 °C).", "description": "This typically takes about 20 to 30 minutes. Turn the oven on while you make the foil packs so it’s at the right temperature when you’re ready to place the steak inside. To preheat the oven faster, turn on the broiler first. Then switch it to the bake setting before you use it.", "img": "https://www.wikihow.com/images/thumb/8/83/Bake-a-Steak-Step-11-Version-5.jpg/550px-nowatermark-Bake-a-Steak-Step-11-Version-5.jpg"}, {"summary": "Lay out two 12 by 12 in (30 by 30 cm) sheets of aluminum foil.", "description": "Tear off your sheets and place them side by side on a flat surface. Smooth out any wrinkles with the palm of your hand so they’re completely flat. If you want to divide the steak into more than 2 servings, use smaller pieces of aluminum foil. For example, rip off 4 6 by 6 in (15 by 15 cm) sheets. For extra protection, you can place the aluminum foil on a cutting board. If any stray pieces of steak or juice comes off the foil, it won’t contaminate the counter.", "img": "https://www.wikihow.com/images/thumb/1/11/Bake-a-Steak-Step-12-Version-5.jpg/550px-nowatermark-Bake-a-Steak-Step-12-Version-5.jpg"}, {"summary": "Cut the steak into even strips that are at least 2 in (5.1 cm) thick.", "description": "This will give you steak that’s cooked medium-well. If you cut strips that are thinner than 2 inches (5.1 cm), the steak will likely be dry and overcooked. Use a sharp knife to slice the 1 lb (0.45 kg) top sirloin steak on a cutting board, making sure the strips are all approximately the same thickness. The thicker the strips are, the more rare your steak will be. Don't cut pieces thicker than 4 inches (10 cm). Otherwise, your steak will be undercooked. Skirt, hanger, or flank steak cuts work best for these packets. They're tender, easy to cut, and soak up marinade well. If you don't want to spend a lot of money, pick a cheaper cut like tri-tips, bottom sirloin, or top blade.", "img": "https://www.wikihow.com/images/thumb/f/f2/Bake-a-Steak-Step-13-Version-5.jpg/550px-nowatermark-Bake-a-Steak-Step-13-Version-5.jpg"}, {"summary": "Place half of the steak strips in the center of each foil sheet.", "description": "Grouping the meat as close to the center of the foil will make it easier to close up the packs. Keep the amounts on each sheet even so one pack isn’t much larger than the other. If you used more than 2 sheets of foil, divide up your steak accordingly. Wash your hands with soap and warm water after handling the raw meat so you don’t spread bacteria.", "img": "https://www.wikihow.com/images/thumb/d/db/Bake-a-Steak-Step-14-Version-5.jpg/550px-nowatermark-Bake-a-Steak-Step-14-Version-5.jpg"}, {"summary": "Season the steak with the olive oil, salt, and pepper.", "description": "Drizzle 2 tablespoons (30 ml) of olive oil over both piles of meat, then sprinkle salt and pepper on top. Add as much seasoning as you’d like. Feel free to add other spices and herbs, like dried rosemary, garlic salt, or curry powder, for extra flavor. You can also chop up veggies or potatoes to cook with the steak in the packs. Substitute any type of oil for the olive oil if you prefer a different taste.", "img": "https://www.wikihow.com/images/thumb/9/95/Bake-a-Steak-Step-15-Version-3.jpg/550px-nowatermark-Bake-a-Steak-Step-15-Version-3.jpg"}, {"summary": "Seal the aluminum foil around the steak, forming a pack.", "description": "Gather the edges of the foil sheet and squeeze them together in the center, wrapping up the steak. Try to avoid leaving any gaps where moisture could escape. The tighter you seal the packs, the juicier the meat will be. If you rip the foil, transfer the steak to a new sheet and wrap it again.", "img": "https://www.wikihow.com/images/thumb/2/28/Bake-a-Steak-Step-16-Version-3.jpg/550px-nowatermark-Bake-a-Steak-Step-16-Version-3.jpg"}, {"summary": "Place the packs in the oven to cook for 30 minutes.", "description": "Set the packs directly on the oven rack, making sure the side with the sealed edges is facing up. The best spot is the center rack, which is where the hot air circulates best and cooks your meat more evenly. To avoid a mess, you can place the packs on a baking sheet to catch any juice that may leak out of the foil. Use your phone’s clock app or a kitchen timer so you don’t forget to take the packs out after 30 minutes.", "img": "https://www.wikihow.com/images/thumb/9/9d/Bake-a-Steak-Step-17-Version-3.jpg/550px-nowatermark-Bake-a-Steak-Step-17-Version-3.jpg"}, {"summary": "Remove the packs from the oven and let them rest for 5 minutes.", "description": "When steak cooks, the moisture spreads to the outside of the meat. Letting it rest before you eat it allows the steak to soak back up the juices so it’s not dry. Store any leftover steak in an airtight container in the refrigerator for no more than 4 days. How to Use Leftover Steak\nCut the steak into strips for fajitas or tacos. Slice it thinly to use on sandwiches, like a Philly cheesesteak. Toss strips of steak with green salad for a filling lunch. Dice it up to add to soups or stews. Serve steak with eggs for a hearty breakfast.", "img": "https://www.wikihow.com/images/thumb/a/ac/Bake-a-Steak-Step-18-Version-3.jpg/550px-nowatermark-Bake-a-Steak-Step-18-Version-3.jpg"}]}}