{"conversation": [{"text": "Smell the salmon.  Does it have a bad odor?", "evidence": ["Smell the raw salmon to see if it has a bad odor", "If the fish smells pungent, fishy, or ammonia-like, it is probably bad. Fresh salmon should have a very mild scent."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "No it doesn't smell bad", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Ok. Now, you need to check if the fish has a milky coating.  Does it have a milky coating?", "evidence": ["Look for a milky coating to indicate the fish has gone bad"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "No, the fish doesn't have a milky coating.  Is that a good thing?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Yes, that's good.  If it had a coating, it would be an indication it was off.", "evidence": ["A sign that raw fish has gone bad is the presence of a white, translucent skin on top of it."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok great.  What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, can you you check to see if the salmon is firm?  Does it hold together when you handle it?", "evidence": ["See if the salmon has a weak consistency"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes it does.  Should it stay together wen I handle it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes it should.  Fresh salmon should always be firm and hold together", "evidence": [" Fresh salmon should always be firm and hold together."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great.  What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You need to inspect the eyes for discolouration.  Are the eyes bright and clear with a dark pupil in the middle?", "evidence": ["Inspect the eyes for discoloration", "Fresh salmon should have bright, clear eyes with a dark pupil in the middle"], "id": "Agent", "dialog_act": "answer question"}, {"text": "The eyes are bright and clear with a dark pupil in the middle", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Are the eyes bulging slightly?", "evidence": ["The salmon's eyes should also appear slightly bulging. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes, the eyes are bulging slightly", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Now you need to check the colour of the salmon.  Does it have a dull, pale colour? Or is it bright pink or orange in colour?", "evidence": ["Check if the salmon has a dull, pale color.", "Fresh salmon should have a bright pink or orange color to it. If your salmon has a pale, dull color, it is likely spoiled. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "The salmon is bright pink or orange in colour", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Does the salmon have fine white line running through it?", "evidence": ["salmon should also have fine white lines running though it, which indicate freshness."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, the salmon have fine white line running through it.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Can you check the sell by and best before dates on the packaging?  Is the salmon within those dates?", "evidence": ["check the \"best before\" date indicated on the packaging.", "should also check the \"sell by\" date,"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, the salmon is within the nest before and sell by dates", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "That great, that means the salmon is ok to use. What you would like to do now with the salmon?", "evidence": ["This date is not a definite prediction of when your fish will go bad, but it will give you a good idea of when it might spoil"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I would like to try a recipe to make something with the salmon", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "That's great.  What sort of recipe would you like to make?", "evidence": ["As a general rule, refrigerated fresh salmon will keep for one or two days after its \"sell by\" date."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Something quick and easy", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Know if Salmon Is Bad", "url": "https://www.wikihow.com/Know-if-Salmon-Is-Bad", "category": ["Food and Entertaining", "Recipes", "Fish and Seafood", "Salmon"], "procedure": [{"summary": "Make sure the fish doesn't have a strong, ammonia-like smell.", "description": "Smell the raw salmon to see if it has a bad odor. If the fish smells pungent, fishy, or ammonia-like, it is probably bad. Fresh salmon should have a very mild scent.", "img": "https://www.wikihow.com/images/thumb/f/f3/Know-if-Salmon-Is-Bad-Step-1-Version-2.jpg/v4-460px-Know-if-Salmon-Is-Bad-Step-1-Version-2.jpg"}, {"summary": "Look for a milky coating to indicate the fish has gone bad.", "description": "A sign that raw fish has gone bad is the presence of a white, translucent skin on top of it. Before cooking, inspect your salmon to make sure it doesn't have a milky film on its surface. If you see any kind of opaque film developing on the fish, throw it away.", "img": "https://www.wikihow.com/images/thumb/0/03/Know-if-Salmon-Is-Bad-Step-2-Version-2.jpg/v4-460px-Know-if-Salmon-Is-Bad-Step-2-Version-2.jpg"}, {"summary": "See if the salmon has a weak consistency.", "description": "Before cooking it, check the consistency of your raw salmon. If the fish feels like it is breaking up while you handle it, throw it away. Fresh salmon should always be firm and hold together.", "img": "https://www.wikihow.com/images/thumb/d/da/Know-if-Salmon-Is-Bad-Step-3-Version-2.jpg/v4-460px-Know-if-Salmon-Is-Bad-Step-3-Version-2.jpg"}, {"summary": "Inspect the eyes for discoloration.", "description": "If you purchase salmon with the head still on, check the appearance of its eyes. Fresh salmon should have bright, clear eyes with a dark pupil in the middle. When the fish has gone bad, the eyes will appear discolored. The salmon's eyes should also appear slightly bulging. If the eyes appear sunken in, the fish has likely gone bad.", "img": "https://www.wikihow.com/images/thumb/1/13/Know-if-Salmon-Is-Bad-Step-4-Version-2.jpg/v4-460px-Know-if-Salmon-Is-Bad-Step-4-Version-2.jpg"}, {"summary": "Check if the salmon has a dull, pale color.", "description": "Check the coloring of your salmon to see if it is still good or not. Fresh salmon should have a bright pink or orange color to it. If your salmon has a pale, dull color, it is likely spoiled. Your salmon should also have fine white lines running though it, which indicate freshness.", "img": "https://www.wikihow.com/images/thumb/e/ec/Know-if-Salmon-Is-Bad-Step-5-Version-2.jpg/v4-460px-Know-if-Salmon-Is-Bad-Step-5-Version-2.jpg"}, {"summary": "Check the \"best before\" and \"sell by\" dates.", "description": "If you are in doubt about the quality of your salmon, check the \"best before\" date indicated on the packaging. This date is not a definite prediction of when your fish will go bad, but it will give you a good idea of when it might spoil. You should also check the \"sell by\" date, which should also be indicated on the packaging. As a general rule, refrigerated fresh salmon will keep for one or two days after its \"sell by\" date.", "img": "https://www.wikihow.com/images/thumb/1/11/Know-if-Salmon-Is-Bad-Step-6-Version-2.jpg/v4-460px-Know-if-Salmon-Is-Bad-Step-6-Version-2.jpg"}]}}