{"conversation": [{"text": "Hello, are you ready to cook?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "I'm absolutely ready! Let's do this!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "start by turning on your burner. Do you have a grilltop or grill grate?", "evidence": ["Set the burners to \"low\""], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I am using a grilltop. Is that okay?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "yes that's perfectly fine", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay good.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Let's get our bacon into a roNasting pan and put it right on the grilltop. Make sure to close the lid to keep the heat in.", "evidence": ["While you're waiting for the grill to warm up, lay your bacon strips over the grate in a roasting pan", "To keep your cooking time low, keep the lid shut during cooking except for when you check on the bacon's progress."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sounds good. Can't wait to eat this yummy bacon that really exists and isn't just a story thing! What do I do next? Is it time to eat the bacon yet?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Give the bacon a flip to ensure even cooking. Nothing good about chewy raw bacon. try to only flip it once if you can. The more times you open the lid the longer the bacon will take to cook. Don't rush it though, if it's cooking too fast then you should turn the heat down and flip the bacon so that it doesn't burn.", "evidence": ["Don't forget to turn doing the cooking process — though it's not as essential here because the heat is coming from all sides, rather than just from below, it's still necessary for even cooking.", "Keep a close eye on your bacon as it cooks — if it's cooking too quickly, flip it immediately and reduce the heat."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "That is so true, I love bacon but I hate undercooked bacon like I hate my aunt Mildred. So slimey... This bacon looks good though, I think we're nearly there. What shall I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Once the bacon looks ready to eat, transfer it to a plate with some paper towel on it to absorb some of the excess grease. Now you may eat your delicious bacon that you cooked yourself!", "evidence": ["Once the bacon is cooked on both sides to your liking, use a pair of tongs to remove it from the grill to a paper towel-lined plate."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Holy smokes this looks soooooo good! Very nice dark colour but not too crispy. The smell is incredible also, but that goes without saying really... I would never have been able to do this without your help! I'll have to have you over sometime to enjoy a feast of grilled bacon!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I'm very happy to help you! You're a very good student! I'd love to have some of your bacon sometime. Anyways, enjoy your bacon!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Am I done cooking? Did I miss any steps?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "One thing I forgot is to shut off your grill and take the pan to the sink once it's cool enough. Now you're finished!", "evidence": ["At this point, you're more or less done! Shut off your grill and, once it's cool enough to handle, carefully remove your roasting pan"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yummy yummy!!! Thank you again for your help! I'm so full from this delicious bacon! All done!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Grill Bacon Using a Gas Grill", "url": "https://www.wikihow.com/Grill-Bacon", "category": ["Food and Entertaining", "Recipes", "Meat", "Pork", "Bacon"], "procedure": [{"summary": "Set the burners to \"low\".", "description": "Your goal when cooking bacon on a gas grill isn't to cook the bacon directly on the grill grate — if you do this, the fat, which renders and liquefies as the bacon cooks, can drip down onto the burners. This is even more of a problem here than it is for a charcoal grill because, in addition to causing flare-ups, dripping grease can get the burners or bottom of a gas grill dirty. To avoid this, we'll use a modified indirect cooking method that uses all of the burners (as opposed to the offset coal method above). Begin by lighting most or all of the grill's burner's and closing the lid. Let the grill heat up for several minutes before beginning cooking.", "img": "https://www.wikihow.com/images/thumb/6/66/Grill-Bacon-Step-6-Version-4.jpg/550px-nowatermark-Grill-Bacon-Step-6-Version-4.jpg"}, {"summary": "Place the bacon in a roasting pan.", "description": "While you're waiting for the grill to warm up, lay your bacon strips over the grate in a roasting pan. This pan should consist of a metal grate that fits into a lower \"grease catcher\" with no holes in it. This allows the bacon to safely cook from the heat of the grill without dripping grease onto the bottom of the grill or burners. As an added bonus, roasting pans make for easy cleanup — just pour the grease out of the lower pan, wash the pan and the grate, and you're done!", "img": "https://www.wikihow.com/images/thumb/2/23/Grill-Bacon-Step-7-Version-3.jpg/v4-460px-Grill-Bacon-Step-7-Version-3.jpg"}, {"summary": "Cook the bacon with the lid closed.", "description": "Add your roasting pan full of bacon to the grill and shut the lid. This keeps the heat from the burners inside the grill, cooking the bacon from both above and below in a fashion similar to baking it. To keep your cooking time low, keep the lid shut during cooking except for when you check on the bacon's progress. Don't forget to turn doing the cooking process — though it's not as essential here because the heat is coming from all sides, rather than just from below, it's still necessary for even cooking. You'll want to turn at least as it cooks — more is fine, but may lengthen the cooking time by allowing the grill's heat to escape. Keep a close eye on your bacon as it cooks — if it's cooking too quickly, flip it immediately and reduce the heat.", "img": "https://www.wikihow.com/images/thumb/a/a3/Grill-Bacon-Step-8-Version-3.jpg/v4-460px-Grill-Bacon-Step-8-Version-3.jpg"}, {"summary": "Serve as normal.", "description": "Once the bacon is cooked on both sides to your liking, use a pair of tongs to remove it from the grill to a paper towel-lined plate. At this point, you're more or less done! Shut off your grill and, once it's cool enough to handle, carefully remove your roasting pan.", "img": "https://www.wikihow.com/images/thumb/9/94/Grill-Bacon-Step-9-Version-3.jpg/v4-460px-Grill-Bacon-Step-9-Version-3.jpg"}]}}
