{"conversation": [{"text": "we need frosting for the cake please choose some", "evidence": ["Select a frosting for the cake."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I want strawberry frosting", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We need a thick frosting strawberry will work perfectly", "evidence": ["Use any frosting that's thick enough to stick to the top and sides of the cake."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "what do I do now after?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "We need to create even sides of the cake. Use an icing smoother to create that smoothness effect", "evidence": ["Use an icing smoother to create evenly frosted sides"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Im having trouble smoothing it any tips?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No problem try to create thick bands of frosting around the cake. Then use an icing smoother or bench scraper against the side of the cake. Try using a turn table for the cake so you can create an even surface", "evidence": ["Keep going up around the sides until they're coated with frosting.", "Run the smoother around the cake to create an even surface."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Awesome I just smoothed out my cakes icing using a turn table what can we do now", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "We need to create a pattern on our cake now!", "evidence": ["Fill a piping bag and pipe a pattern onto the cake."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What type of pattern should we make?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We can use a petal or plain round tip to create our pattern. Try a petal tip and create a ruffled edge look around the cake!", "evidence": ["select a petal tip to pipe a ruffled", " or use a plain round tip to pipe dots across the top"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I don't have a piping bag", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Use a food safe plastic bag and place your frosting in that! Cut the bottom tip of the bag and you have yourself a piping bag", "evidence": ["put the frosting into a food-safe plastic bag and cut off the bottom tip of the bag."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright I created a make shift piping bag and did an okay job. Whats the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Its time to add some decorations on the top of the cake!", "evidence": ["Use piping tips to create decorative shapes, flowers, or words"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "what type of decorations or styles should I do ?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add a slim piping bag tip so you can create some lovely flower swirls on top of the cake", "evidence": ["Use piping tips to create decorative shapes, flowers, or words"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I added some okay looking flowers what Is our next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "I want to teach you to make a cool zig zag pattern in our cake", "evidence": ["Use the back of a spoon to make swirls in the frosting"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay how can we do that?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We need to use the back of a spoon to push into the cake making a half circle motion. Lets do this across the top and sides of the cake. Once complete use a fork and run the tines of it through the frosting back and forth to create that zig zag pattern!", "evidence": ["Ensure that the cake has at least 1 to 2 inches (2.5 to 5.1 cm)", ". Take a spoon and hold the back so the tip is pressing gently into the frosting"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Wow my cake looks great thank you for all your hard work today. I know it takes alot of patience to help a newbie baker like myself but I thank you for your patience!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Decorate a Cake", "url": "https://www.wikihow.com/Decorate-a-Cake", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes", "Cake Decorating"], "procedure": [{"summary": "Select a frosting for the cake.", "description": "Use any frosting that's thick enough to stick to the top and sides of the cake. If your frosting is too runny to pipe or spread using an offset spatula, mix in powdered sugar until it thickens. Consider using:\n\nButtercream or Vienna cream\nCream cheese frosting\nMarshmallow frosting\nRoyal icing\nSwiss or Italian meringue buttercream\nGanache", "img": "https://www.wikihow.com/images/thumb/9/9e/Decorate-a-Cake-Step-1-Version-2.jpg/v4-460px-Decorate-a-Cake-Step-1-Version-2.jpg"}, {"summary": "Use an icing smoother to create evenly frosted sides.", "description": "Use an icing tip on a pastry bag to pipe thick bands of frosting around the sides of the cake. Keep going up around the sides until they're coated with frosting. Then hold an icing smoother or bench scraper vertically against the side of the cake. Run the smoother around the cake to create an even surface. It's easier to use the icing smoother if the cake is on a turntable. Then you can slowly rotate the cake while holding the icing smoother against the side. If you choose to leave the sides of the cake \"naked,\" spread just a few thin patches of frosting along the sides so the layers of cake are still visible.", "img": "https://www.wikihow.com/images/thumb/e/e3/Decorate-a-Cake-Step-2-Version-2.jpg/550px-nowatermark-Decorate-a-Cake-Step-2-Version-2.jpg"}, {"summary": "Fill a piping bag and pipe a pattern onto the cake.", "description": "Choose a piping tip that helps you create the design you want. For example, select a petal tip to pipe a ruffled edge along the cake or use a plain round tip to pipe dots across the top of the cake. Did You Know? Popular patterns include basketweave, ruffles, scallops, stars, and lace. If you don't have a piping bag, put the frosting into a food-safe plastic bag and cut off the bottom tip of the bag. You won't be able to control the level of piping detail, but it will give you a simple piping bag.", "img": "https://www.wikihow.com/images/thumb/a/a5/Decorate-a-Cake-Step-3-Version-2.jpg/550px-nowatermark-Decorate-a-Cake-Step-3-Version-2.jpg"}, {"summary": "Use piping tips to create decorative shapes, flowers, or words.", "description": "Once you've covered the cake with the frosting of your choice, decide if you want to add a few embellishments. Change the tip on the piping bag so you can write words or pipe flowers. Some tips are designed for specific shapes, such as leaves. For example, to make an elegant fleurs-de-lis, use a star tip to pipe 3 reverse shells. You can also use the star tip to pipe the frosting into a simple rosette.", "img": "https://www.wikihow.com/images/thumb/4/4c/Decorate-a-Cake-Step-4-Version-2.jpg/550px-nowatermark-Decorate-a-Cake-Step-4-Version-2.jpg"}, {"summary": "Use the back of a spoon to make swirls in the frosting.", "description": "Ensure that the cake has at least 1 to 2 inches (2.5 to 5.1 cm) of frosting on the top and sides. Take a spoon and hold the back so the tip is pressing gently into the frosting. Twist the spoon in a half-circle motion to create a wave. Keep doing this across the sides and top of the cake. To create an easy zigzag pattern, drag the tines of a fork through the frosting in a back and forth motion.", "img": "https://www.wikihow.com/images/thumb/6/65/Decorate-a-Cake-Step-5-Version-2.jpg/550px-nowatermark-Decorate-a-Cake-Step-5-Version-2.jpg"}]}}