{"conversation": [{"text": "Start by collecting your ingredients into a bowl", "evidence": ["Mix the ingredients in a bowl"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How do I know when to move onto the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Mix all the ingredients until everything is mixed", "evidence": ["so they’re fully blended"], "id": "Agent", "dialog_act": "answer question"}, {"text": "what do the ingredients do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Each part plays a roll, the citric acid helps give a sour taste!", "evidence": ["citric acid helps give the sherbet powder a sour taste to contrast with the sweetness of the sugar"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Take your new sherbet powder and move it into a plastic bag for storage", "evidence": ["Transfer the sherbet powder to a plastic bag for storage"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Do I mix all the flavours together?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Make sure you keep the different flavours stored separately", "evidence": [" Make sure that you have a separate bag for each flavor of powder"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What if I don't have a plastic sealable bag?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Any airtight container will do the job!", "evidence": ["You can substitute any airtight container for the plastic bag"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What do I do after this?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Prepare to serve the powder in fun ways like lollipops!", "evidence": ["Serve the powder with lollipops or popsicles sticks"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Are there any other ways of eating this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can just use a wooden popsicle stick and dip into the powder", "evidence": ["you can just use a plain wooden popsicle stick to dip into it"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Are there any methods my kids might enjoy more?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can always let them go wild and just dip their fingers into the powder!", "evidence": ["Kids often enjoy just dipping their fingers into the sherbet powder and licking it off"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What if I want to make different flavours?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Use a similar recipe as previously, just swapping the flavoured gelatine crystals for whatever flavour you like!", "evidence": ["1 teaspoon (5 g) of baking soda, 1 teaspoon (5 g) food grade citric acid, and 3 tablespoons (23 g) of icing sugar for every 2 tablespoons (19 g) of different flavored gelatin that you plan to use."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thank you for your help!", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thank you for your help!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Sherbet Powder", "url": "https://www.wikihow.com/Make-Sherbet-Powder", "category": ["Food and Entertaining", "Recipes", "Desserts and Sweets", "Gelatin Desserts"], "procedure": [{"summary": "Mix the ingredients in a bowl.", "description": "Add 1 teaspoon (5 g) of baking soda, 1 teaspoon (5 g) of food grade citric acid, 3 tablespoons (23 g) of icing sugar, and 2 tablespoons (19 g) of flavored gelatin crystals in the flavor of your choice to a small bowl. Use a spoon to mix the ingredients together well, so they’re fully blended. In some parts of the world, icing sugar is also known as powdered sugar. In some parts of the world, flavored gelatin is also known as jelly crystals. Food grade citric acid is usually sold in grocery and mass merchandise stores with the canning supplies. If you can’t find it in a local store, you can also order it online. The citric acid helps give the sherbet powder a sour taste to contrast with the sweetness of the sugar. It also reacts with the baking soda for a fizzy sensation. If you want sherbet powder to be more fizzy, you can add in a little more citric acid.", "img": "https://www.wikihow.com/images/thumb/f/f5/Make-Sherbet-Powder-Step-1.jpg/v4-460px-Make-Sherbet-Powder-Step-1.jpg"}, {"summary": "Transfer the sherbet powder to a plastic bag for storage.", "description": "After you’ve mixed all of the ingredients, pour the sherbet powder into a sealable plastic bag for storage. Make sure that you have a separate bag for each flavor of powder that you’ve mixed up. You can substitute any airtight container for the plastic bag. A jar with a lid or a tupperware container will also work well.", "img": "https://www.wikihow.com/images/thumb/9/9e/Make-Sherbet-Powder-Step-2.jpg/v4-460px-Make-Sherbet-Powder-Step-2.jpg"}, {"summary": "Serve the powder with lollipops or popsicles sticks.", "description": "A lollipop is one of the most common ways to enjoy sherbet powder. Lick the lollipop, dip it in the powder, and then lick it off. If you don’t want to use candy to eat the powder, you can just use a plain wooden popsicle stick to dip into it. Kids often enjoy just dipping their fingers into the sherbet powder and licking it off. This recipe will make a single flavor of sherbet powder. If you want to create more than one flavor, you’ll need 1 teaspoon (5 g) of baking soda, 1 teaspoon (5 g) food grade citric acid, and 3 tablespoons (23 g) of icing sugar for every 2 tablespoons (19 g) of different flavored gelatin that you plan to use.", "img": "https://www.wikihow.com/images/thumb/b/be/Make-Sherbet-Powder-Step-3.jpg/v4-460px-Make-Sherbet-Powder-Step-3.jpg"}]}}