{"conversation": [{"text": "Hi there! Would you like to learn how to make red rice coconut pudding?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes! I'd love to. What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "First of all you will need red Bhutanese rice, water and salt. So first measure 3/4 cups of red Bhutanese rice, then 1 1/2 cups of water, and finally add 1/4 teaspoon of salt to a medium saucepan.", "evidence": ["Measure ¾ cup (134 g) of red Bhutanese rice, 1 ½ cups (360 ml) of water, and ¼ teaspoon of salt into a medium-sized saucepan. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sure! What's next then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now you turn on the heat to \"high\" and wait until it boils.", "evidence": ["Turn the heat on to high and bring the mixture to a boil. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "It's bubbling now... What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Ok great! Next you want to lower the heat to medium-low and put the lid on the pot. You want the pudding to gently boil for 30 minutes. This is so the water is absorbed and the rice becomes very soft.", "evidence": ["urn the heat down to medium-low and put the lid on the pot. Let the pudding boil lightly for 30 minutes. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Do I need to stir the mixture whiling boiling the pudding?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No you do not. Is your pudding simmering? If not, then you need to increase the heat", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, it is simmering. What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now you need milk, coconut milk, vanilla and sugar to add to the saucepan. Add 240 mL (1 cup) of milk (or rice beverage). Then add 1 cup of coconut milk. Add 1 split of vanilla bean seeds or 1 teaspoon of vanilla extract. Finally add 1/2 cup of raw brown sugar.", "evidence": ["Stir in 1 cup (240 ml) of milk or rice beverage, 1 cup (240 ml) of unsweetened low-fat coconut milk, the seeds from 1 split vanilla bean or 1 teaspoon of vanilla extract, and ½ cup (100 g) of raw brown sugar."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Just added everything. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Is your sugar dissolving? You also need to stir it", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I think so. Don't worry, I have been stirring it.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Now you can continue to simmering the pudding on low heat. Keep stirring. You do not want the pudding to stick to the pan. Simmer it for 10-20 minutes.", "evidence": ["Continue to simmer the pudding on low heat. Keep the lid off of the pot and stir it frequently to prevent the pudding from sticking to the pan. Simmer the pudding for another 10 to 20 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wow, 20 minutes seems a lot of work... Guess I'll just buy puddings from a grocery store next time.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Haha yes, but I am sure it tastes better home-cooked!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you lol! What should I do after 20 minutes?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great! Is the pudding creamy and thick? Have a taste! You can add in 1/2 teaspoon of rose water if it is not tasty enough.", "evidence": ["The pudding should look creamy and thick", "you can stir in ½ teaspoon of rose water at this point."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yeah, it's getting pretty thick now - I'm afraid it'll get burnt soon. Are we done here?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Ok turn off the heat! You can now carefully transfer it to a serving bowl once it is cool enough. If you want, you can chill it before serving by refrigerating it for 2 hours. Other serving options include adding some sliced fresh mango. And that's it! Congratulations on making the pudding!", "evidence": ["Turn off the heat and transfer the pudding to a serving bowl. Let it cool slightly before you serve it."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thank you very much for your help!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem! Have a good day!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Make Red Rice Coconut Pudding", "url": "https://www.wikihow.com/Make-Red-Rice-Pudding", "category": ["Food and Entertaining", "Recipes", "Desserts and Sweets", "Puddings"], "procedure": [{"summary": "Heat the red rice, water and salt.", "description": "Measure ¾ cup (134 g) of red Bhutanese rice, 1 ½ cups (360 ml) of water, and ¼ teaspoon of salt into a medium-sized saucepan. Turn the heat on to high and bring the mixture to a boil. You can use any type of red rice, but Bhutanese might be the easiest to find.", "img": "https://www.wikihow.com/images/thumb/b/b5/Make-Red-Rice-Pudding-Step-1.jpg/v4-460px-Make-Red-Rice-Pudding-Step-1.jpg"}, {"summary": "Simmer the rice pudding.", "description": "Turn the heat down to medium-low and put the lid on the pot. Let the pudding boil lightly for 30 minutes. You'll want to simmer the red rice pudding until all of the water is absorbed and the red rice becomes very soft. You may need to adjust the heat so it simmers. If the pudding stops simmering, turn up the heat a little.", "img": "https://www.wikihow.com/images/thumb/5/5d/Make-Red-Rice-Pudding-Step-2.jpg/v4-460px-Make-Red-Rice-Pudding-Step-2.jpg"}, {"summary": "Add the milk, coconut milk, vanilla, and sugar.", "description": "Stir in 1 cup (240 ml) of milk or rice beverage, 1 cup (240 ml) of unsweetened low-fat coconut milk, the seeds from 1 split vanilla bean or 1 teaspoon of vanilla extract, and ½ cup (100 g) of raw brown sugar. The sugar should start to dissolve as you stir it into the pudding. You can use full-fat coconut milk. The pudding will just be richer. Avoid using coconut cream, which doesn't have enough liquid in it for the pudding.", "img": "https://www.wikihow.com/images/thumb/e/e9/Make-Red-Rice-Pudding-Step-3.jpg/v4-460px-Make-Red-Rice-Pudding-Step-3.jpg"}, {"summary": "Finish cooking the pudding.", "description": "Continue to simmer the pudding on low heat. Keep the lid off of the pot and stir it frequently to prevent the pudding from sticking to the pan. Simmer the pudding for another 10 to 20 minutes. The pudding should look creamy and thick. If you want to add additional flavor, you can stir in ½ teaspoon of rose water at this point.", "img": "https://www.wikihow.com/images/thumb/a/aa/Make-Red-Rice-Pudding-Step-4.jpg/v4-460px-Make-Red-Rice-Pudding-Step-4.jpg"}, {"summary": "Cool and serve the red rice coconut milk pudding.", "description": "Turn off the heat and transfer the pudding to a serving bowl. Let it cool slightly before you serve it. You can also chill it before you serve it. Just cover the bowl and refrigerate it for 2 hours. Consider serving the pudding with sliced, fresh mango. You can also transfer the pudding into individual serving dishes. This will help them cool faster.", "img": "https://www.wikihow.com/images/thumb/b/b1/Make-Red-Rice-Pudding-Step-5.jpg/v4-460px-Make-Red-Rice-Pudding-Step-5.jpg"}]}}