{"conversation": [{"text": "Hello. Would you like to learn how to cook a whole fish in Garlic-Chili sauce?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Yes! Let's get started. What should I prepare?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "First, let's get your oven ready", "evidence": ["Preheat the oven to 375 °F (191 °C)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What temperature should I set?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "375 degrees F / 191 degrees C", "evidence": ["Preheat the oven to 375 °F (191 °C)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "It's ready! What' next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Now we are going to mix the garlic-chili sauce. First, pour 4 tbsp oyster sauce, 4 tbsp soy sauce and 1 tbsp fish sauce into a bowl", "evidence": ["mix the garlic-chili sauce.", "Pour 4 tablespoons (59 ml) of oyster sauce into a bow", "4 tablespoons (59 ml) of soy sauce", "1 tablespoon (15 ml) of fish sauce"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks! The mixture is ready now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great! Now, into that same bowl, stir in 8-10 cloves of garlic, 2 tbsp brown sugar, 1/4 tsp black pepper, 1 tbsp lime or lemon juice and 1-3 sliced red chilies/2 tsp thai chili sauce. Stir this until the brown sugar is dissolved", "evidence": ["Stir in 8 to 10 cloves of minced or pressed garlic", "2 tablespoons (25 g) of brown sugar", "1/4 teaspoon (0.5 g) of black pepper", "1 tablespoon (15 ml) of lime or lemon juice", "1 to 3 sliced red chilies or 2 teaspoons of Thai chili sauce", "Stir until the brown sugar is dissolved and set the sauce aside."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "You didn't mention I need brown sugar... Hmmm I don't have it. What replacement can I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Oh no! The recipe does call for brown sugar, but this time perhaps we can try white sugar if you have it; next time we will make sure we have the right ingredients", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sounds good! I do have white sugar. Okay, what's next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Set the sauce aside for now. We will move onto preparing the fish! We are going to use a sharp knife to slice 3 vertical slits onto both sides of a whole fish (Red Snapper or Gray Mullet). If you are using rainbow trout or tilapia, use 2 fish.", "evidence": ["set the sauce aside.", "Slice 3 vertical slits on both sides of a whole fish", "Get out 1 whole red snapper or gray mullet.", "If you're using rainbow trout or tilapia, get out 2 fish since they're smaller", "Use a sharp knife to cut 3 vertical slits on each side of the fish"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Whew! The fish is ready! Then what?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, tear off a large sheet of aluminum foil and lay the fish in the center. Get your sauce you made earlier, and pour at least 3 tablespoons of the garlic-chili sauce over the fish and turn it over so that both sides are coated. (If using 2 smaller fish, spoon 2 tablespoons onto each fish)", "evidence": ["Lay the fish on foil and pour 3 tablespoons (44 ml) of sauce over it."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How many minutes should I bake the fish before turning it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We are not baking just yet! Only pouring the sauce over the fish for now and we will move onto baking in a few steps", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it! Thank you for reminders! Just did what you said.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great work! Now, please bring the sides of the foil together and fold them over the fish tightly - this will make a sealed packet. If you would like to, you can place the packet on top of a baking sheet. Then, place this into the oven.", "evidence": ["Bring the sides of the foil together and fold them over tightly. This should make a sealed packet", "Put the packet of fish in the preheated oven."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Got it! Just to check, it's 375 degrees F right?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, that is correct!", "evidence": ["Preheat the oven to 375 °F"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Cool! What should I do then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "We are going to let the fish bake for 20-25 minutes, and then check the fish to determine if it's completely cooked by removing it from the oven and carefully peeling away the foil. Then, insert a fork into the thickest part of the fish. If it doesn't flake when you do this, close the packet and bake it for another 5-10 minutes before checking again", "evidence": ["Bake the whole fish for 20 to 25 minutes.", "Remove the packet and carefully peel away the foil.", "Insert a fork into the thickest part of the fish to see if it flakes", "If it doesn't, close the packet and bake the fish for another 5 to 10 minutes before checking again."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I'll check it using your method later. Is there something else I need to do before eating it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Once the fish is cooked, take it out of the oven, open the foil carefully and transfer the whole fish to a serving platter. Spoon the remaining sauce over the fish and garnish with slices or wedges of fresh lemon. If you would like a fresh herbal flavour, chop a handful of fresh cilantro or basil and sprinkle it over the fish.", "evidence": ["Open the foil carefully and transfer the whole fish to a serving platter.", "Spoon the remaining garlic-chili sauce over the fish and garnish it with slices or wedges of fresh lemon", "consider chopping a handful of fresh cilantro or basil and sprinkling it over the fish", "Refrigerate the leftover fish in an airtight container for up to 3 to 4 days."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I see. Is this the last step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You are now ready to eat! When you are done, any leftover fish can be placed in an airtight container and will be good to eat for up to 3/4 days!", "evidence": ["Refrigerate the leftover fish in an airtight container for up to 3 to 4 days."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it! Thank you for your help! Bye!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Enjoy your fish! Goodbye!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Cook a Whole Fish in Garlic-Chili Sauce", "url": "https://www.wikihow.com/Bake-a-Whole-Fish", "category": ["Food and Entertaining", "Recipes", "Fish and Seafood"], "procedure": [{"summary": "Preheat the oven to 375 °F (191 °C) and mix the garlic-chili sauce.", "description": "Pour 4 tablespoons (59 ml) of oyster sauce into a bowl along with 4 tablespoons (59 ml) of soy sauce and 1 tablespoon (15 ml) of fish sauce. Stir in 8 to 10 cloves of minced or pressed garlic, 2 tablespoons (25 g) of brown sugar, 1/4 teaspoon (0.5 g) of black pepper, 1 tablespoon (15 ml) of lime or lemon juice, and 1 to 3 sliced red chilies or 2 teaspoons of Thai chili sauce. Stir until the brown sugar is dissolved and set the sauce aside.", "img": "https://www.wikihow.com/images/thumb/a/a6/Bake-a-Whole-Fish-Step-18.jpg/v4-460px-Bake-a-Whole-Fish-Step-18.jpg"}, {"summary": "Slice 3 vertical slits on both sides of a whole fish.", "description": "Get out 1 whole red snapper or gray mullet. If you're using rainbow trout or tilapia, get out 2 fish since they're smaller. Use a sharp knife to cut 3 vertical slits on each side of the fish. The slits will allow the marinade to soak into the flesh of the fish.", "img": "https://www.wikihow.com/images/thumb/5/5b/Bake-a-Whole-Fish-Step-19.jpg/v4-460px-Bake-a-Whole-Fish-Step-19.jpg"}, {"summary": "Lay the fish on foil and pour 3 tablespoons (44 ml) of sauce over it.", "description": "Tear off a large sheet of aluminum foil and lay the fish in the center. Pour at least 3 tablespoons (44 ml) of garlic-chili sauce over the fish and turn it over so both sides are coated. The sauce should get into the slits you cut in the sides of the fish. If you're using 2 smaller fish, spoon about 2 tablespoons (30 ml) onto each fish.", "img": "https://www.wikihow.com/images/thumb/7/75/Bake-a-Whole-Fish-Step-20.jpg/v4-460px-Bake-a-Whole-Fish-Step-20.jpg"}, {"summary": "Seal the foil shut and put the packet directly onto the oven rack.", "description": "Bring the sides of the foil together and fold them over tightly. This should make a sealed packet. Put the packet of fish in the preheated oven. If you're worried that the sauce will leak out of the packet, you can place the packet on a baking sheet.", "img": "https://www.wikihow.com/images/thumb/d/d6/Bake-a-Whole-Fish-Step-21.jpg/v4-460px-Bake-a-Whole-Fish-Step-21.jpg"}, {"summary": "Bake the whole fish for 20 to 25 minutes.", "description": "Then check the fish to determine if it's completely cooked throughout. Remove the packet and carefully peel away the foil. Insert a fork into the thickest part of the fish to see if it flakes. If it doesn't, close the packet and bake the fish for another 5 to 10 minutes before checking again.", "img": "https://www.wikihow.com/images/thumb/4/49/Bake-a-Whole-Fish-Step-22.jpg/v4-460px-Bake-a-Whole-Fish-Step-22.jpg"}, {"summary": "Remove and serve the whole fish with garlic-chili sauce.", "description": "Turn off the oven and take the packet out. Open the foil carefully and transfer the whole fish to a serving platter. Spoon the remaining garlic-chili sauce over the fish and garnish it with slices or wedges of fresh lemon. For a fresh herbal flavor, consider chopping a handful of fresh cilantro or basil and sprinkling it over the fish. Refrigerate the leftover fish in an airtight container for up to 3 to 4 days.", "img": "https://www.wikihow.com/images/thumb/7/76/Bake-a-Whole-Fish-Step-23.jpg/v4-460px-Bake-a-Whole-Fish-Step-23.jpg"}]}}