{"conversation": [{"text": "Hello, you'll be cooking Pinto Beans.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "No problem! What should I prepare?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Firstly place 1 pound of dry pinto beans into a large pot making sure to pick out and discard any beans that are broken. Once you've done this pour in some water covering the beans by 2 inches", "evidence": ["Place 1 pound (0.45 kg) of dry pinto beans into a large pot.", "discard any beans that are broken", "pour in enough water to cover the beans by 2 inches (5.1 cm)."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I just covered beans with the water. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Perfect! Now boil the pot of beans with a lid on it on high heat. Heat them until steam begins to escape. Don't worry you don't need to stir them!", "evidence": ["Put the lid on the pot and turn the burner to high", "until steam starts to escape from under the lid"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Cool! I see the steam escaping now, but the beans haven't become soft yet. What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Don't worry! That's what's meant to happen! Just leave the beans covered and soaking in the water for 1 hour and they should quickly soften and soak.", "evidence": ["They'll swell and soften a little as they quickly soak"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Should I leave the pot on heat while soaking them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, the water has already been brought to a boil so be sure to leave the burner off when soaking.", "evidence": ["Turn off the burner"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it! What's the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Add 1 1/2 teaspoons of salt, making sure it's kosher, to the water and beans. Start stirring it until it looks all dissolved and then turn the burner back on, this time to medium heat, for it to come to a very gentle boil.", "evidence": ["Add 1 1/2 teaspoons (9 g) of kosher salt", "Stir until the salt is dissolved", "turn the burner to medium heat"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Why kosher salt? Is it necessary?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It isn't completely necessary but many people prefer it due to larger grains and no additives which help with clumping.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Interesting. I'll consider it next time when I go grocery shopping. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "I definitely recommend! Next you want to simmer them while the lid is off for 1 to 1 1/2 hours, keeping the lid off and occasionally stirring them. The water should be bubbling gently.", "evidence": ["Simmer the uncovered beans for 1 to 1 1/2 hours", "Keep the lid off of the pot as the water bubbles gently", "Stir the beans occasionally"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay I'll leave the stuff on heat for now. Can you tell me what else to do after that?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Pretty much done now! Just have to turn off the burner and scoop out the beans to use in whatever recipes you like! If you want to use them later you can refrigerate them for 3-5 days, or if you'd prefer to keep them longer they can be freezed for up to 6 months.", "evidence": ["Turn off the burner and scoop out the cooked beans to use in your recipes.", "refrigerate them in an airtight container for up to 3 to 5 days", "freeze the beans for up to 6 months in an airtight container."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thank you for advice!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem. Have a great day!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Cook Pinto Beans Quickly", "url": "https://www.wikihow.com/Cook-Pinto-Beans-Quickly", "category": ["Food and Entertaining", "Recipes", "Rice and Beans"], "procedure": [{"summary": "Put the beans in a pot and pour in water to cover them by 2 in (5 cm).", "description": "Place 1 pound (0.45 kg) of dry pinto beans into a large pot. Pick out and discard any beans that are broken. Then pour in enough water to cover the beans by 2 inches (5.1 cm).", "img": "https://www.wikihow.com/images/thumb/7/71/Cook-Pinto-Beans-Quickly-Step-1-Version-2.jpg/550px-nowatermark-Cook-Pinto-Beans-Quickly-Step-1-Version-2.jpg"}, {"summary": "Bring the covered pot of water to a boil.", "description": "Put the lid on the pot and turn the burner to high. Heat the beans and water until steam starts to escape from under the lid. You don't need to stir the beans as the water comes to a boil.", "img": "https://www.wikihow.com/images/thumb/c/c4/Cook-Pinto-Beans-Quickly-Step-2-Version-2.jpg/550px-nowatermark-Cook-Pinto-Beans-Quickly-Step-2-Version-2.jpg"}, {"summary": "Turn off the burner and let the beans rest for 1 hour.", "description": "Leave the covered beans to soak in the hot water for 1 hour. They'll swell and soften a little as they quickly soak. While you can soak the beans for longer, they only need a brief soaking period since you brought the water to a boil first.", "img": "https://www.wikihow.com/images/thumb/d/d8/Cook-Pinto-Beans-Quickly-Step-3-Version-2.jpg/550px-nowatermark-Cook-Pinto-Beans-Quickly-Step-3-Version-2.jpg"}, {"summary": "Stir in the salt and bring the beans to a boil.", "description": "Add 1 1/2 teaspoons (9 g) of kosher salt to the beans and water. Stir until the salt is dissolved and then turn the burner to medium heat so the water comes to a gentle boil.", "img": "https://www.wikihow.com/images/thumb/e/e3/Cook-Pinto-Beans-Quickly-Step-4-Version-2.jpg/550px-nowatermark-Cook-Pinto-Beans-Quickly-Step-4-Version-2.jpg"}, {"summary": "Simmer the uncovered beans for 1 to 1 1/2 hours.", "description": "Keep the lid off of the pot as the water bubbles gently. Stir the beans occasionally as they cook and some of the water evaporates. The beans should be soft and tender once they've finished cooking. If the water begins to boil, reduce the burner to medium-low. You may need to add more water if the water completely evaporates. The beans should always be submerged as they simmer.", "img": "https://www.wikihow.com/images/thumb/3/36/Cook-Pinto-Beans-Quickly-Step-5-Version-2.jpg/550px-nowatermark-Cook-Pinto-Beans-Quickly-Step-5-Version-2.jpg"}, {"summary": "Add the pintos to your recipes or store them for later.", "description": "Turn off the burner and scoop out the cooked beans to use in your recipes. If you prefer to use them later, refrigerate them in an airtight container for up to 3 to 5 days. You can also freeze the beans for up to 6 months in an airtight container.", "img": "https://www.wikihow.com/images/thumb/e/e4/Cook-Pinto-Beans-Quickly-Step-6-Version-2.jpg/550px-nowatermark-Cook-Pinto-Beans-Quickly-Step-6-Version-2.jpg"}]}}