{"conversation": [{"text": "Hello! Are you ready to start the recipe?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Yes! I want to grill a steak today.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Firstly, we need to prepare some hard-wood coals. Arrange them so more coals are on one side of the grill, so there'll be a warm side and a hot side. Then you can ignite them - they should be easy to light using a newspaper.", "evidence": ["Use hard-wood coals.", "Arrange a sear-side and a warm side by putting the coals to one side of the grill.", "It's easy to light without lighter fluid, so just use a charcoal chimney and some newspaper to get it started."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sorry, what do you mean by \"more coals are on one side of the grill\"?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You must take the coals and move them, such that half the grill has a larger quantity of coals, and the other half has less. This allows you to have two differing heat amounts on your grill, allowing you to cook with more control.", "evidence": ["Arrange a sear-side and a warm side by putting the coals to one side of the grill.", "This means you can cook steaks to a variety of levels of done-ness if necessary, giving you more control."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oh I see. This my first time to grill something, so I just want to make sure everything is on the right track. What's next then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, brush your oil and seasonings on both sides of the steaks, preparing them as you were cooking them any other way. Make sure you bring them to room temperature a bit ahead of time!", "evidence": ["Brush oil and seasoning on both sides of the steaks.", "Prepare the steaks as if you were cooking them in any other way, bringing them to room temperature and seasoning them a bit ahead of time."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What seasonings do you recommend?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Various recipes suggest at least kosher salt and black pepper, though a wide variety of spices can be used. Montreal steak spice is my favourite.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks for suggestions! I'll go with Montreal spice. Shall we move on?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next we must prepare the grill. Once the coals are ready, replace the grill grate and the lid of the grill, giving the grill time to heat up. The coals cook the steak, but the grate gives it that signature crusty grill mark.", "evidence": ["Let the grate heat up and put the steaks on", "Once the coals are ready, replace the grill grate and the lid of the grill, to give it enough time to come up to heat.", "The coals cook the grill, but the grate gives it it's tasty crust and grill-marks."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Interesting, I never knew grill grates play such an important role. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Once the grill is nice and hot, put the steaks on the hot part of the grill, so they sizzle and sear. If your steaks are room temperature, this should be perfect.", "evidence": ["When the grill gets hot and the coals are ready, put the steaks over the hot part of the grill, so they sizzle.", "If your steak is room temperature, like it should be, sear it first."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Got it. I guess I need to turn the meat from time to time.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You shouldn't need to flip the steak until after 4-5 minutes have passed. Once that time has passed, then you can flip to the other side for another five-ish minutes.", "evidence": ["Wait for about 4-5 minutes until you do anything. Nothing bad is going to happen to the steak.", "Flip the steak to the other side and let it sear and cook for another five minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I see. 12 minutes have passed. Can I eat it now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Ideally, you should let the steak rest for 10-15 minutes before slicing and serving it.", "evidence": ["rest it covered for 10-15 minutes before slicing and serving."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I'll wait until it cools then. Is there something else?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Before you let it cool completely, you should check for doneness. Feel free to put the steak on the cooler half of the grill if you'd like it more well done. Then that's it!", "evidence": ["Use your thermometer or your finger to check for doneness", "move the steak to a cooler part of the grill if you want to cook it longer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you for helping me! See you!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I hope this recipe was helpful! Have an excellent day. :)", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Grill a Steak", "url": "https://www.wikihow.com/Make-a-Steak", "category": ["Food and Entertaining", "Recipes", "Meat", "Beef and Lamb", "Steak Dishes"], "procedure": [{"summary": "Use hard-wood coals.", "description": "Sometimes called \"lump charcoal,\" hardwood burns at high temperature for a short amount of time, making it ideal for cooking steaks. It's easy to light without lighter fluid, so just use a charcoal chimney and some newspaper to get it started. Arrange a sear-side and a warm side by putting the coals to one side of the grill. This means you can cook steaks to a variety of levels of done-ness if necessary, giving you more control. If you use a gas grill, turn the flame on medium-high. You'll probably end up having to cook the steaks a little longer on gas, but it'll still be great.", "img": "https://www.wikihow.com/images/thumb/b/bd/Make-a-Steak-Step-15.jpg/v4-460px-Make-a-Steak-Step-15.jpg"}, {"summary": "Brush oil and seasoning on both sides of the steaks.", "description": "Prepare the steaks as if you were cooking them in any other way, bringing them to room temperature and seasoning them a bit ahead of time. Instead of greasing the skillet or the grate, though, you'll brush some cooking oil onto the meat itself. Some people will skip this step, but it's a nice way to get a crust on your meat. Alternatively, some people like to put a dab of butter on the meat, after flipping it.", "img": "https://www.wikihow.com/images/thumb/4/48/Make-a-Steak-Step-16.jpg/v4-460px-Make-a-Steak-Step-16.jpg"}, {"summary": "Let the grate heat up and put the steaks on.", "description": "Once the coals are ready, replace the grill grate and the lid of the grill, to give it enough time to come up to heat. The coals cook the grill, but the grate gives it it's tasty crust and grill-marks. When the grill gets hot and the coals are ready, put the steaks over the hot part of the grill, so they sizzle. Some people prefer cooking the steaks over the cold part of the grill first, then searing at the end. This works fine for cold steaks. If your steak is room temperature, like it should be, sear it first.", "img": "https://www.wikihow.com/images/thumb/5/54/Make-a-Steak-Step-17.jpg/v4-460px-Make-a-Steak-Step-17.jpg"}, {"summary": "Cover the grill and let the meat cook.", "description": "Put the steak on the grill, put the lid on the grill and let the hardwood smoke flavor the meat and cook it. Wait for about 4-5 minutes until you do anything. Nothing bad is going to happen to the steak. Just keep an eye on the timer and let the grill cook the steak. Flip the steak to the other side and let it sear and cook for another five minutes. Depending on your cuts and the temperature of your steak, it should be done after about 10 minutes total. Lot of people like to be hands-on with a nice piece of steak. Some people swear by the \"don't touch it\" method, while others prefer flipping regularly to cook the steak evenly. The truth is that neither method is wrong and they're both great ways to cook steak done properly. Flip it early and often, if you want. You're not at a restaurant and you don't need to rush.", "img": "https://www.wikihow.com/images/thumb/1/12/Make-a-Steak-Step-18.jpg/v4-460px-Make-a-Steak-Step-18.jpg"}, {"summary": "Move the steak to the cooler part of the grill.", "description": "After searing the steak, it should be just about done, if it's not done already. Use your thermometer or your finger to check for doneness and move the steak to a cooler part of the grill if you want to cook it longer. When the steak is done, remove from the heat, put it on a plate, and rest it covered for 10-15 minutes before slicing and serving.", "img": "https://www.wikihow.com/images/thumb/f/f8/Make-a-Steak-Step-19.jpg/v4-460px-Make-a-Steak-Step-19.jpg"}]}}