{"conversation": [{"text": "Hi! Today you'll be learning how to sour milk if you're up for that!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Perfect! What do I do to begin?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Firstly you want to fill a measuring cup with 1 cup of whole milk, minus about 1 or 2 tablespoons. Instead you should add 1 tablespoon of fresh lemon juice or white vinegar, whichever you prefer!", "evidence": ["Fill a measuring cup with 1 cup (237 ml) of whole milk minus 1 to 2 tablespoons (15 to 30 ml).", "add 1 tablespoon (15 ml) of fresh lemon juice or white vinegar to the milk"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I've done that. What shall I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Wonderful. Now use a spoon to mix everything together.", "evidence": ["use a spoon to mix the two together"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long should I stir it for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You want to stir it until it looks like the acid is fully incorporated into the milk. Once that's done you should be ready to move on.", "evidence": ["Be sure to blend them well so the acid is fully incorporated into the milk."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, it looks like it is all fully incorporated together now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That's good. Does it look thick or still like a liquid?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "It's still a liquid, it isn't thick yet.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "That's alright. Leave it for 5 minutes and it should be done!", "evidence": ["allow the mixture to stand at room temperature for 5 to 10 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wonderful! Thank you so much! I will let it rest for 5 minutes.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No worries! You should be left with 1 cup of sour milk but you can alter the amount of each of the ingredients based on your own needs.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Sounds good. Is that all?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, once it's thickened you will have your sour milk. Hope you enjoy it!", "evidence": ["That will give it time to thicken up and curdle slightly so you’ll have sour milk."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ah yes, it has slightly curdled now and has become thicker.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That means it's done! Enjoy!", "evidence": ["That will give it time to thicken up and curdle slightly so you’ll have sour milk."], "id": "Agent", "dialog_act": "other"}, {"text": "Excellent! Thank you so much!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Sour Milk", "url": "https://www.wikihow.com/Sour-Milk", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy"], "procedure": [{"summary": "Pour the acid into the milk.", "description": "Fill a measuring cup with 1 cup (237 ml) of whole milk minus 1 to 2 tablespoons (15 to 30 ml). Next, add 1 tablespoon (15 ml) of fresh lemon juice or white vinegar to the milk. You can substitute 2% milk or heavy cream for the whole milk if you prefer.", "img": "https://www.wikihow.com/images/thumb/2/2b/Sour-Milk-Step-1.jpg/v4-460px-Sour-Milk-Step-1.jpg"}, {"summary": "Stir the acid and milk together well.", "description": "After you’ve added the lemon juice or vinegar to the milk, use a spoon to mix the two together. Be sure to blend them well so the acid is fully incorporated into the milk.", "img": "https://www.wikihow.com/images/thumb/c/c8/Sour-Milk-Step-2.jpg/v4-460px-Sour-Milk-Step-2.jpg"}, {"summary": "Let the milk mixture sit for at least 5 minutes.", "description": "Once the milk and acid have been mixed together completely, allow the mixture to stand at room temperature for 5 to 10 minutes. That will give it time to thicken up and curdle slightly so you’ll have sour milk. The recipe makes 1 cup (237 cup) of sour milk. However, you can easily halve, double, or triple it based on your needs.", "img": "https://www.wikihow.com/images/thumb/f/f6/Sour-Milk-Step-3.jpg/v4-460px-Sour-Milk-Step-3.jpg"}]}}