{"conversation": [{"text": "would you like to know how to freeze scallions?", "evidence": ["Soak the scallions in 5 parts water and 1 part white vinegar, then rinse."], "id": "Agent", "dialog_act": "ask question"}, {"text": "yes please, what is the best way to store them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can freeze scallions until you're ready to cook with them", "evidence": ["Freeze the scallions until you’re ready to cook with them."], "id": "Agent", "dialog_act": "answer question"}, {"text": "okay thank you, how should i store them in the freezer?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "once they are partially frozen, you can transfer them to a resealable freezer bag", "evidence": ["Transfer the scallions into a sealable freezer bag."], "id": "Agent", "dialog_act": "answer question"}, {"text": "and how should i prepare them to be frozen?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "you should first soak them in water and vinegar then give them a rinse", "evidence": ["Soak the scallions in 5 parts water and 1 part white vinegar, then rinse."], "id": "Agent", "dialog_act": "answer question"}, {"text": "how long should i soak them for", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "just a few minutes, once they have soaked rinse them", "evidence": ["Let them soak for a few minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "okay what should i do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "chop them into small equal pieces so they are ready for use", "evidence": ["Chop the scallions into small pieces"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "shall i chop the all of the scallion?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "you should cut of the roots first, do you know which part this is?", "evidence": ["cut off the roots with a sharp knife. The roots are the white parts at the ends of the stalks. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "is it the white part at the end?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "yes that is correct, at the end of the stalks", "evidence": ["The roots are the white parts at the ends of the stalks."], "id": "Agent", "dialog_act": "answer question"}, {"text": "okay, i think i am okay with this now, and how long will they last in the freezer?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "they can last up to about a year", "evidence": ["Frozen scallions can last up to a year in the freezer."], "id": "Agent", "dialog_act": "answer question"}, {"text": "and i can cook them straight from frozen", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "yes, i would reccommend cooking them first as they can lose their crunch otherwise", "evidence": ["To use your frozen scallions, simply remove them from the freezer bag and add them to the dish you’re cooking", "Frozen scallions lose their crunchy texture, so avoid putting them on salads or other recipes without cooking them first."], "id": "Agent", "dialog_act": "answer question"}, {"text": "thank you! i think im all okay now", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Store Scallions", "url": "https://www.wikihow.com/Store-Scallions", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Onions"], "procedure": [{"summary": "Soak the scallions in 5 parts water and 1 part white vinegar, then rinse.", "description": "Washing the scallions before freezing them is especially important if they’re fresh from your garden. Fill a large bowl with the water and vinegar and place the scallions in it. Let them soak for a few minutes before you rinse them off in the sink.", "img": "https://www.wikihow.com/images/thumb/0/0a/Store-Scallions-Step-5.jpg/v4-460px-Store-Scallions-Step-5.jpg"}, {"summary": "Chop the scallions into small pieces.", "description": "That way they’ll be ready to use when you take them out of the freezer. Lay the scallions flat on a cutting board and cut off the roots with a sharp knife. The roots are the white parts at the ends of the stalks. Then, bring the knife from one end of the stalks to the other, making swift cuts through the scallions every .25 inches (0.64 cm) or so.", "img": "https://www.wikihow.com/images/thumb/2/2c/Store-Scallions-Step-6.jpg/v4-460px-Store-Scallions-Step-6.jpg"}, {"summary": "Spread the chopped scallions on a small, lined baking sheet.", "description": "Use a baking sheet that can fit in your freezer. Line it with parchment paper so the scallions don’t stick to the metal. Freezing the scallions on a baking sheet first will prevent them from clumping together in the freezer.", "img": "https://www.wikihow.com/images/thumb/4/4c/Store-Scallions-Step-7.jpg/v4-460px-Store-Scallions-Step-7.jpg"}, {"summary": "Put the baking sheet in the freezer for 3 hours.", "description": "After 3 hours, remove the baking sheet. It’s OK if they’re not completely frozen yet.", "img": "https://www.wikihow.com/images/thumb/3/37/Store-Scallions-Step-8.jpg/v4-460px-Store-Scallions-Step-8.jpg"}, {"summary": "Transfer the scallions into a sealable freezer bag.", "description": "Open the bag and use a spatula to slide the scallion pieces off the baking sheet and into the bag. Once all the scallions are in the bag, use your hands to press excess air out from the bag and then seal it. Write the date on the plastic bag so you know how long the scallions have been frozen for. If you don’t have a sealable freezer bag, put the scallions in an empty water bottle with the cap on instead.", "img": "https://www.wikihow.com/images/thumb/1/1c/Store-Scallions-Step-9.jpg/v4-460px-Store-Scallions-Step-9.jpg"}, {"summary": "Freeze the scallions until you’re ready to cook with them.", "description": "Frozen scallions lose their crunchy texture, so avoid putting them on salads or other recipes without cooking them first. To use your frozen scallions, simply remove them from the freezer bag and add them to the dish you’re cooking. Frozen scallions can last up to a year in the freezer.", "img": "https://www.wikihow.com/images/thumb/e/e1/Store-Scallions-Step-10.jpg/v4-460px-Store-Scallions-Step-10.jpg"}]}}