{"conversation": [{"text": "Hi there! So you're wanting to learn how to properly store Scallions. May I ask what dish you are planning to make with these scallions?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Hello, yes exactly. I'm not one hundred percent sure yet but I like scallions and thought I should learn this.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay great, not a problem. So to start off you will want a jar, preferably a mason jar that you can fill with about 2 inches of water. Depending on how many scallions you have you may need a couple of jars.", "evidence": ["Fill a jar with 2 inches (5.1 cm) of water"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Perfect, i'm way ahead of you there. I made sure to grab a few this morning on my way home from work. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Glad to hear you came prepared. So once you have your jar(s) filled with the right amount of water, you should grab your scallions and ensure you place them inside with the roots submerged in the water.", "evidence": ["Place the scallions standing up in the jar of water"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Understood, thank you. Does it matter how much of the scallions are covered by water? and by root you mean the white part I assume? Just checking.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Good questions. Yes the roots are the white part and if the whole roots don't seem to be submerged you should add water as needed until you can confidently say they are.", "evidence": [" (the white ends of the stalks) should be down in the water", "If the water in the jar doesn't come up all the way to the top of the roots, add more water"], "id": "Agent", "dialog_act": "answer question"}, {"text": "cool, I thought so just wanted to make sure. Is it a problem if the scallions are sticking out the top of the jar because I definitely could not get a lid on.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That is perfectly fine, and I should have mentioned you won't actually need the lids for this method of storage. I would suggest just putting them somewhere you won't lose them for the time being.", "evidence": ["You won’t need the lid to the jar, so set it aside somewhere you won’t lose it.", "The other ends of the scallion stalks should be coming up out of the top of the jar"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Done and done. So what do we do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Assuming you have some plastic ziploc or sandwich bags handy, those will be used on each jar. Just open them up and place them overtop of the stalks. Make sure to pull the bag down enough so it covers the sides of the jar.", "evidence": ["Cover the scallions in the jar with a plastic sandwich bag"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I got the ziploc bags overtop but I don't think mine are big enough since they don't reach the bottom.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Don't worry if the bag doesn't reach the bottom. I just want to confirm do the bags still cover the sides of the jar without pulling it down so much that they damage the stalks?", "evidence": ["It’s OK if the bag doesn’t go all the way to the bottom of the jar."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Woops I may have tried to pull the bags over too much but I think these should be good then if I leave them like I had it originally.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Looks like you're ready for the last step then! All that's left is to place each jar in your refrigerator. These are good to be stored for up to a week for later use.", "evidence": ["Place the jar of scallions in the fridge for up to a week"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Nice, that was easy! So what if I want to store them for longer than a week?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Well this is possible, but most would advice against this as anymore will cause the scallions to lose their crunchy texture, and we certainly wouldn't want to ruin them in this way.", "evidence": ["If you store them any longer, they may lose their crunchy texture"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I definitely prefer my scallions crunchy. Okay, is there anything else I should know to do or avoid doing?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's it. As long as you follow the steps we just talked about, you'll be a scallion storing wizard in no time. Do you have any other questions/concerns?", "evidence": ["When you’re ready to use the scallions, take them out of the fridge and chop the stalks up into small pieces."], "id": "Agent", "dialog_act": "answer question"}, {"text": "In that case I think i'm all good. Thank you very much!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great, it was my pleasure. Have a good one!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "okay great perfect bye now", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Store Scallions", "url": "https://www.wikihow.com/Store-Scallions", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Onions"], "procedure": [{"summary": "Fill a jar with 2 inches (5.1 cm) of water.", "description": "Use a jar that’s large enough around to hold all the scallions you want to store. If you are storing a lot of scallions, you may need to use more than 1 jar. You won’t need the lid to the jar, so set it aside somewhere you won’t lose it.", "img": "https://www.wikihow.com/images/thumb/7/7b/Store-Scallions-Step-1.jpg/v4-460px-Store-Scallions-Step-1.jpg"}, {"summary": "Place the scallions standing up in the jar of water.", "description": "The roots of the scallions (the white ends of the stalks) should be down in the water. The other ends of the scallion stalks should be coming up out of the top of the jar. If the water in the jar doesn't come up all the way to the top of the roots, add more water.", "img": "https://www.wikihow.com/images/thumb/c/ce/Store-Scallions-Step-2.jpg/v4-460px-Store-Scallions-Step-2.jpg"}, {"summary": "Cover the scallions in the jar with a plastic sandwich bag.", "description": "Open the bag and turn it upside down so the open end is facing down. Then, place the bag over the top of the scallions, so the stalks go into the opening in the bag. Pull the bag down all the way so it goes over the sides of the jar. It’s OK if the bag doesn’t go all the way to the bottom of the jar.", "img": "https://www.wikihow.com/images/thumb/9/9b/Store-Scallions-Step-3.jpg/v4-460px-Store-Scallions-Step-3.jpg"}, {"summary": "Place the jar of scallions in the fridge for up to a week.", "description": "If you store them any longer, they may lose their crunchy texture. When you’re ready to use the scallions, take them out of the fridge and chop the stalks up into small pieces.", "img": "https://www.wikihow.com/images/thumb/1/14/Store-Scallions-Step-4.jpg/v4-460px-Store-Scallions-Step-4.jpg"}]}}