{"conversation": [{"text": "Hi! Today you'll be making breadless sandwiches with cucumbers!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Cool! What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Wonderful. Which type of sandwich are you looking to make? An appetizer style sandwich or a sub style tuna sandwich?", "evidence": ["If you are making appetizer sandwiches", " if you want to make a sub style tuna sandwich,"], "id": "Agent", "dialog_act": "ask question"}, {"text": "How are they different?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Appetizer sandwich will give you a greater number of smaller sandwiches, whereas sub style will give you one large sandwich. Whichever you prefer!", "evidence": ["This option will give you a greater number of smaller tuna sandwiches"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sub style please.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Sounds good! Start by cutting the cucumber in half lengthwise, and poke the inside with a fork a bit so it the cucumber absorbs more of the flavour.", "evidence": ["you can halve the cucumbers lengthwise. Then, scoop out the seeds and flesh to make little boats", "Poke the inside a bit with a fork"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Got it! What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great! Next you need to grab a medium sized bowl and whisk together some mustard, vinegar, salt, and black pepper. While doing this slowly start to whisk in some olive oil. Once this is done you can pour it all onto the cucumber.", "evidence": ["In a medium sized bowl, whisk the mustard, vinegar, salt and black pepper", "slowly whisk in the olive oil", "pour the vinaigrette onto the cucumber."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I don't like mustard. Can I skip it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Of course! You can adapt the recipe to tailor it to your preferences at any time!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks! What's next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next we're going to make the tuna filling. Drain the tuna fish and rinse it well with cold water. Leave it to one side while whisking mayonnaise, yogurt, dill, celery leaves, scallions, celery, lemon zest, quarter teaspoon of salt and a pinch of black pepper in a small bowl together. Once this is done go ahead and add the tuna in and mix it all together!", "evidence": ["draining the tuna fish. Rinse it well with cold water, and then put it aside", "In a small bowl, whisk the mayonnaise, yogurt, dill, celery leaves, scallions, celery, lemon zest, quarter teaspoon of salt and a pinch of black pepper.", "Throw the tuna into the bowl and then mix to combine all ingredients."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Do I need to cut tuna fish or simply stir it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If the tuna is not already in smaller pieces then cut it into more manageable pieces.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright then. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Perfect. Finally, all you have to do is fill your cucumber boats with your tuna mixture, add some sprouts if you want, and then add the other half of the cucumber on top to enjoy!", "evidence": ["fill the cucumber boats with the tuna mixture and then add the sprouts. Add the other half of the cucumber on top"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks! Have a good day :)", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem! Have a great day!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Make Breadless Sandwiches with Cucumbers", "url": "https://www.wikihow.com/Make-Breadless-Sandwiches", "category": ["Food and Entertaining", "Recipes", "Sandwiches and Quick Meals"], "procedure": [{"summary": "Prepare the cucumbers.", "description": "You have two options for preparing the cucumbers, which will be used instead of the bread for this tuna sandwich. If you are making appetizer sandwiches, you should simply peel and then slice the cucumber horizontally, into quarter inch slices. This option will give you a greater number of smaller tuna sandwiches. Alternately, if you want to make a sub style tuna sandwich, you can halve the cucumbers lengthwise. Then, scoop out the seeds and flesh to make little boats, where you will put the tuna mix. Poke the inside a bit with a fork, so that the cucumber absorbs more of the flavor.", "img": "https://www.wikihow.com/images/thumb/c/c6/Make-Breadless-Sandwiches-Step-13.jpg/v4-460px-Make-Breadless-Sandwiches-Step-13.jpg"}, {"summary": "Mix the vinaigrette.", "description": "In a medium sized bowl, whisk the mustard, vinegar, salt and black pepper. Then, slowly whisk in the olive oil. Finally, pour the vinaigrette onto the cucumber.", "img": "https://www.wikihow.com/images/thumb/1/14/Make-Breadless-Sandwiches-Step-14.jpg/v4-460px-Make-Breadless-Sandwiches-Step-14.jpg"}, {"summary": "Make the tuna filling.", "description": "Start by draining the tuna fish. Rinse it well with cold water, and then put it aside. In a small bowl, whisk the mayonnaise, yogurt, dill, celery leaves, scallions, celery, lemon zest, quarter teaspoon of salt and a pinch of black pepper. Throw the tuna into the bowl and then mix to combine all ingredients.", "img": "https://www.wikihow.com/images/thumb/d/d4/Make-Breadless-Sandwiches-Step-15.jpg/v4-460px-Make-Breadless-Sandwiches-Step-15.jpg"}, {"summary": "Put together the sandwiches.", "description": "If you are making the appetizer version, place a dollop of tuna mix and then a few sprouts on top of each slice of cucumber. Then, add another slice on top for a cute little sandwich. If you are making the sub style tuna sandwich, fill the cucumber boats with the tuna mixture and then add the sprouts. Add the other half of the cucumber on top. Eat and enjoy!", "img": "https://www.wikihow.com/images/thumb/4/45/Make-Breadless-Sandwiches-Step-16.jpg/v4-460px-Make-Breadless-Sandwiches-Step-16.jpg"}]}}