{"conversation": [{"text": "Hi, want to learn to cook some weisswurst with beer?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Sure! What should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You're going to want to grab the following ingredients, 1 pound (453 g) weisswurst sausage 1 tablespoon (15 ml) vegetable oil 2 onions 3 cups (450 g) well-drained sauerkraut 2 cups (473 ml) beer 2 granny smith apples Freshly grated nutmeg to taste Salt and pepper to taste", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Everything is ready. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "once the oil is up to temp, carefully place in the weisswurst in the skillet", "evidence": ["Pour 1 tablespoon (15 ml) of vegetable oil into a large, heavy skillet and turn the heat to medium-high."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Should I use medium-heat?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "medium-high, you're going to want to get them nice and golden before finishing in the oven", "evidence": ["medium-high"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it! What's the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "peel and finely slice the onions", "evidence": ["Peel 2 onions and use a sharp knife to slice them thinly"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What else should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "grab the sauerkraut, then empty it into a mesh strainer over the sink to drain out the juce. give it a good press to make sure theres not too much juice", "evidence": ["3 cups (450 g) of sauerkraut and place it in a fine mesh strainer over a sink."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I don't have sauerkraut. Can I use something else or is it necessary?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "do you have any kimchi or other type of fermented cabbage?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Let me check... Yeah, I have kimchi!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "great! it will taste a little different but it can be swapped just the same. same step as the sauerkraut though, you're gonna want to drain it so it's dry. it's going in the skillet", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Guess I can add vinegar to make it taste like sauerkraut lol. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "dont worry about the vinegar, its the fermentation that adds the taste", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I see. Shall we move on?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "drain the oil from the weisswurst into a non plastic container (not down the drain either) and make sure the wurst are spread evenly in the skillet afterward", "evidence": ["arefully drain and discard any of the hot grease in the skillet."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Why do I need to pour the oil into the container? Do I need to use that later?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "no, it's just easier to bin once it's re-solidified. in plastic it will melt on your countertops. and can clog your drain if you dump it there. pop the puck un the bin once its set for easy clean up", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "That makes sense. Let's move on! I have wurst in the pan now.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "spread the onions and kimchi over the wurst evenly in the skillet, and add the beer on top", "evidence": ["Spread the sliced onions and drained sauerkraut evenly over the weisswurst"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Just did that. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "turn the heat down to medium and pop the lid on. the wurst should take 15-20 minutes to cook", "evidence": ["Put a lid on the skillet and turn the heat to medium"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wait, I was using medium heat. Is there something wrong?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "as long as the wurst are golden before adding the onions etc you'll be good", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Whew! Thanks. I have cooked for 16 minutes. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "core and slice your apples into slices approx 1cm thick", "evidence": ["Use an apple corer to remove the cores from 2 granny smith apples. Slice the apples into 1-cm thick slices "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Easy! What's next then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "pop them in the skillet with the wurst and sprinkle some nutmeg, salt and pepper to your own tastes", "evidence": [" add them to the skillet with the sausages. You should also sprinkle the dish with freshly ground nutmeg, salt, and pepper, to taste."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Finished. Next step please.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "pop the lid back on, and in about 2 minutes, when they've softened a bit, you're ready to plate up and enjoy!", "evidence": ["Put the lid back on the skillet and cook the mixture over medium heat until the apples soften a little. This should take 2 minutes."], "id": "Agent", "dialog_act": "teach new step"}], "recipe": {"title": "How to Pan-Fry Weisswurst with Beer", "url": "https://www.wikihow.com/Cook-Weisswurst", "category": ["Food and Entertaining", "Recipes", "Meat", "Sausage"], "procedure": [{"summary": "Sauté the weisswurst for 2 to 4 minutes.", "description": "Pour 1 tablespoon (15 ml) of vegetable oil into a large, heavy skillet and turn the heat to medium-high. Place 1 pound (453 g) of weisswurst in a single layer in the skillet. Sauté and turn the sausages frequently until they're golden brown on the outside. This should take 2 to 4 minutes. Use a skillet that's at least 12-inches (30 cm) in diameter. Avoid over cooking the weisswurst since they'll finish cooking in the oven.", "img": "https://www.wikihow.com/images/thumb/5/58/Cook-Weisswurst-Step-9.jpg/v4-459px-Cook-Weisswurst-Step-9.jpg"}, {"summary": "Slice the onions and drain the sauerkraut.", "description": "Peel 2 onions and use a sharp knife to slice them thinly. Get out 3 cups (450 g) of sauerkraut and place it in a fine mesh strainer over a sink. Press against the sauerkraut so the liquid drains out of the sauerkraut.", "img": "https://www.wikihow.com/images/thumb/d/d2/Cook-Weisswurst-Step-10.jpg/v4-459px-Cook-Weisswurst-Step-10.jpg"}, {"summary": "Combine the weisswurst, onions, sauerkraut, and beer in the skillet.", "description": "Carefully drain and discard any of the hot grease in the skillet. The sausages should still be in a single layer in the skillet. Spread the sliced onions and drained sauerkraut evenly over the weisswurst. Pour 2 cups (473 ml) of beer over the mixture. You can use any wheat or Bavarian-style beer.", "img": "https://www.wikihow.com/images/thumb/c/ce/Cook-Weisswurst-Step-11.jpg/v4-459px-Cook-Weisswurst-Step-11.jpg"}, {"summary": "Cook the weisswurst for 15 to 20 minutes.", "description": "Put a lid on the skillet and turn the heat to medium. Let the weisswurst, onions, and sauerkraut cook until the sausages are cooked throughout and the onions soften. This should take 15 to 20 minutes. If you don't have a lid for your skillet, consider laying a baking sheet down over the skillet.", "img": "https://www.wikihow.com/images/thumb/8/81/Cook-Weisswurst-Step-12.jpg/v4-460px-Cook-Weisswurst-Step-12.jpg"}, {"summary": "Add sliced apples and season the dish.", "description": "Use an apple corer to remove the cores from 2 granny smith apples. Slice the apples into 1-cm thick slices and add them to the skillet with the sausages. You should also sprinkle the dish with freshly ground nutmeg, salt, and pepper, to taste.", "img": "https://www.wikihow.com/images/thumb/9/93/Cook-Weisswurst-Step-13.jpg/v4-459px-Cook-Weisswurst-Step-13.jpg"}, {"summary": "Cover and cook the dish for 2 more minutes.", "description": "Put the lid back on the skillet and cook the mixture over medium heat until the apples soften a little. This should take 2 minutes. Turn off the heat and serve the cooked weisswurst, onions, sauerkraut, and apples while they're hot. You can store this dish in an airtight container in the refrigerator for 3 to 4 days.", "img": "https://www.wikihow.com/images/thumb/4/47/Cook-Weisswurst-Step-14.jpg/v4-459px-Cook-Weisswurst-Step-14.jpg"}]}}