{"conversation": [{"text": "Hello, are you ready to begin making your very own Cocktail sauce?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Absolutely! I love cocktail sauce!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Sounds good. Let's start by grabbing a small bowl. Our first ingredients will be ketchup(3/4 cup), lemon juice(2 tbsp), and worcestershire sauce(1 tbsp). We will be mixing all the ingredients together in the bowl. Will you be using fresh lemon or storebought lemon juice?", "evidence": ["Use ¾ cup (176 grams) of ketchup, 2 tbsp (28.7 grams) of fresh lemon juice, and 1 US tbsp (0.50 fl oz) of Worcestershire sauce.", " An easy way to get fresh lemon juice is to slice a lemon in half and squeeze the juice into a small dish.", "You can also buy lemon juice at any local grocery store."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I prefer lemon juice - I happen to have some here lol.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Very well! Now let's grate some horseradish. Finely grate 2 cups of horseradish and add it in the mixing bowl. If you are using prepared horseradish then use 3 cups. Stir the mixture a couple times to combine the ingredients.", "evidence": ["Grate fresh horseradish and add it to the mixing bowl.", "Finely grate the horseradish until you have ⁄2 cup (4.0 fl oz) before adding it to the ketchup. ", "You can also use prepared horseradish. In that case, add ⁄3 cup (5.3 fl oz) instead.", "Stir the mixture once or twice to combine the ingredients. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Just did that. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Before we move on, just a quick question; do you like spicy food?", "evidence": ["you can add a dash of hot sauce."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, definitely! Why do you ask?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I ask because if you'd like you can add a dash of hot sauce to the cocktail sauce to add a bit of spice. Anyways, in our next step we will ad about 1/4 tsp of ground black pepper and lightly stir the sauce. You don't need to stir too much, we just need to mix the ingredients. And as I said, feel free to add some hot sauce!", "evidence": ["Use about ¼ tsp (1.4 grams) of ground black pepper.", "You don’t need to stir the sauce too much, just enough to mix all of the ingredients together. ", "You don’t need to stir the sauce too much, just enough to mix all of the ingredients together. ", "you can add a dash of hot sauce"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks for your advice! I'll add hot sauce. What should I do then?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, our sauce is nearly complete. Put the bowl uncovered in the fridge and chill for one hour. If you are in a rush, you can chill it for less time but it's optimal to chill for an hour to maximize flavour.", "evidence": ["Chill your sauce for 1 hour before you serve it.", " and place it in the refrigerator, uncovered", "If you’re in a rush, you can chill your cocktail sauce for a shorter amount of time or not at all, but it may not taste as good."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Cool! Thanks for your help!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem. If you have any leftover sauce, you can store it in an airtight container for up to a month. If you want to store it longer, you can freeze it for up to a year. And that's all for today, thank you very much for your time and I hope you enjoyed the recipe!", "evidence": ["Store any leftover cocktail sauce in the refrigerator for up to a month", "Seal your cocktail sauce in an airtight container if you plan to store it", "To keep your homemade sauce longer, pop it in the freezer, and it’ll keep up to a year"], "id": "Agent", "dialog_act": "teach new step"}], "recipe": {"title": "How to Make Cocktail Sauce", "url": "https://www.wikihow.com/Make-Cocktail-Sauce", "category": ["Food and Entertaining", "Recipes", "Fish and Seafood"], "procedure": [{"summary": "Mix ketchup, lemon juice, and Worcestershire sauce together in a small bowl.", "description": "Use ¾ cup (176 grams) of ketchup, 2 tbsp (28.7 grams) of fresh lemon juice, and 1 US tbsp (0.50  fl oz) of Worcestershire sauce. This recipe should make around 1 ½ cups (337 grams) of cocktail sauce so don’t choose too large of a bowl. An easy way to get fresh lemon juice is to slice a lemon in half and squeeze the juice into a small dish. If you are squeezing out your own lemon juice, you may opt to use a lemon squeezer, which will also help keep any seeds from getting into the juice. Make sure you remove any lemon seeds before putting the juice into the mixing bowl. You can also buy lemon juice at any local grocery store.", "img": "https://www.wikihow.com/images/thumb/b/bb/Make-Cocktail-Sauce-Step-1-Version-4.jpg/550px-nowatermark-Make-Cocktail-Sauce-Step-1-Version-4.jpg"}, {"summary": "Grate fresh horseradish and add it to the mixing bowl.", "description": "Finely grate the horseradish until you have ⁄2 cup (4.0  fl oz) before adding it to the ketchup. Stir the mixture once or twice to combine the ingredients. You can also use prepared horseradish. In that case, add ⁄3 cup (5.3  fl oz) instead.", "img": "https://www.wikihow.com/images/thumb/4/42/Make-Cocktail-Sauce-Step-2-Version-4.jpg/550px-nowatermark-Make-Cocktail-Sauce-Step-2-Version-4.jpg"}, {"summary": "Sprinkle pepper into the mixing bowl and stir the sauce.", "description": "Use about ¼ tsp (1.4 grams) of ground black pepper. You don’t need to stir the sauce too much, just enough to mix all of the ingredients together. To add a bit of spice, you can add a dash of hot sauce.", "img": "https://www.wikihow.com/images/thumb/d/d9/Make-Cocktail-Sauce-Step-3-Version-4.jpg/550px-nowatermark-Make-Cocktail-Sauce-Step-3-Version-4.jpg"}, {"summary": "Chill your sauce for 1 hour before you serve it.", "description": "You can keep your sauce in the same bowl you made it in and place it in the refrigerator, uncovered. If you’re in a rush, you can chill your cocktail sauce for a shorter amount of time or not at all, but it may not taste as good.", "img": "https://www.wikihow.com/images/thumb/c/c3/Make-Cocktail-Sauce-Step-4-Version-2.jpg/550px-nowatermark-Make-Cocktail-Sauce-Step-4-Version-2.jpg"}, {"summary": "Store any leftover cocktail sauce in the refrigerator for up to a month.", "description": "Seal your cocktail sauce in an airtight container if you plan to store it. To keep your homemade sauce longer, pop it in the freezer, and it’ll keep up to a year.", "img": "https://www.wikihow.com/images/thumb/5/50/Make-Cocktail-Sauce-Step-5-Version-2.jpg/550px-nowatermark-Make-Cocktail-Sauce-Step-5-Version-2.jpg"}]}}