{"conversation": [{"text": "Hi there! Would you be interested in cooking a Bavarian-Style SImmered Weisswurst?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Sure! How to make it?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Go ahead and grab a pot. Place the pot on your stove, and fill the pot up until the halfway point. Add many pinches of salt, then turn up the stove heat to high. The size of your pot should be roughly 2 liters or 2 quarts.", "evidence": ["Set a pot on the stove and fill it at least half full with water. Add several generous pinches of salt and turn the heat to high."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have finished that. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Go ahead and gently place the weisswurst in the pot. If you don't know what a weisswurst is, just let me know. After you've placed it in the pot, reduce the heat to low. The water shouldn't be bubbling too much.", "evidence": ["Add the weisswurst and reduce the heat."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is weisswurst just sausage?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! A weisswurst is a sausage made up of pork and veal. It is a popular Bavarian traditional food.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Interesting. Okay I am boiling the sausage. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Let the weisswurst simmer for roughly 10 minutes. Make sure to keep the lid off the pot. If you want, you can check the temperature with a meat thermometer to check the temperature of the weisswurst. If the temperature is 170F or 77C, the sausage should be ready.", "evidence": ["Keep the lid off of the pot and simmer the sausages until they're completely warmed throughout. This should take 10 minutes", "insert a meat thermometer to check the temperature. The weisswurst should reach 170 °F (77 °C)."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Got it! What's next please?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now you're done! Turn off the heat completely and scoop the sausage from the pot. Place the sausage(s) into a bowl. You can serve it with mustard, beer or even a pretzel!", "evidence": ["Turn off the heat and scoop the cooked sausages to a large serving bowl.", "Let guests help themselves to the weisswurst and serve it with sweet mustard, a large pretzel, and a Bavarian beer.", "Or to eat them traditionally, trim off the end of the weisswurst and suck the sausage out of the casing."], "id": "Agent", "dialog_act": "teach new step"}], "recipe": {"title": "How to Cook Bavarian-Style Simmered Weisswurst", "url": "https://www.wikihow.com/Cook-Weisswurst", "category": ["Food and Entertaining", "Recipes", "Meat", "Sausage"], "procedure": [{"summary": "Bring salted water to a boil.", "description": "Set a pot on the stove and fill it at least half full with water. Add several generous pinches of salt and turn the heat to high. Heat the water until it comes to a boil. The pot should be at least 2-quarts (1.89 liters) in size.", "img": "https://www.wikihow.com/images/thumb/1/1d/Cook-Weisswurst-Step-1.jpg/v4-459px-Cook-Weisswurst-Step-1.jpg"}, {"summary": "Add the weisswurst and reduce the heat.", "description": "Turn the heat down to low and slowly lower as many weisswurst links as you want into the water. The water should be bubbling gently.", "img": "https://www.wikihow.com/images/thumb/3/3c/Cook-Weisswurst-Step-2.jpg/v4-459px-Cook-Weisswurst-Step-2.jpg"}, {"summary": "Simmer the weisswurst for 10 minutes.", "description": "Keep the lid off of the pot and simmer the sausages until they're completely warmed throughout. This should take 10 minutes. Although many people don't like to poke the sausages, you can insert a meat thermometer to check the temperature. The weisswurst should reach 170 °F (77 °C).", "img": "https://www.wikihow.com/images/thumb/e/ec/Cook-Weisswurst-Step-3.jpg/v4-459px-Cook-Weisswurst-Step-3.jpg"}, {"summary": "Remove and serve the classic Bavarian weisswurst.", "description": "Turn off the heat and scoop the cooked sausages to a large serving bowl. Spoon some of the salted water from the pot into the bowl with the sausages. Let guests help themselves to the weisswurst and serve it with sweet mustard, a large pretzel, and a Bavarian beer.You can slit and peel off the casings from the weisswurst. Or to eat them traditionally, trim off the end of the weisswurst and suck the sausage out of the casing.", "img": null}]}}