{"conversation": [{"text": "Hi! Today you'll be cooking peppers.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Ooh, sounds delicious. What should I do to get started?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "They're great! Firstly you're going to need to prepare a baking sheet by lining it with aluminum foil. If using large bell peppers preheat an over to 425 degrees F, while if using smaller peppers preheat a broiler for 5-10 mins on high.", "evidence": ["Preheat the oven or broiler", "oven preheated to 425 degrees", "smaller peppers should be roasted in broiler that has been preheated for 5 to 10 minutes", "smaller peppers should be roasted in broiler that has been preheated for 5 to 10 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I've got some large bell peppers at home, so I'll be using those. I just preheated the oven and prepped the baking sheet. What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Sounds good! As you're using large bell peppers, cut them into halves or quarters depending on what you want to speed up the cooking process. Place them cut-side-down on the baking sheet.", "evidence": [" Large peppers, like bell peppers, can be cut in halves or quarters to speed up the cooking", "Place cut peppers on the prepared baking sheet cut-side-down."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I cut them into quarters. Should I keep the seeds inside the peppers, or should I remove them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Most people don't enjoy the taste of the seeds so go ahead and remove them if you wish.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alrighty, I scooped out the seeds. What's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Wonderful. To make sure the peppers don't stick to the foil or pan when removing, you'll want to go ahead and either spray cooking spray over the surface of each pepper, or if you'd prefer to you can brush a little olive oil on the skins.", "evidence": ["Spray cooking spray over the surface of each pepper or brush a little olive oil on the skins", "helps with making sure that the peppers don't stick to the foil or the pan when you're ready to remove them."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I went ahead and brushed a bit of olive oil on the skin of the pepper quarters. What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "As you're using larger bell peppers, go ahead and roast them in the oven that you preheated for 20-25 minutes. You'll want to turn them periodically so that the sins become evenly charred. You'll know once they're done when the skins are all dark and bubbly.", "evidence": ["bell peppers should be roasted in your preheated oven for 20 to 25 minutes", "Turn the peppers periodically so that the skins become evenly charred on all sides. When ready, the skins should be dark and bubbly."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Just put them in the oven now. Is there any tool I should use to turn the peppers periodically?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Feel free to use whatever tool you'd like! A simple pair of tongs or a wooden spoon would be perfect but you can use whatever you prefer!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Tongs sound perfect, thank you - the pepper skin seems to have darkened and bubbled up now. What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "All you have to do now is wrap them in aluminum foil for 10-15 minutes, or until they're cool enough to touch. After that peel the skins off using your fingers and enjoy them however you wish!", "evidence": ["Wrap the peppers in aluminum foil for 10 to 15 minutes, or until they become cool enough to handle with your bare hands", "Before serving, peel the skins off the peppers using your fingers"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "They seem relatively cool now. I peeled off the skin and added some salt, pepper and homemade romesco sauce. Thank you! This looks phenomenal!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem! Hope you enjoy them!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thanks for walking me through this. Have a great day.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Thank you, you too!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Cook Peppers", "url": "https://www.wikihow.com/Cook-Peppers", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables"], "procedure": [{"summary": "Preheat the oven or broiler.", "description": "You can bake or broil any variety of pepper, but usually, large bell peppers should be roasted in an oven preheated to 425 degrees Fahrenheit (218 degrees Celsius) while smaller peppers should be roasted in broiler that has been preheated for 5 to 10 minutes. Either way, prepare a baking sheet by lining it with aluminum foil. If you are using a broiler with separate “high” and “low” settings, preheat it to “high.”", "img": "https://www.wikihow.com/images/thumb/5/57/Cook-Peppers-Step-1-Version-3.jpg/v4-460px-Cook-Peppers-Step-1-Version-3.jpg"}, {"summary": "Cut the peppers or leave them whole.", "description": "Small peppers should be left whole. Large peppers, like bell peppers, can be cut in halves or quarters to speed up the cooking process. Place cut peppers on the prepared baking sheet cut-side-down.", "img": "https://www.wikihow.com/images/thumb/4/4b/Cook-Peppers-Step-2-Version-3.jpg/v4-460px-Cook-Peppers-Step-2-Version-3.jpg"}, {"summary": "Coat the peppers with cooking spray.", "description": "Spray cooking spray over the surface of each pepper or brush a little olive oil on the skins. Cooking spray or oil helps with making sure that the peppers don't stick to the foil or the pan when you're ready to remove them.", "img": "https://www.wikihow.com/images/thumb/6/63/Cook-Peppers-Step-3-Version-3.jpg/v4-460px-Cook-Peppers-Step-3-Version-3.jpg"}, {"summary": "Cook the peppers until roasted.", "description": "The exact amount of time will vary based on size and cooking method, but usually, bell peppers should be roasted in your preheated oven for 20 to 25 minutes while smaller hot peppers should be broiled for 5 to 10 minutes per side. Turn the peppers periodically so that the skins become evenly charred on all sides. When ready, the skins should be dark and bubbly.", "img": "https://www.wikihow.com/images/thumb/4/47/Cook-Peppers-Step-4-Version-3.jpg/550px-nowatermark-Cook-Peppers-Step-4-Version-3.jpg"}, {"summary": "Serve warm.", "description": "Wrap the peppers in aluminum foil for 10 to 15 minutes, or until they become cool enough to handle with your bare hands. At that point, unwrap them and use or enjoy as desired. Before serving, peel the skins off the peppers using your fingers. If you allowed them the steam inside of foil while they cooled, the skins should slip off with relative ease.", "img": "https://www.wikihow.com/images/thumb/b/b7/Cook-Peppers-Step-5-Version-3.jpg/v4-460px-Cook-Peppers-Step-5-Version-3.jpg"}]}}