{"conversation": [{"text": "Hi there! Would you be interested in making cream cheese frosting for your cupcakes?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Hi! I would love to!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Awesome! To start off, grab a medium bowl and a mixer. Place butter, cream cheese and sugar in the bowl until it becomes fluffy and light. This should take around 2 minutes. You may notice some excess ingredients on the side of the bowl too, make sure to scrape that down occasionally.", "evidence": ["Place them in a medium bowl and use a mixer to cream the butter, cream cheese and sugar until the mixture becomes light and fluffy, about two minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sounds good. Does it matter what type of sugar I use?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I would highly suggest using 2 cups powdered sugar.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "I'll do that then - what should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Go ahead and add 1 teaspoon of vanilla extract into your mix. Use your mixer to thoroughly mix in the extract. If you'd like, you can take a sample of the frosting and taste it to see if you'd like to add a little more vanilla extract.", "evidence": ["Add the vanilla to the bowl and mix it in thoroughly with your electric mixer."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What colour should it look like?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The mixture should be a light yellow color.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ah that's good, that's what mine looks like right now! What's the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Take a whisk and beat the mixture for roughly 3 minutes. Do this until the mixture reaches a somewhat stiff state. If the mixture is far too thick, you can add 1 tablespoon of heavy cream. If it's far too runny, add a quarter cup of sugar.", "evidence": ["Keep beating until the frosting is slightly stiff. If the frosting seems too thick, add a tablespoon of heavy cream and keep beating"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Same sugar as before?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, powdered sugar will suffice.", "evidence": ["1/4 cup of powdered sugar"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I've gone ahead and done that and it seems to be in a perfect state now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great! The mixture should be ready. You can now use this frosting with any cupcakes you have at home. Some classics include chocolate cupcakes, spice cupcakes and red velvet cupcakes. You can spread the frosting with a knife or frosting pipe. Be sure to let the cupcakes cool before you frost them so the frosting doesn't melt off.", "evidence": ["Cream cheese is classically paired with red velvet, chocolate or spice cupcakes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'll be looking forward to seeing how it tastes! Is that all?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! I hope you enjoy the frosting paired with the cupcakes. :)", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you! Have a great day!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You too!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Make Cream Cheese Frosting for Cupcakes", "url": "https://www.wikihow.com/Make-Cupcake-Frosting", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes", "Cupcakes"], "procedure": [{"summary": "Cream the butter, cream cheese and sugar.", "description": "Place them in a medium bowl and use a mixer to cream the butter, cream cheese and sugar until the mixture becomes light and fluffy, about two minutes. Scrape down the sides of the bowl every once in a while to make sure everything gets mixed in.", "img": "https://www.wikihow.com/images/thumb/4/41/Make-Cupcake-Frosting-Step-5-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-5-Version-2.jpg"}, {"summary": "Mix in the vanilla extract.", "description": "Add the vanilla  to the bowl and mix it in thoroughly with your electric mixer. Taste the frosting and add a little more vanilla if you'd like.", "img": "https://www.wikihow.com/images/thumb/3/3b/Make-Cupcake-Frosting-Step-6-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-6-Version-2.jpg"}, {"summary": "Beat the mixture for three minutes.", "description": "This will help you achieve the right light, fluffy, spreadable texture you want for your cupcake frosting. Keep beating until the frosting is slightly stiff. If the frosting seems too thick, add a tablespoon of heavy cream and keep beating. If it seems too runny, add another 1/4 cup of powdered sugar and keep beating.", "img": "https://www.wikihow.com/images/thumb/c/ca/Make-Cupcake-Frosting-Step-7-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-7-Version-2.jpg"}, {"summary": "Frost your cupcakes.", "description": "Cream cheese is classically paired with  red velvet,  chocolate or  spice cupcakes. You can spread it on with a knife or pipe it on in swirls, and it will hold its shape until you're ready to eat the cupcakes. Make sure you wait until the cupcakes are completely cool before you frost them; otherwise, the frosting will melt and slide off. Store extra frosting in the refrigerator for up to three days.", "img": "https://www.wikihow.com/images/thumb/7/7b/Make-Cupcake-Frosting-Step-8-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-8-Version-2.jpg"}]}}