{"conversation": [{"text": "Hi there! Would you like to make peanut butter frosting this time?", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "That sounds delicious, I would love to!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "To get started, grab a medium bowl and a mixer! Place 1 cup of creamy peanut butter, 1 cup of powdered sugar and 5 tablespoons of unsalted butter. Mix it together until it becomes fluffy", "evidence": ["Place them in a medium bowl and use a mixer to cream the butter, peanut butter and sugar until the mixture becomes light and fluffy, about two minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I only have salted butter, will that work?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, salted butter will work fine too.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you, I'll use that then. What to do after it's fluffy?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Go ahead and add 1/2 teaspoon of vanilla extract and 1/3 cup heavy cream into the medium bowl. Mix them using the electric mixer.", "evidence": ["Add the vanilla and cream to the bowl and mix them in thoroughly with your electric mixer."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long should I mix for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can mix for about 1 minute, or until the extract and cream have fully mixed with the other ingredients.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright, done! It's started to smell quite nice!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That's a good sign! You should now use a whisk to beat the mixture for roughly 3 minutes to ensure the frosting is fluffy and light.", "evidence": ["Keep beating until the frosting is slightly stiff. If the frosting seems too thick, add another tablespoon of cream and keep beating. If it seems too runny, add another 1/4 cup of powdered sugar"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is there anything I should add if it remains quite stiff, or should I just keep whisking it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can add another tablespoon of cream, then continue whisking.", "evidence": ["If the frosting seems too thick, add another tablespoon of cream and keep beating."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alrighty, done! It's looking more fluffy now", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Phenomenal! The frosting should be good now. Before we move onto the frosting step, what color is your frosting? It should be a light-ish brown.", "evidence": [], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes that sounds about right, mine is looking the same", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great! Now, you can spread the frosting onto your cupcakes. You might have vanilla, peanut butter or chocolate cupcakes available. Either way, it should taste good! Ensure that the cupcakes are cool before you place the frosting on them though. If the cupcakes are hot, the frosting will melt.", "evidence": ["Peanut butter frosting is classically paired with peanut butter, chocolate or vanilla cupcakes. You can spread it on with a knife or pipe it on in swirls, and it will hold its shape until you're ready to eat the cupcakes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great! I'll wait until they cool and then put them all, thank you!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No worries, I hope you enjoy the cupcakes and frosting!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you, have a great day!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "(I can't seem to end it. If you can't either, I suppose we can close the tab now.)", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "(me neither, i'll just close the tab)", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Peanut Butter Frosting for Cupcakes", "url": "https://www.wikihow.com/Make-Cupcake-Frosting", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes", "Cupcakes"], "procedure": [{"summary": "Cream the butter, peanut butter and sugar.", "description": "Place them in a medium bowl and use a mixer to cream the butter, peanut butter and sugar until the mixture becomes light and fluffy, about two minutes. Scrape down the sides of the bowl every once in a while to make sure everything gets mixed in.", "img": "https://www.wikihow.com/images/thumb/d/d1/Make-Cupcake-Frosting-Step-9-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-9-Version-2.jpg"}, {"summary": "Mix in the vanilla and cream.", "description": "Add the vanilla and cream to the bowl and mix them in thoroughly with your electric mixer.", "img": "https://www.wikihow.com/images/thumb/a/a2/Make-Cupcake-Frosting-Step-10-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-10-Version-2.jpg"}, {"summary": "Beat the mixture for three minutes.", "description": "This will help you achieve the right light, fluffy, spreadable texture you want for your cupcake frosting. Keep beating until the frosting is slightly stiff. If the frosting seems too thick, add another tablespoon of cream and keep beating. If it seems too runny, add another 1/4 cup of powdered sugar and keep beating.", "img": "https://www.wikihow.com/images/thumb/8/88/Make-Cupcake-Frosting-Step-11-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-11-Version-2.jpg"}, {"summary": "Frost your cupcakes.", "description": "Peanut butter frosting is classically paired with peanut butter, chocolate or  vanilla cupcakes. You can spread it on with a knife or pipe it on in swirls, and it will hold its shape until you're ready to eat the cupcakes. Make sure you wait until the cupcakes are completely cool before you frost them; otherwise, the frosting will melt and slide off. Store extra frosting in the refrigerator for up to three days.", "img": "https://www.wikihow.com/images/thumb/9/9f/Make-Cupcake-Frosting-Step-12-Version-2.jpg/550px-nowatermark-Make-Cupcake-Frosting-Step-12-Version-2.jpg"}]}}