{"conversation": [{"text": "Hello, today we are going to be learning how to steam-fry dumplings. I hope you are excited as I am, are you ready to begin?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, absolutely!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Perfect! Before we begin, it's important to make sure your dumplings aren't completely frozen. So let's take out the dumplings and have them sit at room temperature for about 15 minutes while we prepare the pan. Have you taken out the frozen dumplings?", "evidence": ["Before arranging them onto the pan, you should make sure the dumplings aren't completely frozen", "Simply let them sit at room temperature for 15 minutes before you start to prepare them"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes, I have.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Awesome! While your dumplings are thawing a bit, let's begin by heating oil in a nonstick pan. It's best to use a larger sized pan, as we will need to have the dumplings arranged neatly to cook. So let's add 2 tablespoons of oil over moderate heat. Feel free to use any kind of oil that you prefer! Vegetable oil and corn oil work fine but any oil you that you usually use works fine as well!", "evidence": ["Use a large pan since you'll need to arrange the dumplings neatly", " Adding 2 tablespoons (30 mL) of vegetable oil to the pan ", "Heat oil in a nonstick pan", " Heat the oil over moderate heat to avoid burning the dumplings", "you don't need to limit yourself to vegetable oil. You can use corn oil as well, or any other type of oil you normally use."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Will 2 tablespoons be enough? Do I need to cover the dumplings with oil?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, two tablespoons should be fine! There;s no need to cover the dumplings as we just want enough oil to keep the dumplings from sticking to the pan. Are your dumplings now partially thawed?", "evidence": ["Adding 2 tablespoons (30 mL) of vegetable oil to the pan should be enough to keep the dumplings from sticking"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, they sort of \"glued\" together.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay, as long as they are partially thawed(which should take abut 15 minutes at room temperature) then we are fine to move on! Now let's add our dumplings to the pan. Make sure they are in a single layer and try to keep some space between the dumplings, we don't want them touching eachother! If you want a nice, even crust on your dumplings, you can fry them in the oil for 1-2 minutes while you swirl the pan otherwise we can immiedately move to the next step. Are you ready to move on?", "evidence": ["Before arranging them onto the pan, you should make sure the dumplings aren't completely frozen", "Simply let them sit at room temperature for 15 minutes before you start to prepare them.", "Arrange the dumplings in a single layer and try to keep them from touching each other", "If you want the dumplings to have an even crust, fry them for 1 to 2 minutes while swirling the pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Not yet. Do I need to stir dumplings to prevent them from getting burnt?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, if you want an an even crust and to prevent burning, it's best to swirl or stir the dumplings around in the pan. However, we will not be cooking the dumplings with just oil, so you shouldn't have to worry too much about them burning.", "evidence": ["If you want the dumplings to have an even crust, fry them for 1 to 2 minutes while swirling the pan"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it! Now I'm ready to move forward!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great! Now we going to add cold water to the pan. 0.5 cups is sufficient to cook the dumplings. So let's add the water and then cover the pan and let the dumplings cook for 10 minutes. While they are cooking, you don't need to touch them at all and can just wait for the 10 minutes while they cook!", "evidence": ["Add cold water and cook on low heat", "Add cold water and cook on low heat", "It's enough to use 0.5 cups (120 mL) of cold water", "Once you've done that, cover the pan and let the dumplings cook for 10 minutes", "During that time, it's best not to touch them at all"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have waited for about 12 minutes. What should I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Since we don't want the dumplings to get mushy, let's uncover the pan and let the water evaporate. While the water is evaporating, you can swirl the pan to help give the dumplings a nice crust. Once all the water is evaporated, your dumplings should now be cooked and ready to eat!", "evidence": ["Uncover and let the water evaporate", "If you don't want the dumplings to get mushy once you take them out, cook them uncovered until there's no more water in the pan", " Swirl the pan while the water is evaporating to give the dumplings a nice crust"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I did swirl the pan, but the dumplings are still soft. How can I make them crispy?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Is there still water in the pan or has all the water evaporated?", "evidence": ["Swirl the pan while the water is evaporating to give the dumplings a nice crust"], "id": "Agent", "dialog_act": "ask question"}, {"text": "It's dry.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "In that case, you can add a bit more oil to the pan and fry them for a couple minutes until you have them crispy enough for your taste!", "evidence": ["Adding 2 tablespoons (30 mL) of vegetable oil to the pan should be enough to keep the dumplings from sticking", "If you want the dumplings to have an even crust, fry them for 1 to 2 minutes while swirling the pan"], "id": "Agent", "dialog_act": "other"}, {"text": "Interesting. Fine, I'll just follow your advice.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Sounds good! Are your dumplings now crispy and cooked?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Not very crispy - actually they sort of stick to the pan, but I'm good with it.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "I'm sorry to heat that, maybe next time you could try frying them in the oil for a bit longer before adding the water. Anyways, I'm glad at least that you're okay with how they turned out. I hope you had a good time cooking and enjoy the dumplings!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Steam-Fry Frozen Dumplings", "url": "https://www.wikihow.com/Cook-Frozen-Dumplings", "category": ["Food and Entertaining", "Recipes", "World Cuisines"], "procedure": [{"summary": "Heat oil in a nonstick pan.", "description": "Use a large pan since you'll need to arrange the dumplings neatly. Adding 2 tablespoons (30 mL) of vegetable oil to the pan should be enough to keep the dumplings from sticking. Heat the oil over moderate heat to avoid burning the dumplings. When steam-frying the dumplings, you don't need to limit yourself to vegetable oil. You can use corn oil as well, or any other type of oil you normally use.", "img": "https://www.wikihow.com/images/thumb/5/58/Cook-Frozen-Dumplings-Step-4.jpg/v4-460px-Cook-Frozen-Dumplings-Step-4.jpg"}, {"summary": "Add partially thawed dumplings.", "description": "Before arranging them onto the pan, you should make sure the dumplings aren't completely frozen. Simply let them sit at room temperature for 15 minutes before you start to prepare them. Arrange the dumplings in a single layer and try to keep them from touching each other. If you want the dumplings to have an even crust, fry them for 1 to 2 minutes while swirling the pan.", "img": "https://www.wikihow.com/images/thumb/6/65/Cook-Frozen-Dumplings-Step-5.jpg/v4-460px-Cook-Frozen-Dumplings-Step-5.jpg"}, {"summary": "Add cold water and cook on low heat.", "description": "It's enough to use 0.5 cups (120 mL) of cold water. Once you've done that, cover the pan and let the dumplings cook for 10 minutes. During that time, it's best not to touch them at all.", "img": "https://www.wikihow.com/images/thumb/5/55/Cook-Frozen-Dumplings-Step-6.jpg/v4-460px-Cook-Frozen-Dumplings-Step-6.jpg"}, {"summary": "Uncover and let the water evaporate.", "description": "If you don't want the dumplings to get mushy once you take them out, cook them uncovered until there's no more water in the pan. Swirl the pan while the water is evaporating to give the dumplings a nice crust. The dumplings should now be ready to eat.", "img": "https://www.wikihow.com/images/thumb/3/3f/Cook-Frozen-Dumplings-Step-7.jpg/v4-460px-Cook-Frozen-Dumplings-Step-7.jpg"}]}}