{"conversation": [{"text": "Hello, I hope you're well. Today we are going to learn how to clean and season shrimp. Have you ever cleaned and seasoned shrimp before?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Hi! I'm doing great. No I've never done that before. How should I begin?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Okay, that's no problem! First off, we want to make sure we buy the right type of shrimp so that everything will go smoothly. It is best to buy large shrimp, this way the shrimp won't fall through the grill and won't overcook as easy as small shrimp. For this recipe, it's best to buy either U/10 or U/20 shrimp which means 10 or 20 shrimp per pound. We can either use fresh or frozen shrimp; which will you be using today?", "evidence": ["Buy large frozen or fresh shrimp", "Jumbo and larger variations of shrimp are the best for grilling because they won’t fall through the grates of the grill and are easier to handle than smaller shrimp", "Smaller shrimp are also more likely to overcook on the grill, which could lead to a rubbery or tough texture.", "Buy U/10 or U/20 shrimp. This means that there is either 10 or 20 shrimp per pound", "Cook fresh shrimp the same day that you purchase them or freeze them If you plan on making them later", "keep them on a bed of ice so that they don’t go bad."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have some frozen shrimp already in the freezer, so I'll use that.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay, sounds good! So with frozen shrimp we will want to thaw them. You can either thaw them in the refrigerator overnight or if you want to save time, rinse them under cold water for an hour. Once they've thawed, you'll want to rinse them one last time with cold water and then drain them in a colander. Afterwards, pat them dry with paper towels. Shrimp, when properly thawed, should look slightly translucent. Is your shrimp properly thawed?", "evidence": ["Thaw the shrimp if they are frozen", "You can leave the frozen shrimp in the refrigerator overnight, or rinse the shrimp under cold water for an hour", "Once the shrimp are thawed, rinse them one last time under cold water and drain them in a colander", "use paper towels to pat them dry", "When the shrimp are thawed, they should appear slightly translucent"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Does it have to be under the tap continuously for an hour?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You shouldn't have to rinse them continiously. You can leave them in the cold water and simply replace the water every so often until they are thawed!", "evidence": [" rinse the shrimp under cold water for an hour"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sounds good. They look translucent now, I think they're fully thawed.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Okay, perfect! Now we'll need to devein your shrimp if you haven't boughten already deveined shrimp. To check if you have to devein the shrimp, see if there is a black vein running down the black of the shrimp. If there is, you'll need to peel and devein them. To do this, start at the top of the shrimp and cut through the shrimp's shell with a pair of scissors, making sure to not cut through the meat. You can cut all the way down to the tail or stop and leave the tail. Leaving the tail will allow you to more easily handle the shrimp for dipping if you want to eat your shrimp with a sauce. Once you've peeled the excess shell throw it away. Now that we've peeled the shrimp, we need to devein. You can do this by using a small sharp knife and cutting down the back of the shrimp and removing the back vein. After deveining the shrimp, rinse under cold water. And if you've already bought deveined shrimp you can ignore all of this and begin seasoning! How's your shrimp looking? Are you ready to begin seasoning?", "evidence": ["Peel the shrimp if you have to devein them", "ou’ll know you have to devein the shrimp if there is a black vein running down the back of the shrimp.", "Start at the top of the shrimp and cut through shrimp’s shell with a pair of scissors", "You can cut all the way down the tail, or stop before the tail to keep it on", "Peel away the excess shell and throw it away.", " If you keep the tail on, it can serve as your handle for dipping and eating the grilled seafood", " Don’t cut through the meat of the shrimp"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I specifically only buy deveined shrimp to ignore all of this anyway so assume I can just move on to seasoning!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Okay, so let's season the shrimp. Let's coat our shrimp in olive oil and lemon juice. Then, let's sprinkle salt and pepper on the shrimp and toss it evenly coat. Feel free to get experimental and add other spices if you like! Garlic powder, cumin, and ginger are all great and can enhance the flavor!", "evidence": ["Coat the shrimp with olive oil and sprinkle salt, pepper, and lemon juice", "Pour the olive oil and lemon juice over the shrimp, then sprinkle the spices on top of them.", "Toss the shrimp so that they are evenly covered in spices.", " Experiment with other spices, like garlic powder, cumin, and ginger to impart different flavors to the shrimp."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is there a recommended amount of seasoning I should be using or is it up to me and my preferences?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "There is no recommended amount of seasoning so you can use as much or as little as you want! Once you've seasoned your shrimp, we can also marinate the shrimp for extra flavor. Are you ready to move on?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay I've added how much I normally add on when cooking, what do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "So now let's create a marinade. Let's grab a bowl and mix oil along with barbacue or hot sauce(whichever you prefer!). Here we can get creative and add whichever other flavors we may like. You can add spices like garlic, salt, pepper, cumin or even things like parsley, sugar, and lemon juice! If you're feeling lazy you can even use store bought marinades instead of using your own. Once you've got your marinade, coat your shrimp and allow them to sit in the bowl for 30 minutes to an hour. And voila! You've now prepared and seasoned your shrimp!", "evidence": ["Create a marinade by combining oil and barbeque or hot sauce in a bowl", "Add other flavors to the marinade like garlic, salt, pepper, and/or cumin.", "Coat the shrimp thoroughly in the marinade and leave the shrimp in the bowl for 30 minutes to an hour. ", "ou can also add ingredients like parsley, sugar, and lemon juice to the marinade. You can also purchase store-bought marinades as an alternative to making your own."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I added some paprika, salt, and pepper and it is smelling divine! Once I let the shrimp sit in the marinade for an hour is it all done?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! After letting the shrimp sit in the marinade for an hour you are all finished and now cook the shrimp. I hope you enjoyed preparing the shrimp today and have a great day!", "evidence": ["Coat the shrimp thoroughly in the marinade and leave the shrimp in the bowl for 30 minutes to an hour."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Wonderful! I had a great time! Thank you!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "My please!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Clean and Season Shrimp", "url": "https://www.wikihow.com/Grill-Shrimp", "category": ["Food and Entertaining", "Recipes", "Fish and Seafood", "Prawns and Shrimp"], "procedure": [{"summary": "Buy large frozen or fresh shrimp.", "description": "Jumbo and larger variations of shrimp are the best for grilling because they won’t fall through the grates of the grill and are easier to handle than smaller shrimp. Smaller shrimp are also more likely to overcook on the grill, which could lead to a rubbery or tough texture. Buy U/10 or U/20 shrimp. This means that there is either 10 or 20 shrimp per pound. Cook fresh shrimp the same day that you purchase them or freeze them If you plan on making them later. When you bring fresh shrimp home, keep them on a bed of ice so that they don’t go bad.", "img": "https://www.wikihow.com/images/thumb/1/1b/Grill-Shrimp-Step-1-Version-3.jpg/v4-460px-Grill-Shrimp-Step-1-Version-3.jpg"}, {"summary": "Thaw the shrimp if they are frozen.", "description": "You can leave the frozen shrimp in the refrigerator overnight, or rinse the shrimp under cold water for an hour. Once the shrimp are thawed, rinse them one last time under cold water and drain them in a colander. Then, use paper towels to pat them dry. When the shrimp are thawed, they should appear slightly translucent.", "img": "https://www.wikihow.com/images/thumb/2/2b/Grill-Shrimp-Step-2-Version-2.jpg/v4-460px-Grill-Shrimp-Step-2-Version-2.jpg"}, {"summary": "Peel the shrimp if you have to devein them.", "description": "You’ll know you have to devein the shrimp if there is a black vein running down the back of the shrimp. Start at the top of the shrimp and cut through shrimp’s shell with a pair of scissors. You can cut all the way down the tail, or stop before the tail to keep it on. Peel away the excess shell and throw it away. If you keep the tail on, it can serve as your handle for dipping and eating the grilled seafood. Don’t cut through the meat of the shrimp. Leaving the shell on may make your shrimp more flavorful.", "img": "https://www.wikihow.com/images/thumb/d/d3/Grill-Shrimp-Step-3-Version-3.jpg/550px-nowatermark-Grill-Shrimp-Step-3-Version-3.jpg"}, {"summary": "Devein the shrimp if necessary.", "description": "Use a small, sharp knife to cut down the back of each peeled shrimp. Pull out the back vein and rinse the shrimp under cold water. You can purchase deveined shrimp at the grocery store.", "img": "https://www.wikihow.com/images/thumb/c/c4/Grill-Shrimp-Step-4-Version-3.jpg/550px-nowatermark-Grill-Shrimp-Step-4-Version-3.jpg"}, {"summary": "Coat the shrimp with olive oil and sprinkle salt, pepper, and lemon juice.", "description": "Pour the olive oil and lemon juice over the shrimp, then sprinkle the spices on top of them. Toss the shrimp so that they are evenly covered in spices. This will enhance the flavor and add citrus notes to the shrimp. Experiment with other spices, like garlic powder, cumin, and ginger to impart different flavors to the shrimp.", "img": "https://www.wikihow.com/images/thumb/c/c9/Grill-Shrimp-Step-5-Version-3.jpg/550px-nowatermark-Grill-Shrimp-Step-5-Version-3.jpg"}, {"summary": "Marinate your shrimp for extra flavor.", "description": "Create a marinade by combining oil and barbeque or hot sauce in a bowl. Add other flavors to the marinade like garlic, salt, pepper, and/or cumin. Coat the shrimp thoroughly in the marinade and leave the shrimp in the bowl for 30 minutes to an hour. You can also add ingredients like parsley, sugar, and lemon juice to the marinade. You can also purchase store-bought marinades as an alternative to making your own.", "img": "https://www.wikihow.com/images/thumb/0/03/Grill-Shrimp-Step-6-Version-3.jpg/550px-nowatermark-Grill-Shrimp-Step-6-Version-3.jpg"}]}}