{"conversation": [{"text": "Hello! Would you like to learn how to keep green onions fresh?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Hello! Yes, I am definitely interested in learning how to keep green onions fresh!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Fabulous! What you'll want to do is fill a glass or a tall jar with 1-2 inches of cold or room temp water (not warm!). You'll want to use a glass or jar that is heavy on the bottom and can keep the onions upright, I would personally opt for either a pint glass or a large canning jar if you have either of those.", "evidence": ["Fill a glass or tall jar with 1–2 inches (2.5–5.1 cm) of water.", "glass or jar that is heavy on the bottom", "cold or room temperature, but not warm", "pint glass or a large canning jar works well."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay! It's a good thing I've always got a few canning jars laying around. I've filled one with about 2 inches of cold water now, what's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "That's great! They always come in handy! Next you'll want to put the root end of the onions in the water. By doing this you're allowing the onions to keep taking in water, which helps your onions stay firm and fresh.", "evidence": ["Put the root end of the onions in the water", "By submerging the roots in water, you allow the onions to keep taking in water, which helps the onions stay firm and fres"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, now this may be a stupid question but by root end of the onion, do you mean the white bulbous part?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Don't worry, there are no stupid questions! If your onion has no clear roots then yes, the white bulbous part. That is the root end, and if that remains on your onion then the plant will grow new roots in the water. Amazing!", "evidence": ["if the roots themselves have been trimmed off", "but the root end remains, the plant will grow new roots in water."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay great, so I've put the root end of the onion in the water. That was easy enough, is that all there is to keeping the onions fresh?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Not yet. Next you're going to need to cover the onions and the top of the container in a plastic bag. The product bag that you brought them home with should suffice. You'll then need to either use a rubber band or string to cinch the bag around the container, or if you used a zip-loc bag you're want to zip it up as close to edge of the container as you can get.", "evidence": ["Cover the onions and the top of the container in a plastic bag", "then you can use a rubber band or string to cinch the plastic bag around the container.", "close the zip-lock edge as much as possible toward the sides of the container", "be easiest to use the produce bag that you brought the green onions home in."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh I see. Okay, so I've covered the top of the onions with a plastic bag and fastened the bag around the canning jar with a rubber band. How long should this keep the onions fresh for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "In order to keep them fresh for however long you want, just chuck them in the fridge, making sure to change the water every few days. Changing the water is what keeps them fresh as it prevents mold from accumulating on the surface of the water. To be extra safe you can also rinse off the root sections of the onions whenever changing the water to remove any bacteria. That's it!", "evidence": ["Place the glass with the onions in it on a tall shelf of your refrigerator.", "To keep the onions fresh, you will need to refresh the water regularly", "mold can accumulate on the surface of the water and can begin to decay the onions", "rinse off the green onion root sections. This will help to remove any bacteria"], "id": "Agent", "dialog_act": "answer question"}], "recipe": {"title": "How to Keep Green Onions Fresh", "url": "https://www.wikihow.com/Keep-Green-Onions-Fresh", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Onions"], "procedure": [{"summary": "Fill a glass or tall jar with 1–2 inches (2.5–5.1 cm) of water.", "description": "Use a glass or jar that is heavy on the bottom so that it easily stays upright. The water should be cold or room temperature, but not warm. The glass or jar should be tall enough so that it can keep the green onions upright. For example, a pint glass or a large canning jar works well.", "img": "https://www.wikihow.com/images/thumb/5/5d/Keep-Green-Onions-Fresh-Step-1.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-1.jpg"}, {"summary": "Put the root end of the onions in the water.", "description": "Since green onions are typically sold with roots still attached, these roots can be used to help keep the onions fresh. By submerging the roots in water, you allow the onions to keep taking in water, which helps the onions stay firm and fresh. Even if the roots themselves have been trimmed off your green onions, but the root end remains, the plant will grow new roots in water.", "img": "https://www.wikihow.com/images/thumb/3/35/Keep-Green-Onions-Fresh-Step-2.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-2.jpg"}, {"summary": "Cover the onions and the top of the container in a plastic bag.", "description": "In order to keep the right level of humidity around your green onions in a refrigerator, you need to tent them with a plastic bag. This can be a produce bag or a zip-lock bag, whatever you have available. It may be easiest to use the produce bag that you brought the green onions home in.", "img": "https://www.wikihow.com/images/thumb/7/79/Keep-Green-Onions-Fresh-Step-3.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-3.jpg"}, {"summary": "Cinch the plastic bag around the top of the container.", "description": "If you have tented your green onions with a produce bag, then you can use a rubber band or string to cinch the plastic bag around the container. If you have used a zip-lock bag, you can simply close the zip-lock edge as much as possible toward the sides of the container. The plastic bag does not need to be totally sealed so that it is airtight. You simply want to keep some of the humidity from the water around the onions. If the plastic bag was not there, the refrigerator would remove all of it.", "img": "https://www.wikihow.com/images/thumb/a/a3/Keep-Green-Onions-Fresh-Step-4.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-4.jpg"}, {"summary": "Put the glass in your refrigerator.", "description": "Place the glass with the onions in it on a tall shelf of your refrigerator. Put it in a spot where it won't get bumped a lot and where it will be stable so that it doesn't fall over and spill water all over the fridge. When you want to use your onions, just take the container out, remove the bag, remove an onion, place the plastic bag back on, and put it back in the fridge.", "img": "https://www.wikihow.com/images/thumb/4/48/Keep-Green-Onions-Fresh-Step-5.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-5.jpg"}, {"summary": "Change the water every few days.", "description": "To keep the onions fresh, you will need to refresh the water regularly. If you don't, mold can accumulate on the surface of the water and can begin to decay the onions. When you change out the water, you can also rinse off the green onion root sections. This will help to remove any bacteria or mold that might be starting to grow on them.", "img": "https://www.wikihow.com/images/thumb/6/6a/Keep-Green-Onions-Fresh-Step-6.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-6.jpg"}]}}