{"conversation": [{"text": "Hello! So today we are going to learning how to grill shrimp skewers. Have you got any wooden or metal skewers?", "evidence": ["Purchase wooden or metal skewers from the grocery store or online."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Hi! Yes I have metal ones just in my drawer.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay perfect, metal skewers work well! So let's begin by putting the shrimp onto the skewers. You can do this by thrusting the skewer through the tail and into the midsection of the shrimp. The shrimp should be in the shape of a U on the skewer. Once we've done that we can begin preheating the grill to 350-450 °F ( 177-232 °C)", "evidence": ["Drive the skewer through the tail and into the midsection of the shrimp to secure it to the skewer.", " The shrimp should be in a U shape on the skewer.", "Preheat the grill to 350–450 °F (177–232 °C)"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Is there a specific amount of shrimp I should be putting on each skewer, or should I just put on as many as the skewer can fit?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It's totally up to your preference! You can put as many or as few as you like!", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sounds good! I've put about 5 on each skewer. What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great! Now we are ready to grill the shrimp. Make sure your grill has had enough time to heat up(around 10 minutes should be fine!) so as to give the shrimp an even cook. Once that's done, we can place the skewers onto the grill for 3 minutes. You should hear a sizzle when you place the shrimp on the grill.", "evidence": ["Preheating your grill will give the shrimp a more even cook."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Should there be a specific change of appearance that I should look out for when grilling?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes! That's a good question. The outside of the shrimp should begin turning a nice pink color as it cooks whereas the meat inside the shrimp should start turning white and opaque.", "evidence": ["the outside of the shrimp should turn a nice pink color when it is cooked ", "the meat inside should turn white and opaque"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay that's good, that's how mine are looking! What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "So after we've allowed the shrimp to cook for 3 minutes, we will need to flip them to cook the other side. So flip the shrimp with some tongs and allow them to cook for another 3 minutes. Make sure to not overcook the shrimp as the meat will become tough and chewy. You'll know the shrimp are cooked when they start to curl up.", "evidence": ["Flip the shrimp over and cook for another 3 minutes.", " Do not overcook the shrimp or else it might become tough and chewy", "shrimp should curl up once they are cooked."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Perfect. They're starting to curl up now. Should I move on?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Definitely! Now that your shrimp have cooked you can remove them from the grill. Place them on a plate and allow them to cool for a few minutes before serving. When serving, you can serve them on the skewers or remove them. And if you have any leftovers you can put them in a sealed container and keep them in the refrigerator for 3-4 days. And that's it!", "evidence": ["Remove the shrimp from the grill and serve them"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wow! That was really easy! Thank you!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem. I hope you had a good time and enjoy your shrimp!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Grill Shrimp Skewers", "url": "https://www.wikihow.com/Grill-Shrimp", "category": ["Food and Entertaining", "Recipes", "Fish and Seafood", "Prawns and Shrimp"], "procedure": [{"summary": "Skewer the shrimp.", "description": "Purchase wooden or metal skewers from the grocery store or online. Drive the skewer through the tail and into the midsection of the shrimp to secure it to the skewer. The shrimp should be in a U shape on the skewer. Repeat this process until all of your shrimp are on skewers. If you use wooden skewers, soak them in water for a few hours before you start grilling so that they don’t catch on fire as you grill. You can also use a grilling basket instead of skewers if you have one.", "img": "https://www.wikihow.com/images/thumb/e/ef/Grill-Shrimp-Step-7-Version-3.jpg/550px-nowatermark-Grill-Shrimp-Step-7-Version-3.jpg"}, {"summary": "Preheat the grill to 350–450 °F (177–232 °C).", "description": "Turn the knobs on the grill to preheat it if you’re using a gas grill. If you are using a charcoal grill, load the charcoal into the bottom of the grill and stack the charcoal in a pyramid shape. Then, pour lighter fluid over the charcoal and ignite it with a grill lighter. Let the fire on the coals go out and allow them to heat up for 10 minutes before you start grilling the shrimp. Some charcoal grills have an electric starter. If this is the case, hit the button or switch to ignite the coals after you’ve loaded it. It will take anywhere from 8-10 minutes for the coals to heat up. Preheating your grill will give the shrimp a more even cook.", "img": "https://www.wikihow.com/images/thumb/c/c8/Grill-Shrimp-Step-8.jpg/550px-nowatermark-Grill-Shrimp-Step-8.jpg"}, {"summary": "Place the shrimp on the grill for 3 minutes.", "description": "You should hear the shrimp sizzle as it makes contact with the grill. As the shrimp cooks, the outside of the shrimp should turn a nice pink color when it is cooked while the meat inside should turn white and opaque.", "img": "https://www.wikihow.com/images/thumb/a/a5/Grill-Shrimp-Step-9.jpg/550px-nowatermark-Grill-Shrimp-Step-9.jpg"}, {"summary": "Flip the shrimp over and cook for another 3 minutes.", "description": "Flip the shrimp over on the grill with a pair of tongs to evenly cook the other side. Do not overcook the shrimp or else it might become tough and chewy. The shrimp should curl up once they are cooked.", "img": "https://www.wikihow.com/images/thumb/0/09/Grill-Shrimp-Step-10.jpg/550px-nowatermark-Grill-Shrimp-Step-10.jpg"}, {"summary": "Remove the shrimp from the grill and serve them.", "description": "Place the shrimp on a plate and let them cool for 2-3 minutes before serving them. Grilled shrimp taste great with a vegetable side like corn or on their own! You can serve the shrimp on the skewers or remove them from the skewers and serve them separately. You can keep the leftover shrimp sealed in the refrigerator for 3-4 days.", "img": "https://www.wikihow.com/images/thumb/e/e4/Grill-Shrimp-Step-11.jpg/v4-460px-Grill-Shrimp-Step-11.jpg"}]}}