{"conversation": [{"text": "Hello, I hope you are well. Today we are going to be learning how to grill shrimp using aluminum foil. Are you ready to begin?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Hello! Yes I'm ready!", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's great! So let's begin by preheating our grill to 350-450 °F (177-232 °C). If you're using a gas grill you do this by simply turning on the knobs. If you are using a charcoal grill, you'll need to ignite the coals with lighter fluid.", "evidence": ["Set your grill to 350–450 °F (177–232 °C)"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Starting off easy enough! What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we can prepare our shrimp for the grill. Let's grab a large piece of foil that is big enough to fit all of our shrimp. Then we dump the shrimp in the middle of the tin foil. If you are going to be cooking a lot of shrimp, you may want to create multiple packets of shrimp. If you are feeling adventurous, you can even add other things with the shrimp like corn, sausage, or garlic! Then we simply fold the sides and create a little packet. It's important to make sure that your packets of shrimp are completely sealed before we begin to cook them on the grill!", "evidence": ["Place the shrimp in a piece of foil.", "Unroll a sheet of foil that’s large enough to accommodate all of the shrimp that you want to gril", "Lay the foil out on a flat surface and dump the shrimp into the middle of the tin foil", "You can also add other ingredients like corn, sausage, and garlic to the packet.", "If you are grilling a lot of shrimp, you may want to create multiple packets", "Fold up the sides of the foil to create a packet.", "Fold up the sides of the tin foil so that they are completely covered", "Make sure that the packets are completely sealed"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Should I be placing them in the foil close together?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yes, that should be fine! However, as I previously mentioned, if you are cooking a substantial amount of shrimp you may want to create multiple packets of shrimp!", "evidence": [" If you are grilling a lot of shrimp, you may want to create multiple packets"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sounds good! I'll create 2 packets. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we can begin cooking! Place your foil packets on the grill and cook for about 10-15 minutes. If you've added any additional ingredients to the shrimp, you may want to cook it on the longer side.", "evidence": ["Place the foil packet on the grill for 10-15 minutes", "If you added additional ingredients to the packet, cook the shrimp on the longer side"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Wonderful. Do I need to move them around at all during the process or because they're in packets I can just leave them in 1 place for the whole time?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You shouldn't need to move them at all. You can simply place the foil packets on the grill for 10-15 minutes and they will cook just fine!", "evidence": ["Place the foil packet on the grill for 10-15 minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "That's great! Less work for me then! What should I do after?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now once our shrimp is cooked we are ready to serve! Remove the packets from the grill and you can unwrap the foil and serve the shrimp immiedately! If you'd like to add a bit of extra flavor, you can season the shrimp with some parsley, lemon juice, or even butter if you are feeling a bit naughty!", "evidence": ["Unwrap the foil and serve immediately."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I think I will use some butter. Sounds delicious!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "That sounds delicious. Well I hope you had a good time cooking today and enjoy your grilled shrimp!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you! I had a blast! Have a great day!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I'm glad to hear that, thank you!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Grill Shrimp Using Foil", "url": "https://www.wikihow.com/Grill-Shrimp", "category": ["Food and Entertaining", "Recipes", "Fish and Seafood", "Prawns and Shrimp"], "procedure": [{"summary": "Set your grill to 350–450 °F (177–232 °C).", "description": "If you're using a gas grill, you can set the temperature by turning the knobs on the front of the grill. If you're using a charcoal grill, pile the charcoal in a pyramid shape on the bottom of the grill. Use lighter fluid and a lighter to ignite the coals. Let the fire die, then wait 10 minutes so that all of the coals are at the right temperature. If you have an automatic starter, press the start button after you've loaded the grill with charcoal.", "img": "https://www.wikihow.com/images/thumb/b/ba/Grill-Shrimp-Step-12.jpg/v4-460px-Grill-Shrimp-Step-12.jpg"}, {"summary": "Place the shrimp in a piece of foil.", "description": "Unroll a sheet of foil that’s large enough to accommodate all of the shrimp that you want to grill. Lay the foil out on a flat surface and dump the shrimp into the middle of the tin foil. You can also add other ingredients like corn, sausage, and garlic to the packet. If you are grilling a lot of shrimp, you may want to create multiple packets.", "img": "https://www.wikihow.com/images/thumb/0/06/Grill-Shrimp-Step-13.jpg/550px-nowatermark-Grill-Shrimp-Step-13.jpg"}, {"summary": "Fold up the sides of the foil to create a packet.", "description": "Fold up the sides of the tin foil so that they are completely covered. Roll the top and bottom edge of the tin foil to keep them in a contained packet. Make sure that the packets are completely sealed before putting them on the grill.", "img": "https://www.wikihow.com/images/thumb/3/3c/Grill-Shrimp-Step-14.jpg/550px-nowatermark-Grill-Shrimp-Step-14.jpg"}, {"summary": "Place the foil packet on the grill for 10-15 minutes.", "description": "If you added additional ingredients to the packet, cook the shrimp on the longer side. As the shrimp cooks, it will absorb the spices and marinade in the packet.", "img": "https://www.wikihow.com/images/thumb/3/32/Grill-Shrimp-Step-15.jpg/550px-nowatermark-Grill-Shrimp-Step-15.jpg"}, {"summary": "Unwrap the foil and serve immediately.", "description": "Use a pair of tongs to remove the tin foil packet from the grill. Open the top of the packet and serve the shrimp immediately. To add extra flavor season the shrimp with parsley, lemon juice, or butter after it’s cooked.", "img": "https://www.wikihow.com/images/thumb/a/ae/Grill-Shrimp-Step-16.jpg/550px-nowatermark-Grill-Shrimp-Step-16.jpg"}]}}