{"conversation": [{"text": "Hi! Have you ever endeavoured to keep green onions fresh before?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Hello! No I haven not but I am definitely interested to learning how to do so!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Hi! Have you ever endeavoured to keeping green onions fresh before?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Hello! No I haven not but I am definitely interested to learning how to do so!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Sounds good! You'll be an expert in no time! Firstly, you want to remove any packaging from your green onions, and then want to wrap them up in a damp paper towel. This provides them moisture without adding so much that they begin to rot.", "evidence": ["Remove any packaging from the green onions.", "Wrapping them in a slightly damp"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay. So I should make sure that the paper towels aren't TOO wet, right? As you said too much moisture might make them rot?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Correct. To make sure that the paper towel isn't too wet, you can instead wrap the onions in a dry paper towel, and then lightly sprinkle a bit of water over the top of the towel.", "evidence": ["you can wrap the onions in a dry paper towel and then sprinkle a bit of water"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I like that method! I've now wrapped the green onions in some damp paper towels, what's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Wonderful! Next you need to place the bundle of onions into a plastic bag. Don't worry that bag doesn't need to be airtight, you can just place it loosely around the bundle of onions.", "evidence": ["the bundle should be placed in a plastic bag", "placed loosely around the bundle of onions"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I've placed the bundles of onions into a plastic bag. Is that it or is there more?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "One more step! Place them anywhere in the refrigerator, making sure to re-moisten the paper towel if it has tried out when you use them. That's it!", "evidence": ["they can be kept anywhere in your refrigerator", "When you use some of your green onions, be sure to re-moisten the paper towel if it has dried out"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright then, sound's like a plan. That was easy enough! One last question, how long will this keep the onions fresh for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It should keep them fresh for as long as you keep them moist.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Perfect. Thank you very much for helping me today!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem! Have a wonderful day!", "evidence": [], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Keep Green Onions Fresh", "url": "https://www.wikihow.com/Keep-Green-Onions-Fresh", "category": ["Food and Entertaining", "Recipes", "Fruits and Vegetables", "Onions"], "procedure": [{"summary": "Remove any packaging from the green onions.", "description": "Green onions often come in plastic bags or are held together in bundles with rubber bands. Take all of the packaging off of the onions so that they are loose. Removing the packaging will allow the green onions to be removed from the bundle more easily and will minimize the chance of the onions being damaged by the rubber bands.", "img": "https://www.wikihow.com/images/thumb/a/a0/Keep-Green-Onions-Fresh-Step-13.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-13.jpg"}, {"summary": "Wrap the onions in a damp paper towel.", "description": "In order to keep the green onions firm, they need to be kept in humid conditions. Wrapping them in a slightly damp paper towel will provide the humidity they need without adding so much moisture that they begin to rot. To make sure that the paper towel is not too wet, you can wrap the onions in a dry paper towel and then sprinkle a bit of water over the top of the towel.", "img": "https://www.wikihow.com/images/thumb/5/53/Keep-Green-Onions-Fresh-Step-14.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-14.jpg"}, {"summary": "Place the towel-wrapped onions in a plastic bag.", "description": "To keep the moisture around the green onions, the bundle should be placed in a plastic bag. This will ensure that the humidity created by the damp paper towel is not removed by the refrigerator. The plastic bag can be placed loosely around the bundle of onions. It does not need to be completely airtight.", "img": "https://www.wikihow.com/images/thumb/1/13/Keep-Green-Onions-Fresh-Step-15.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-15.jpg"}, {"summary": "Put the bag in your refrigerator.", "description": "The vegetable bin is a good place to keep your green onions. However, because the green onions are in a plastic bag, they can be kept anywhere in your refrigerator. When you use some of your green onions, be sure to re-moisten the paper towel if it has dried out. Then place the bundle back in its plastic bag and put it all back in the fridge.", "img": "https://www.wikihow.com/images/thumb/a/a2/Keep-Green-Onions-Fresh-Step-16.jpg/v4-460px-Keep-Green-Onions-Fresh-Step-16.jpg"}]}}