{"conversation": [{"text": "put the roast in a pan and sit at room temperatuure", "evidence": ["let your roast rest"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "how long should this last?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Is the roast large or small?", "evidence": ["a small roast, you should let it sit for roughly 30 to 60 minutes", " large roasts can sit for up to an hour and a half."], "id": "Agent", "dialog_act": "ask question"}, {"text": "It is quite large", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "it should last up to 90 minutes.", "evidence": ["large roasts can sit for up to an hour and a half"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "what should I do when the resting time is up?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You can start preheating the oven.", "evidence": ["Preheat your oven"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "what temperature should the oven be set to?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "What type of meat are you roasting?", "evidence": [" determined by the kind of meat "], "id": "Agent", "dialog_act": "answer question"}, {"text": "I am cooking pork, pork ribs.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "hw would you like your meat?", "evidence": ["depend on whether you want your meat rare, medium rare, or medium"], "id": "Agent", "dialog_act": "ask question"}, {"text": "what are the options?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can choose from rare, medium rare, and medium", "evidence": ["rare, medium rare, or medium"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I would like my meat rare please.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook a Roast in an Oven", "url": "https://www.wikihow.com/Cook-a-Roast", "category": ["Food and Entertaining", "Recipes", "Meat"], "procedure": [{"summary": "Let the meat 'rest'.", "description": "Whether you are roasting lamb, pork, beef, bison, or some other game, you will want to let your roast rest. This means taking it out of the refrigerator, placing it in a pan (to catch any drippings), and letting it sit at room temperature. If you are cooking a small roast, you should let it sit for roughly 30 to 60 minutes, while large roasts can sit for up to an hour and a half. Resting the roast allows the meat to become moist again--when it is in the refrigerator, the meat tends to become tougher.", "img": "https://www.wikihow.com/images/thumb/a/a0/Cook-a-Roast-Step-1-Version-2.jpg/v4-460px-Cook-a-Roast-Step-1-Version-2.jpg"}, {"summary": "Estimate the time it will take your roast to cook.", "description": "Generally, roasting time can be estimated by how many pounds of meat you will be cooking. The length of time you cook your roast for will depend on whether you want your meat rare, medium rare, or medium. However, please note that every oven is different so while this offers an estimate of the cooking time, you should still monitor the internal temperature of the meat to determine when it is done. For a rare roast: Allow 15 minutes of cooking time for every pound of roast. For example, if you had a 5 pound roast, you would cook your roast for 75 minutes if you wanted it rare. For a medium rare roast: Cook the roast for 20 minutes for every pound. If you were cooking a 5 pound roast, you would cook it for 100 minutes. For a medium roast: Allow 22 minutes of cooking time for every pound. If you were cooking a 5 pound roast, you would cook the meat for 110 minutes. If you are cooking a pork roast, you should allow 20 minutes per pound of meat.", "img": "https://www.wikihow.com/images/thumb/f/ff/Cook-a-Roast-Step-2-Version-2.jpg/v4-460px-Cook-a-Roast-Step-2-Version-2.jpg"}, {"summary": "Preheat your oven to the right temperature.", "description": "This will be determined by the kind of meat you will be roasting. Here are the roasting temperatures for all of the basic meat roasts:\n\nRoast at 325ºF: Lamb leg or shoulder roast; pork loin, shoulder, crown, or rib roast; full ham (with bone or boneless); veal loin or rib roast; beef round-tip, rump, bottom round, eye round, and fresh or corned brisket roast. Roast at 350ºF: Beef rib-eye (boneless) or rib roast (bone-in); pork rib roast. Roast at 425ºF: Beef tenderloin and tri-tip roast; pork tenderloin roast.", "img": "https://www.wikihow.com/images/thumb/a/a2/Cook-a-Roast-Step-3-Version-2.jpg/v4-460px-Cook-a-Roast-Step-3-Version-2.jpg"}, {"summary": "Season your roast.", "description": "Traditionally, roasts were simply seasoned with salt and pepper. However, you can also season it with garlic, or any herbs that you enjoy. If you want to  marinate your roast, you will have to do so a couple of days before you plan on roasting the meat, as marinade takes a relatively long time to get absorbed by the meat. If your roast has a layer of larding fat on top of it (as most roasts do) you can either sprinkle seasonings on top of the fat or remove the layer of fat (which will probably be held down by strings, which you should remove), season the meat underneath, and then lay the fat back on top again. The fat will add flavor to the roasting meat.", "img": "https://www.wikihow.com/images/thumb/5/51/Cook-a-Roast-Step-4-Version-2.jpg/v4-460px-Cook-a-Roast-Step-4-Version-2.jpg"}, {"summary": "Place a rack inside your roasting pan.", "description": "Your roasting pan should be large and shallow. Place a rack in the pan and then place the meat on the rack. The rack is important because it will keep the meat separate from its juices. If the meat were to sit in its juices, it would steam rather than roast.", "img": "https://www.wikihow.com/images/thumb/4/4c/Cook-a-Roast-Step-5-Version-2.jpg/v4-460px-Cook-a-Roast-Step-5-Version-2.jpg"}, {"summary": "Cook your roast.", "description": "You do not have to monitor it until you get closer to the end of the estimated cooking time. You will need a  meat thermometer to make a good roast--the key to roasting is to be able to monitor the internal temperature of the meat.", "img": "https://www.wikihow.com/images/thumb/4/40/Cook-a-Roast-Step-6-Version-2.jpg/v4-460px-Cook-a-Roast-Step-6-Version-2.jpg"}, {"summary": "Check the internal temperature of the roast.", "description": "When the estimated cooking time is coming to an end, you will need to check the internal temperature of the roast to make sure that it is cooked properly. Use a meat thermometer to check the internal temperature. Remove the items listed below when they reach the designated temperature:\n\n135ºF: Remove beef rump, eye round, bottom round roast. 135ºF to 150ºF: Remove beef ribeye, rib, tenderloin, and tri-tip roast. 140ºF: Remove full ham. 140ºF to 155ºF: Remove beef round tip; lamb leg, shoulder, and shank leg roast. 145ºF: Remove pork loin, crown, and shoulder roast. 155ºF : Remove veal loin and rib roast.", "img": "https://www.wikihow.com/images/thumb/2/22/Cook-a-Roast-Step-7-Version-2.jpg/v4-460px-Cook-a-Roast-Step-7-Version-2.jpg"}, {"summary": "Remove the roast from the oven.", "description": "Let the roast rest on a platter or cutting board that has grooves that the drippings can run into. Cover the roast with parchment or foil. Roasts will continue to cook even after they have been removed from the oven. Let small roasts rest for 10 minutes; larger roasts should rest for 15 to 30 minutes. Allowing the meat to rest will help the meat retain its moisture, creating a juicier roast. A good way to tell when your roast is done resting is to check the internal temperature again. The meat can be sliced and served when the internal temperature begins to decrease.", "img": "https://www.wikihow.com/images/thumb/d/df/Cook-a-Roast-Step-8-Version-2.jpg/v4-460px-Cook-a-Roast-Step-8-Version-2.jpg"}, {"summary": "Slice the meat and serve.", "description": "Enjoy!", "img": "https://www.wikihow.com/images/thumb/4/45/Cook-a-Roast-Step-9-Version-2.jpg/v4-460px-Cook-a-Roast-Step-9-Version-2.jpg"}]}}