{"conversation": [{"text": "Good evening, to start cooking the roast grab a plastic sealable bag. We are going to place the meat in the bag with the seasoning. A plastic bag is a very effective way to coat the meat in the seasoning.", "evidence": ["Make sure the bag you use is sealable. Once your meat is in the bag,", " really effective way to coat your roast in seasoning"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay I have placed the meat in the bag. What should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Perfect, next add into the bag with the meat 2 tablespoons of flour, one teaspoon of salt, one half teaspoon of black pepper and two teaspoons of garlic. Seal the bag and shake it well.", "evidence": ["add two tablespoons of flour, one teaspoon kosher salt (or regular salt), one-half teaspoon of black pepper, and two teaspoons of garlic powder. Seal the bag and shake well"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay I have added the seasoning and am now shaking the bag.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great. Is the meat thoroughly coated in seasoning?", "evidence": [" meat is thoroughly coated in the seasoning."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes the entire surface area appears to be covered in the seasoning.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Perfect we can move on to cooking the meat. First get out a skillet and place one your stove. Take one tablespoon of olive oil and put this in the skillet. Then turn the stove onto high heat.", "evidence": ["place a tablespoon of olive oil in a large skillet.", "Bring it to a high heat"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay done, the oil has heated.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Place the roast onto the skillet and sear the first side.", "evidence": ["place the meat in the skillet and simply sear all sides of the meat so that they turn a golden brown color."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How will I know when the side is seared enough?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It should be a golden brown colour. Browning the roast adds flavour, when the first side is done flip it over and sear the other side.", "evidence": ["sear all sides of the meat so that they turn a golden brown color. Browning meat adds flavor to the roast."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay both sides are a golden brown.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Now we can prepare the slow cooker. First place in your vegetables, you want to place the vegetables in the slow cooker first so they can absorb the juices from the meat. What vegetables do you have you would like to use? Typically carrots, potatoes and onions are used but you can do others as well!", "evidence": ["Place the vegetables in the cooker before the meat so that they absorb some of the meat's delicious flavors."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have potatoes and carrots ready. I will place them in the slow cooker first.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Great, the veggies should be cut into small chunks of similar size so they all cook evenly. Once all the veggies are in the slow cooker you can add your meat. You can also put some veggies onto and/or around the meat!", "evidence": ["cut up whatever veggies you use into small chunks so that they cook more thoroughly", " You can also cover the meat with the vegetables, or surround the meat with the veggies"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great all the veggies and the roast are now in the slow cooker. Should I add any sauce of some kind to this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes you can! Many people use half a cup of beet broth but you can also use wine, cream of mushroom soup, water or other things such as worcestershire or soy sauce.", "evidence": ["half cup of beef broth to slow cook their roasts in", "use wine, cream of mushroom soup, water, or a variety of other ingredients like Worcestershire or soy sauce"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great I will use beef broth and add a little worcestershire sauce", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great and today are we using a beef roast or a pork roast?", "evidence": ["Beef roasts should generally be left in the slow cooker for 8 to 10 hours,", "pork roasts will generally be done after 6 or 7"], "id": "Agent", "dialog_act": "ask question"}, {"text": "I have a beef roast", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Great, we want to cook the roast slowly for the best taste so set the slow cooker to the low setting and let it cool for 8-10 hours", "evidence": ["Beef roasts should generally be left in the slow cooker for 8 to 10 hours,"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sounds good, the cooker is on low. How will I know when it is done?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Anywhere between the 8-10 hours should be enough. It should be tender and easy to cut when it is done. If you find it is not as moist as you like when the time is up you can cut it into smaller peices and let it cook a little bit longer to absorb some more of that moisture.", "evidence": ["It should be tender and easy to cut.", "cut it into smaller pieces, and return it to the cooker to absorb some more of the moisture"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay great, I will leave it to cook for the 8-10 hours and check it, thanks!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "When it is done you can slice it up and serve it, hope you enjoy!", "evidence": [" slice it up and serve alongside the vegetables. Enjoy!"], "id": "Agent", "dialog_act": "other"}, {"text": "Thanks for the guidance!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook a Roast in a Slow Cooker", "url": "https://www.wikihow.com/Cook-a-Roast", "category": ["Food and Entertaining", "Recipes", "Meat"], "procedure": [{"summary": "Place your meat in a plastic bag.", "description": "While this may sound weird, it is actually a really effective way to coat your roast in seasoning. Make sure the bag you use is sealable. Once your meat is in the bag, add two tablespoons of flour, one teaspoon kosher salt (or regular salt), one-half teaspoon of black pepper, and two teaspoons of garlic powder. Seal the bag and shake well until the meat is thoroughly coated in the seasoning. If you are following a specific roast recipe, such as wikiHow's recipe for  cranberry pork roast, you should follow the seasoning directions listed in the recipe.", "img": "https://www.wikihow.com/images/thumb/7/7e/Cook-a-Roast-Step-10-Version-2.jpg/v4-460px-Cook-a-Roast-Step-10-Version-2.jpg"}, {"summary": "Brown the meat.", "description": "In order to do this, place a tablespoon of olive oil in a large skillet. Bring it to a high heat, place the meat in the skillet and simply sear all sides of the meat so that they turn a golden brown color. Browning meat adds flavor to the roast.", "img": "https://www.wikihow.com/images/thumb/f/ff/Cook-a-Roast-Step-11-Version-2.jpg/v4-460px-Cook-a-Roast-Step-11-Version-2.jpg"}, {"summary": "Add any vegetables you are cooking with your roast.", "description": "Slow cooker are great because they are the epitome of the 'one-pot meal'. Simply through in your meat and vegetables and your dinner will cook itself. Place the vegetables in the cooker before the meat so that they absorb some of the meat's delicious flavors. Traditional slower cooker roast is made with carrots, potatoes, and onions but you can really cook whatever vegetables you want. Get creative! Just make sure to cut up whatever veggies you use into small chunks so that they cook more thoroughly. You can also cover the meat with the vegetables, or surround the meat with the veggies--it really is up to whatever you prefer.", "img": "https://www.wikihow.com/images/thumb/9/9d/Cook-a-Roast-Step-12-Version-2.jpg/v4-460px-Cook-a-Roast-Step-12-Version-2.jpg"}, {"summary": "Decide what liquid you would like to cook your roast in.", "description": "Many people choose to use a half cup of beef broth to slow cook their roasts in, as it adds to the natural flavor of the roast. Others use wine, cream of mushroom soup, water, or a variety of other ingredients like Worcestershire or soy sauce.", "img": "https://www.wikihow.com/images/thumb/8/8a/Cook-a-Roast-Step-13-Version-2.jpg/v4-460px-Cook-a-Roast-Step-13-Version-2.jpg"}, {"summary": "Cover your slow cooker and turn it to low.", "description": "The secret to a roast is cooking slowly, letting it absorb as much juice as possible. Use your cooker's low setting and let it do the rest of the work. Beef roasts should generally be left in the slow cooker for 8 to 10 hours, while pork roasts will generally be done after 6 or 7 hours.", "img": "https://www.wikihow.com/images/thumb/3/3c/Cook-a-Roast-Step-14-Version-2.jpg/v4-460px-Cook-a-Roast-Step-14-Version-2.jpg"}, {"summary": "Take the roast out of the slow cooker.", "description": "It should be tender and easy to cut. If you find that your roast isn't as moist as you want it to be when the cooking time is up, take it out of the cooker, cut it into smaller pieces, and return it to the cooker to absorb some more of the moisture. When it is done, slice it up and serve alongside the vegetables. Enjoy!", "img": "https://www.wikihow.com/images/thumb/7/74/Cook-a-Roast-Step-15-Version-2.jpg/v4-460px-Cook-a-Roast-Step-15-Version-2.jpg"}]}}