{"conversation": [{"text": "Do you like eggs? Are you looking for a new, exciting way to cook them? Let's make baked eggs in a basket! This is a quick and easy recipe with only two ingredients - would you like to learn how to make it?", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Sounds good, let's do it! I already have eggs but what else do I need?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Any type of bread that you have - which do you have at home? First let's begin by preheating the oven to 400°", "evidence": ["bread "], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have a wholemeal sliced loaf - will that be OK? I just heated the oven", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Any bread will work :) in fact wholemeal is a great option is healthier! This recipe is healthy already because we are baking instead of frying so now you will be super healthy!", "evidence": ["bread"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Excellent, I am trying to lose weight so this is good to know. What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Do you have a muffin pan or ramekins? If so, spray with cooking spray or line with baking paper. How does it look?", "evidence": ["Spray ramekins or a muffin pan with cooking spray, or line them with parchment paper."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok I am using a muffin pan. I sprayed it but it looks quite oily, I think I used too much spray, what should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That is no problem, the next step is to butter the bread on both sides but as you have a lot of oil already in the muffin pan then just skip the butter stage :) Now you need to put the bread inside each muffin tin so it covers the bottom. How many egg baskets are you going to make?", "evidence": ["Butter the bread"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you. I have 4 muffin holes so I will make 4 egg basket. OK the bread is all ready now, what is next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now you need to break one egg into each muffin hole - so 4 eggs in total. How does it look? Do the eggs fit perfectly on top of the bread?", "evidence": ["Break one egg into each ramekin or muffin tin"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes the eggs are all on top of the bread, one egg yolk has split and broken - is this a problem?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's fine, don't worry about the egg yolk breaking it will still be delicious. Ok the next step is to put the muffin tin with the egg baskets in the oven for around 20 mins.", "evidence": ["Place into the oven and bake for approximately 20 minutes,"], "id": "Agent", "dialog_act": "answer question"}, {"text": "OK - they in the oven now and the timer is on for 20 mins", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Make sure to keep checking on them in case they are ready before 20 mins :) What colour are the egg whites?", "evidence": ["until the egg whites are cooked"], "id": "Agent", "dialog_act": "ask question"}, {"text": "The egg whites have turned white - are they ready now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes that means the eggs have started to cook - if you like harder yolks you can leave them in for a few minutes longer but they are edible now - it is your choice :)", "evidence": ["If you would like harder yolks, cook for longer."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok I prefer the egg yolks a little runny so I will take them out. What happens now, are they ready to eat?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great, remove it from the oven and allow the tin to cool a little. Use a knife to loosen the bread, in case the bread is stuck to the tin.", "evidence": ["Remove from oven."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK, great. All the nests are loosened. It smells good, now can I eat them?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes you can put them onto plates now! How does it smell?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "It smells delicious!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "It will be even more delicious if you add some seasoning on top of the egg - do you have any salt, paprika, pepper or garlic? This will be good to enhance the flavour!", "evidence": ["prinkle seasonings such as salt, pepper, paprika, or garlic on top for flavor."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes I have all of those things! I will sprinkle a little of each. Do you have any other recommendations?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I love to add crispy bacon and avocado to mine! But I also like it with ham, cheese and tomatoes! What do you have that you can add?", "evidence": ["Other options include topping with shredded cheese, bacon or ham, tomatoes, or avocado."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have some avocado that I need to use up and some ham so I will add both of these! I am excited to eat it - I will try it now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "I hope you enjoy it! How is the egg yolk, is it runny? Is it bright yellow and orange?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes the egg is perfectly runny and bright orange - my favourite! Thanks for the recipe", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "You're welcome, I'm happy you like the recipe!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I will use it again in the future :)", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Bake Eggs in a Basket", "url": "https://www.wikihow.com/Make-Eggs-in-a-Basket", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy"], "procedure": [{"summary": "Preheat oven to 400°.", "description": "Spray ramekins or a muffin pan with cooking spray, or line them with parchment paper.", "img": "https://www.wikihow.com/images/thumb/9/95/Make-Eggs-in-a-Basket-Step-6-Version-3.jpg/v4-460px-Make-Eggs-in-a-Basket-Step-6-Version-3.jpg"}, {"summary": "Place bread in ramekins.", "description": "Butter the bread on both sides and fit into the ramekins or muffin pan. Press them gently into the ramekins, allowing the edges to fold over each other. Since this recipe is baked instead of fried, it is a healthier, calorie friendly variation. To cut calories and make a healthy dish, choose bread with less calories and carbs. To cut even more calories, do not butter the bread. Instead, place it in the ramekins as is. Another variation is to cut holes into a loaf of French bread instead of placing bread into the ramekins. Baking eggs into a French loaf is not a healthier, lower carb, calorie friendly option.", "img": "https://www.wikihow.com/images/thumb/c/c9/Make-Eggs-in-a-Basket-Step-7-Version-3.jpg/v4-460px-Make-Eggs-in-a-Basket-Step-7-Version-3.jpg"}, {"summary": "Bake the eggs.", "description": "Break one egg into each ramekin or muffin tin. Place into the oven and bake for approximately 20 minutes, or until the egg whites are cooked. If you would like harder yolks, cook for longer.", "img": "https://www.wikihow.com/images/thumb/9/92/Make-Eggs-in-a-Basket-Step-8.jpg/v4-460px-Make-Eggs-in-a-Basket-Step-8.jpg"}, {"summary": "Remove from oven.", "description": "After letting the ramekin or muffin tin cool, remove the bread bowls and place onto plates. Use a knife to loosen if the bread has stuck to the pan. Sprinkle seasonings such as salt, pepper, paprika, or garlic on top for flavor. Other options include topping with shredded cheese, bacon or ham, tomatoes, or avocado.", "img": "https://www.wikihow.com/images/thumb/b/b8/Make-Eggs-in-a-Basket-Step-9.jpg/v4-460px-Make-Eggs-in-a-Basket-Step-9.jpg"}]}}