{"conversation": [{"text": "Hello, today we are going to be baking a Jello Cake", "evidence": ["Prepare a white or yellow cake mix."], "id": "Agent", "dialog_act": "other"}, {"text": "Cool! Let's get started.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Start by getting a boxed cake mix, make this in a large bowl according to the box instructions.", "evidence": ["Prepare a white or yellow cake mix."], "id": "Agent", "dialog_act": "other"}, {"text": "I don't have prepared mix...", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No Problem, instead, weigh out 3 medium eggs together. Whatever the 3 eggs weigh, use equal amounts of butter, caster sugar and self raising flour to form your cake mix. Do you need more detailed instructions for this or do you know what you're doing?", "evidence": ["Prepare a white or yellow cake mix."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "A little more details. What's the size of cake we can make with 3 eggs?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The size of the cake should be big enough make 2 12 inch rounded cakes or 12 smaller cupcakes. Depending on what size you are looking for. Do you need further instructions to make the cake or do you know how to make a basic vanilla sponge of this kind?", "evidence": ["Use a sheet cake (9x11) baking pan."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Just to double check, are you sure 3 eggs are enough for 2 12-inch cakes or 12 cupcakes?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, from previous personal experience, this is the correct amount.", "evidence": ["Prepare a white or yellow cake mix."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, I believe you. Just one more question about the mix, what do you mean by \"equal amounts of butter, caster sugar and self raising flour\"?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The amount of butter you should add should be equivalent to the weight of the 3 eggs that you have weighed on your scales. You should mix this butter with your caster sugar until light and fluffy. You need to use the same weight of caster sugar to that of the weight of your 3 eggs. Once this is done, add a 5ml teaspoon vanilla extract before adding your 3 eggs. Mix this with a mechanical or hand whisk until it lightens in colour. It should be a light yellow colour. Once this is done, weigh out the same amount of your self raising flour to that of the weight of your eggs and gently fold it in with a spatula. We fold the flour in to avoid beating out the air from the mixture, as doing this would prevent the cake from rising.", "evidence": ["Prepare a white or yellow cake mix."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Wow this looks a little complicated. I'll use cake mix next time. Let's just assume the mix is ready.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Of course, would you like to make jello cupcakes or one big jello cake?", "evidence": ["Poke holes with a fork"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Big one. Cleaning cupcake tins is too troublesome.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Brilliant! Ensure you have greased your 12 inch cake tins with butter. This avoids the cake from sticking to the pan. Once this is done, you are ready to place half of your batter into one cake tin and the other half in the other. Place these filled tins into a preheated oven of Gas Mark 4 for 12-20minutes. You will know when they are done as they will not wobble in the middle and will look golden brown on top. Once you have confirmed that they are cooked, remove them from the oven and the baking tins, being careful not to burn yourself. Place the cooked cakes onto a cooling rack and allow them to cool for 15 minutes.", "evidence": ["Every cake's instructions are different, but most can be made in under 30 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks! But can you make the instructions shorter next time? There are many steps and it's a little hard for me to follow.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Of course, apologies for this. Once the cakes have cooled, poke them all over with a pointed utensil. Your holes should only go through the cake at half its depth.", "evidence": ["Poke holes with a fork."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it! Why do we want to do this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "This is to allow your jello mix to seep into the cake, giving it a lovely flavour.", "evidence": ["Combine 6 oz of Jello with 2 cups of boiling wate"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sounds good! Let", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Are you asking to move onto the next step? Your last message was incomplete...", "evidence": ["Combine 6 oz of Jello with 2 cups of boiling water."], "id": "Agent", "dialog_act": "other"}, {"text": "Yes. I'm sorry I pressed \"Enter\" by mistake.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "No problem :) Now you need to dissolve 6 ounces of Jello into 2 cups of boiling water. Make sure it is completely dissolved otherwise the jello will not set adequately on your cake.", "evidence": ["Combine 6 oz of Jello with 2 cups of boiling water."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "No problem! Let's move on!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now pour your dissolved jello mixture onto your cooled cakes. Pour half the mix on one cake and the remaining half on the other cake.", "evidence": ["Pour liquid Jello evenly over the cake."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Just did it!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Fab, now place the two cakes into the fridge to set for an hour or until the Jello is set and no longer runny.", "evidence": ["Place the cake in the refrigerator."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sure. Can you tell me what to do after it? I don't want to wait until then.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Of course, once the Jello is set you can decorate as you wish! Maybe use icing, sprinkles, melted chocolate.What do you think you might use to decorate the cakes?", "evidence": ["Spread a whipped topping over the top of cake."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Just fruit. I bought a box of fresh strawberries yesterday.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "That sounds delicious, I love strawberries! I bet it'd be nice drizzled with melted chocolate too! I love strawberries and chocolate together!", "evidence": ["Decorate with colorful candy sprinkles (optional), fruits, candles, and anything else that helps make the cake more festive."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Sure I can try that combination.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "what flavour Jello are you using for your cake?", "evidence": ["Enjoy your Jello “poke” cake"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Black cherry.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "That sounds amazing, I'd love to know how it turned out! What event are you making a cake for?", "evidence": ["Enjoy your Jello “poke” cake"], "id": "Agent", "dialog_act": "other"}, {"text": "It's for my son's graduation ceremony.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Aww, congratulations! I hope that the cake and your celebrations go really well. Have a great time and congrats on making a delicious cake :) Bye", "evidence": ["Enjoy your Jello “poke” cake"], "id": "Agent", "dialog_act": "other"}], "recipe": {"title": "How to Make Jello Cake", "url": "https://www.wikihow.com/Make-Jello-Cake", "category": ["Food and Entertaining", "Recipes", "Baking", "Cakes", "Sponge Cakes"], "procedure": [{"summary": "Prepare a white or yellow cake mix.", "description": "Follow the box's directions. Use a sheet cake (9x11) baking pan. This is an ideal size as it allows the cake to cook evenly. If you want to get really creative, use different flavors of cake mix too. Some people prefer the taste of angel food cake. Experiment with other flavors to find what you like. Every cake's instructions are different, but most can be made in under 30 minutes. You can also use a cupcake pan and make individual sized Jello cakes. These are great for kids' parties. Let the cake cool for at least 15 minutes. To avoid burning yourself and to help the Jello to congeal on your cake, it should be at room temperature.", "img": "https://www.wikihow.com/images/thumb/0/0e/Make-Jello-Cake-Step-1-Version-2.jpg/v4-460px-Make-Jello-Cake-Step-1-Version-2.jpg"}, {"summary": "Poke holes with a fork.", "description": "This can be done with a fork, chopsticks, or any other pointed cooking utensil. Holes should not go all the way through the cake to the bottom of the pan. Holes should be made every 1/2 - 3/4 inch (1-2 centimeters).", "img": "https://www.wikihow.com/images/thumb/0/0f/Make-Jello-Cake-Step-2-Version-2.jpg/v4-460px-Make-Jello-Cake-Step-2-Version-2.jpg"}, {"summary": "Combine 6 oz of Jello with 2 cups of boiling water.", "description": "Stir until completely  dissolved. If you do not dissolve the Jello mix entirely, it will clump and not congeal properly. If you decide to make a layered Jello cake, use 1 box of gelatin for each layer. You could coordinate for holidays such as red and blue gelatin for the 4th of July. This is also a good idea, if you are trying to accommodate a lot of people who prefer different flavors. For a vegan option, use Weikfield jelly based on agar-agar (a seaweed). It is available in India and in Indian stores worldwide. It works just like Jello for this recipe. Jello is not a vegan dessert. Gelatin is a protein produced by partial hydrolysis of collagen extracted from the various animal parts.", "img": "https://www.wikihow.com/images/thumb/9/9b/Make-Jello-Cake-Step-3-Version-2.jpg/v4-460px-Make-Jello-Cake-Step-3-Version-2.jpg"}, {"summary": "Pour liquid Jello evenly over the cake.", "description": "The holes you made in the cake allow Jello to seep into the cake. Most people prefer that the Jello be evenly spread throughout the cake, giving each bite an equal portion of cake and Jello. Feel free to get creative. Maybe spell out a person’s name if it is their birthday. Make elaborate Jello designs. You might even consider combining several flavors of Jello to give your cake a pop of color.", "img": "https://www.wikihow.com/images/thumb/0/09/Make-Jello-Cake-Step-4-Version-2.jpg/v4-460px-Make-Jello-Cake-Step-4-Version-2.jpg"}, {"summary": "Place the cake in the refrigerator.", "description": "Let sit for about 1 hour or until the gelatin solidifies.", "img": "https://www.wikihow.com/images/thumb/e/e5/Make-Jello-Cake-Step-5-Version-2.jpg/v4-460px-Make-Jello-Cake-Step-5-Version-2.jpg"}, {"summary": "Spread a whipped topping over the top of cake.", "description": "Decorate with colorful candy sprinkles (optional), fruits, candles, and anything else that helps make the cake more festive. You might consider mixing in some fun food coloring into your whipped topping to give it a splash of color.", "img": "https://www.wikihow.com/images/thumb/6/6b/Make-Jello-Cake-Step-6-Version-2.jpg/v4-460px-Make-Jello-Cake-Step-6-Version-2.jpg"}, {"summary": "Enjoy your Jello “poke” cake.", "description": "", "img": "https://www.wikihow.com/images/thumb/b/bb/Make-Jello-Cake-Step-7.jpg/v4-460px-Make-Jello-Cake-Step-7.jpg"}]}}