{"conversation": [{"text": "Hello there! Would you like to learn how to cook quail eggs?", "evidence": ["Recipe"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, I'd like to.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Great. The first step is to gently boil 5 cm of water in a small frying pan, and turn down to simmering.", "evidence": ["Fill a small frying pan with approximately 2 inches (5 cm) of water", "As soon as the water boils, turn down the heat so that the water is just barely simmering"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'm done.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Keeping the water simmering, saw an opening in the shell of each egg with a knife, and pour each inner egg into a separate ramekin.", "evidence": ["Open the eggs carefully to avoid breaking the yolk", "saw through the shell and membrane at one end, then pour the inner egg into the ramekin", "you should only cook three to four eggs at a time."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What is ramekin?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "A ramekin is a small ceramic dish. You should use one ramekin per egg, and cook no more than 3-4 eggs at once.", "evidence": ["you should only cook three to four eggs at a time"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I don't have it. Can I use a bowl instead?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Yes you can use a bowl. The important thing is to open each egg carefully to preserve the yolk.", "evidence": ["Open the eggs carefully to avoid breaking the yolk"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Okay, what's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "With your bowl as close to the boiling water as possible, slide each egg from the bowl into the simmering water. The eggs should be spaced apart, not touching each other.", "evidence": ["Carefully pour each egg into the bubbling water. ", "Space the eggs apart so that they do not touch one another", "as close to the surface of the water as possible"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oops, I have added too many eggs and it's very hard to keep them apart.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Continue cooking for about 1 minute. You can try to separate the eggs with a spatula.", "evidence": ["Cook the eggs for about 1 minute"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Don't have one. I'll use a spoon instead.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Okay! You can use the spoon to remove the eggs as soon as the yolks are cooked as you like them.", "evidence": ["until the whites are set and the yolk has reached your desired level of doneness"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "So that's it? Don't I turn the eggs?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, they will cook fine without turning, as they are cooked evenly in the water. Place the eggs on paper towels on a plate, to absorb excess water.", "evidence": ["Transfer them to a plate lined with paper towels"], "id": "Agent", "dialog_act": "answer question"}, {"text": "That sounds easier than frying.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You can now serve the quail eggs. You can serve on top of a green salad or cooked vegetables if you like.", "evidence": ["atop simple green salads or cooked green vegetables"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I'm just wondering don't we need to add seasonings?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You may season with a little salt and black pepper if you so wish.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Does it happen when cooking in the pot?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, you should cook the eggs only in the water. They can be enjoyed as there are.", "evidence": ["but you can also enjoy them separately"], "id": "Agent", "dialog_act": "answer question"}, {"text": "No, I mean do I add salt to the water during cooking?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, water without salt is fine. How do the eggs look now? Are they cooked?", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes, I think so. They are firm.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Excellent. You can now serve warm on top of a salad or vegetables.", "evidence": ["served atop simple green salads or cooked green vegetables"], "id": "Agent", "dialog_act": "teach new step"}], "recipe": {"title": "How to Cook Quail Eggs", "url": "https://www.wikihow.com/Cook-Quail-Eggs", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy"], "procedure": [{"summary": "Simmer the water.", "description": "Fill a small frying pan with approximately 2 inches (5 cm) of water. Bring the water to a gently boil over medium-high heat. As soon as the water boils, turn down the heat so that the water is just barely simmering. The water must bubble at a gentle pace before you add the eggs.", "img": "https://www.wikihow.com/images/thumb/d/db/Cook-Quail-Eggs-Step-11.jpg/v4-460px-Cook-Quail-Eggs-Step-11.jpg"}, {"summary": "Meanwhile, crack the eggs.", "description": "As the water boils, crack each of the eggs into separate ramekins. Open the eggs carefully to avoid breaking the yolk. Use a serrated knife to carefully saw through the shell and membrane at one end, then pour the inner egg into the ramekin through that opening. Ideally, you should only cook three to four eggs at a time. For larger amounts, you may need to work in batches.", "img": "https://www.wikihow.com/images/thumb/1/13/Cook-Quail-Eggs-Step-12.jpg/v4-460px-Cook-Quail-Eggs-Step-12.jpg"}, {"summary": "Slide the eggs into the water.", "description": "Carefully pour each egg into the bubbling water. Space the eggs apart so that they do not touch one another. Position the edge of the ramekin as close to the surface of the water as possible before pouring in the egg. Doing so will allow the egg to gently slide into the water, thereby preserving the yolk.", "img": "https://www.wikihow.com/images/thumb/b/b6/Cook-Quail-Eggs-Step-13.jpg/v4-460px-Cook-Quail-Eggs-Step-13.jpg"}, {"summary": "Cook until set.", "description": "Cook the eggs for about 1 minute, or until the whites are set and the yolk has reached your desired level of doneness. Use a spatula to carefully remove the finished eggs from the water. Transfer them to a plate lined with paper towels so that the water may drain.", "img": "https://www.wikihow.com/images/thumb/c/cd/Cook-Quail-Eggs-Step-14.jpg/v4-460px-Cook-Quail-Eggs-Step-14.jpg"}, {"summary": "Serve warm.", "description": "Serve the eggs immediately. Poached quail eggs are typically served atop simple green salads or cooked green vegetables, but you can also enjoy them separately. If you need to save the eggs for later, keep them in a bowl of ice water for up to several hours. Reheat the eggs in simmering water for 30 seconds, or until heated through, before serving.", "img": "https://www.wikihow.com/images/thumb/2/2d/Cook-Quail-Eggs-Step-15.jpg/v4-460px-Cook-Quail-Eggs-Step-15.jpg"}]}}