{"conversation": [{"text": "Do you want to make mango jam, it is quick and comes out delicious?", "evidence": ["Rinse the mangoes and put them on a cutting board. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Sounds good to me!", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Rinse and carefully cut down the pieces , use small knife then it would be easy to remove the most fruit.", "evidence": ["Slice the flesh from 6 or 7 large mangoes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What pieces? Can you be more specific?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "We are talking about mango jam so it would be mango fruit pieces. you need to add around 4 cups of mango pieces with sugar, lemon, and thickining fiber pectin in the pot and cook on low heat.", "evidence": ["Put the mango pieces in a pot with sugar, lemon juice, and pectin"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "No problem. How long does it take or how do I know it's ready?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Stir the mixture every few minutes until it becomes liquidy. It should take around 3 to 4 minutes for  sugar to dissolve , use a large pot and keep stirring the jam. You keep stirring the jam as it bubbles and thickens. it will take a while.", "evidence": ["Stir the mixture and cook it over low heat until the sugar dissolves", "Stir the mixture and cook it over low heat until the sugar dissolves"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I forgot to ask when you mentioned the previous step about adding sugar. How much do I need?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Around 200 g of sugar , 59ml of lemon juice and 25g of pectin.", "evidence": [". Add 1 cup (200 g) of sugar, 4 tablespoons (59 ml) of lemon juice, and 2 tablespoons (25 g) of powdered pectin."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Thanks for your information! I am stirring the fruit mixture. It's getting mushy. Are you sure we don't need to add water?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Use medium heat and when you see that the syrup is thickening means it is ready. If you have instant read thermometer then you can check jam temperature , it should be cooked until it reaches to 104 c.", "evidence": ["Bring the jam to a boil over medium-high heat."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Unfortunately I don't have one. But it looks ready.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Great, Now store this jam into sterilized jars. Carefully spoon the mango jam into the jar and leave 1/4 inch headspace. Cover the jar with secure and airtight lid.", "evidence": ["Spoon the jam into sterilized jars"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Just finished this step.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can store these jars in the refrigerator for upto 3 weeks or you can process the jam and use it for longer period.", "evidence": ["Process the jars or store them in the refrigerator."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great! I'd like to enjoy it right now. What do you recommend I can eat with the jam?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "With bread or crumpet , it would be delicious with any bread or even with butter croissants. :)", "evidence": [" eat the jam."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Got it. What else should I know?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Only use sterlized jars to keep mango jam fresh and tasty for 3 weeks. Thats it.", "evidence": [" sterilized jars"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thanks for your help today!", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No problem, Enjoy the jam and if you need to know anything just ask.", "evidence": ["mango jam"], "id": "Agent", "dialog_act": "answer question"}], "recipe": {"title": "How to Make Mango Jam", "url": "https://www.wikihow.com/Make-Mango-Jam", "category": ["Food and Entertaining", "Recipes", "Jams Preserves and Condiments", "Jams and Jellies"], "procedure": [{"summary": "Slice the flesh from 6 or 7 large mangoes.", "description": "Rinse the mangoes and put them on a cutting board. Hold a mango against the board and carefully cut down 1 side of it. Try to cut as close to the seed in the center, so you're able to remove the most fruit. Then, slice down the other side of the mango. Scoop the flesh from both pieces and chop it into ⁄2 inch (1.3 cm) pieces. Use a small knife to trim the flesh around the seed itself. You should get around 4 cups (660 g) of mango pieces.", "img": "https://www.wikihow.com/images/thumb/d/d8/Make-Mango-Jam-Step-1-Version-4.jpg/v4-460px-Make-Mango-Jam-Step-1-Version-4.jpg"}, {"summary": "Put the mango pieces in a pot with sugar, lemon juice, and pectin.", "description": "Place the chopped mango in a large pot on the stove. Add 1 cup (200 g) of sugar, 4 tablespoons (59 ml) of lemon juice, and 2 tablespoons (25 g) of powdered pectin. The pectin helps the jam set up. If you prefer a looser jam, you can leave the pectin out.", "img": "https://www.wikihow.com/images/thumb/f/fe/Make-Mango-Jam-Step-2-Version-4.jpg/550px-nowatermark-Make-Mango-Jam-Step-2-Version-4.jpg"}, {"summary": "Stir the mixture and cook it over low heat until the sugar dissolves.", "description": "Stir well so the mango pieces are coated with the sugar. Continue to stir the mixture every few minutes until the sugar dissolves and becomes liquidy. It should take about 3 to 4 minutes for the sugar to dissolve.", "img": "https://www.wikihow.com/images/thumb/0/00/Make-Mango-Jam-Step-3-Version-4.jpg/550px-nowatermark-Make-Mango-Jam-Step-3-Version-4.jpg"}, {"summary": "Bring the jam to a boil over medium-high heat.", "description": "Turn the burner up so the liquid becomes syrupy and starts to bubble vigorously. Stir the jam occasionally to prevent it from sticking to the pot or boiling over. It's important to use a large pot so the jam doesn't bubble over as it cooks.", "img": "https://www.wikihow.com/images/thumb/3/38/Make-Mango-Jam-Step-4-Version-4.jpg/550px-nowatermark-Make-Mango-Jam-Step-4-Version-4.jpg"}, {"summary": "Cook the mango jam until it reaches 220 °F (104 °C).", "description": "Clip a candy thermometer to the side of the pot or occasionally insert an instant-read thermometer into the jam to see if the jam has reached the setting temperature of 220 °F (104 °C). Stir the jam occasionally as it bubbles and thickens.Tip: If you don't have a thermometer, place a small plate in the freezer when you begin to make the jam. To test if the jam has set, spoon a coin-sized amount onto the chilled plate and push your finger into it. The jam should wrinkle and hold its shape. Skim off foam that floats to the top of the jam and discard it since becomes rubbery if you leave it in the jam.", "img": "https://www.wikihow.com/images/thumb/4/43/Make-Mango-Jam-Step-5-Version-3.jpg/v4-460px-Make-Mango-Jam-Step-5-Version-3.jpg"}, {"summary": "Spoon the jam into sterilized jars.", "description": "Get out 2 sterilized half-pint jars and place a funnel on a jar. Carefully spoon the mango jam into the jar and leave ⁄4 inch (0.64 cm) headspace. Place a sterilized lid on the jar and screw on a band until it's finger tight. Although you can soften the lids in hot water before pressing them on the jars, you don't have to in order to get a good seal.", "img": "https://www.wikihow.com/images/thumb/8/89/Make-Mango-Jam-Step-6-Version-3.jpg/550px-nowatermark-Make-Mango-Jam-Step-6-Version-3.jpg"}, {"summary": "Process the jars or store them in the refrigerator.", "description": "For long-term storage, place the jars in a water bath so they're covered by at least 1 inch (2.5 cm) of water. Boil the jars for 10 minutes and then set the jars aside until the jars are at room temperature. If you don't want to can the jam, put the jars in the refrigerator and use them within 3 weeks. If you process the jam, store the jars at room temperature for up to 1 year. Press down on the lid to check that the seal doesn't pop back up before you open the jar and eat the jam.", "img": "https://www.wikihow.com/images/thumb/a/a5/Make-Mango-Jam-Step-7-Version-4.jpg/v4-460px-Make-Mango-Jam-Step-7-Version-4.jpg"}]}}