{"conversation": [{"text": "Hi there, hope your day is going well. How can I help you with this recipe", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I am interested in cooking Country style ribs, I have all the ingredients, how do I start preparing this?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's great that you have all the ingredients already! You first need to preheat the oven to 300 degrees F or 149 degrees C and you need to line a baking sheet with foil and parchment paper and lay the ribs out in a single layer. After you have done that, please cover the ribs with foil and bake them for at least 2 hours.", "evidence": ["Preheat the oven to 300 °F (149 °C)", " lay the ribs out in a single layer", "Cover the ribs with foil and bake them for 2 hours"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay fantastic, what's the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "After the ribs have been baked for at least 2 hours, remove the ribs and drain the grease into a can to throw away later. If however, the ribs don't seem tender, please cook the ribs for a further 15-30 minutes. After you have done this you can brush the ribs with sauce for added flavour.", "evidence": ["Take the ribs out to pour off the grease", " drain the grease into a can to throw away later", "Brush the ribs with sauce"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yep cool, what kind of sauce is best to use to brush the ribs with?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Good question, barbecue sauce is generally recommended to brush ribs with. Really any thick saucer that has oil in it will do the job. Alternatives include teriyaki and hoisin sauces.", "evidence": ["Barbecue sauce works greats", "You can also try teriyaki sauce, hoisin sauce"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay great, I'll probably be using teriyaki sauce as I've got some leftover. Are there any steps after this?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yep so after brushing the ribs with sauce, you need to turn the oven to 350 degrees F or 177 degrees C and put the ribs back in uncovered, and the ribs cook for 15-30 minutes, which starts caramelizing the sauce. Turn and brush the ribs with sauce every 15-30 minutes until they're tender. Overall this process should take about 90 minutes.", "evidence": ["350 °F (177 °C) and put the ribs back in", "Leave the ribs uncovered, and let them cook for 15-30 minutes", "urn and baste the ribs every 15-30 minutes "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay fantastic, and after that are the ribs all good to eat?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yep almost! You'll need to add one more layer of barbecue sauce and broil the ribs for 1-2 minutes to caramelize the sauce. It's important to watch the ribs closely when they're broiling and take them out before they start boiling", "evidence": ["Broil the ribs for 1-2 minutes"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Alright thanks so much, are there any things I need to look out for when cooking these ribs?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I think you're pretty much all good to go! If you're cooking a lot of ribs, you might need to use multiple trays if the ribs don't fit on one single layer.", "evidence": ["2 trays if the ribs won't fit on one in a single layer"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay great, any suggestions on the type of ribs?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can use both bone-in or boneless ribs! There really isn't any specified type of ribs that you need to cook with.", "evidence": ["You can use bone-in or boneless ribs."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Alright great thanks! That's all the questions I have, really appreciate the help.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Cook Country Style Ribs", "url": "https://www.wikihow.com/Cook-Country-Style-Ribs", "category": ["Food and Entertaining", "Recipes", "Meat", "Pork"], "procedure": [{"summary": "Preheat the oven to 300 °F (149 °C) and prep the ribs.", "description": "Let the oven heat up while you're getting the ribs ready. Line a rimmed baking sheet with foil or parchment paper and lay the ribs out in a single layer. Sprinkle salt and pepper on both sides. Use 2 trays if the ribs won't fit on one in a single layer. You can use bone-in or boneless ribs.", "img": "https://www.wikihow.com/images/thumb/6/65/Cook-Country-Style-Ribs-Step-1-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-1-Version-2.jpg"}, {"summary": "Cover the ribs with foil and bake them for 2 hours.", "description": "Use foil to make a tight lid over the ribs. Let them cook for at least 2 hours. Don't take them out of the oven  during this time. You don't even really need to check on them. Basically, you're braising the ribs in their own juice at this point, as they will render fat and liquid as they cook.", "img": "https://www.wikihow.com/images/thumb/a/aa/Cook-Country-Style-Ribs-Step-2-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-2-Version-2.jpg"}, {"summary": "Take the ribs out to pour off the grease.", "description": "Carefully uncover the ribs, as the steam will be hot. Remove the ribs from the pan momentarily, and drain the grease into a can to throw away later. Set the ribs back on the baking tray. If the ribs don't seem tender when you uncover them, put them back in the oven under the cover for another 15-30 minutes. They should be starting to soften but not fully tender yet.", "img": "https://www.wikihow.com/images/thumb/8/80/Cook-Country-Style-Ribs-Step-3-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-3-Version-2.jpg"}, {"summary": "Brush the ribs with sauce.", "description": "You can use any kind of sauce you want or even make your own. Place the ribs back on the pan before brushing the tops with sauce. Just use enough to coat the ribs thoroughly. Barbecue sauce works greats for this purpose! You can also try teriyaki sauce, hoisin sauce, or really any thick sauce that has some oil in it.", "img": "https://www.wikihow.com/images/thumb/d/d8/Cook-Country-Style-Ribs-Step-4-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-4-Version-2.jpg"}, {"summary": "Turn the oven up to 350 °F (177 °C) and put the ribs back in.", "description": "Leave the ribs uncovered, and let them cook for 15-30 minutes at this temperature. This process will start caramelizing the barbecue sauce.", "img": "https://www.wikihow.com/images/thumb/5/57/Cook-Country-Style-Ribs-Step-5-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-5-Version-2.jpg"}, {"summary": "Turn and baste the ribs every 15-30 minutes until they're tender.", "description": "Pull the ribs out of the oven and turn them over. Brush barbecue sauce on the other side. Put them back in the oven to heat some more. Repeat the process until the ribs are tender and falling off the bone, which should take about 90 minutes.", "img": "https://www.wikihow.com/images/thumb/0/04/Cook-Country-Style-Ribs-Step-6-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-6-Version-2.jpg"}, {"summary": "Broil the ribs for 1-2 minutes at the end to caramelize the sauce.", "description": "Once the ribs seem tender enough, add one more layer of barbecue sauce. Watch them closely while they're broiling, and take them out before they start burning.", "img": "https://www.wikihow.com/images/thumb/c/cc/Cook-Country-Style-Ribs-Step-7-Version-2.jpg/v4-460px-Cook-Country-Style-Ribs-Step-7-Version-2.jpg"}]}}