{"conversation": [{"text": "Hi. Are you ready to start cooking?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes! What are we making today?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "We are making spicy cheese and scallion scones", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Cool. What is the first step?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I want you to preheat your oven to 191 degrees celsius and gather together your ingredients as well as 2 bowls (1 large and 1 small), 1 whisk, 1 sharp knife, 1 spoon, 1 fork and a greased baking sheet", "evidence": ["Set your oven to 375 F (191 C).", "one large and one small bowl, a whisk, a greased baking sheet, a sharp knife, and a spoon or fork", "also need your ingredients"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, done. What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "I want you to place the flour, salt and baking powder into the large bowl, whisk together, then add the butter. Using your fingers, I want you to work the butter into the flour mix", "evidence": ["Sift or whisk together the flour, salt, and baking powder in a large bowl", "use your fingers to work the butter into the flour"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I just rub the butter and flour together? How do I know when it's ready?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, just work the butter into the flour mix. You will know the mix is ready when it comes together to form pea-sized crumbs.", "evidence": ["the dry ingredients and butter to come together into pea-sized crumbs"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, thank you. I will do it now.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Are you ready to move on? Is the mixture resembling the pea sized crumbs I mentioned earlier?", "evidence": ["You want the dry ingredients and butter to come together into pea-sized crumbs"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes. What do I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "The next step is to add the scallions to the flour and butter mix. So use the sharp knife to cut the tips and ends from the scallions then rinse them under cold water. After you have rinsed them, you should mince them up with the knife.", "evidence": ["Trim the tips and ends off the scallions and rinse them under cold water", "With the knife, mince them into small pieces"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Mince them up? How do I do that?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Just use the sharp knife to cut them into small pieces.", "evidence": ["With the knife, mince them into small pieces"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, will do now. Thank you.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Do you like ham? If you would like, you can also cut cooked ham into small pieces and add them when you add the scallions. Have you finished chopping the scallions now?", "evidence": ["you can also cut up some cooked ham into small bites as well to make ham and cheese scones."], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, just finished adding the scallions now. I will also add some ham. What is the next step after that?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "After you have added the scallions, add the cheese to the flour and butter mixture. Then, in the small bowl, you should whisk the eggs and milk together, before adding them to the larger bowel.", "evidence": ["Add the cheese and scallions to the flour and butter mixture", "In a separate bowl, whisk together the eggs and milk, then add them to the large bowl"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, so mix the eggs and milk together separately first then add to the flour mixture, is that correct?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes. Use your whisk and small bowl to mix the eggs and milk together then add them to the flour mixture.", "evidence": [" In a separate bowl, whisk together the eggs and milk, then add them to the large bowl"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, thank you for clarifying.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Are the two mixes well combined? Are you ready to move on?", "evidence": [], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, just finished mixing them now. What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, I want you to add the mustard and hot sauce to the mixture", "evidence": ["Add the mustard and hot sauce as well."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Mustard? What kind of mustard?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can use either spicy, horseradish or Dijon", "evidence": ["Good mustard choices for these scones include spicy, horseradish, and Dijon"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, and what if I dont like mustard? Do I still need to add it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "If you don't like mustard you can leave it out of this recipe.", "evidence": ["Both the mustard and hot sauce are optional ingredients in this recipe."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay thank you. What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now, you should place the dough on a floured surface and roll the dough out. Be sure to lightly flour your hands and roll the dough so that its 20-23cm in diameter and around 2.5cm thick", "evidence": ["Turn the dough out onto a lightly floured surface.", "With lightly floured hands, roll the dough out into a circle with a diameter of eight or nine inches (20 or 23 cm), and a thickness of about one inch (2.5 cm)"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Flour my hands? How do I do that?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You can just place your hands onto the floured surface so that they pick up some of the flour.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, thank you. What do I do after I have rolled the dough out?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next, I want you to cut the dough in half, horizontally, then in half vertically", "evidence": ["Cut the dough in half horizontally, then again vertically"], "id": "Agent", "dialog_act": "teach new step"}], "recipe": {"title": "How to Make Spicy Cheese and Scallion Scones", "url": "https://www.wikihow.com/Make-Cheese-Scones", "category": ["Food and Entertaining", "Recipes", "Baking", "Scones"], "procedure": [{"summary": "Heat the oven and gather your equipment.", "description": "Set your oven to 375 F (191 C). For this recipe, you will also need your ingredients, one large and one small bowl, a whisk, a greased baking sheet, a sharp knife, and a spoon or fork. Instead of greasing the baking sheet, you can line it with parchment paper or a silicone baking sheet.", "img": "https://www.wikihow.com/images/thumb/0/03/Make-Cheese-Scones-Step-9.jpg/v4-460px-Make-Cheese-Scones-Step-9.jpg"}, {"summary": "Work the butter into the dry ingredients.", "description": "Sift or whisk together the flour, salt, and baking powder in a large bowl. Then, use your fingers to work the butter into the flour. You want the dry ingredients and butter to come together into pea-sized crumbs. You can use a pastry cutter or two table knives instead of your hands to work the butter into the dry ingredients.", "img": "https://www.wikihow.com/images/thumb/7/74/Make-Cheese-Scones-Step-10-Version-2.jpg/v4-460px-Make-Cheese-Scones-Step-10-Version-2.jpg"}, {"summary": "Cut the scallions.", "description": "Trim the tips and ends off the scallions and rinse them under cold water. With the knife, mince them into small pieces. For an extra savory dish, you can also cut up some cooked ham into small bites as well to make ham and cheese scones. Add them to the mixture when you add the scallions.", "img": "https://www.wikihow.com/images/thumb/6/6b/Make-Cheese-Scones-Step-11-Version-2.jpg/v4-460px-Make-Cheese-Scones-Step-11-Version-2.jpg"}, {"summary": "Add the remaining ingredients.", "description": "Add the cheese and scallions to the flour and butter mixture. In a separate bowl, whisk together the eggs and milk, then add them to the large bowl. Add the mustard and hot sauce as well. Instead of milk, you can also substitute in cream, ricotta cheese, or sour cream for a richer and slightly heavier scone. Good mustard choices for these scones include spicy, horseradish, and Dijon. Both the mustard and hot sauce are optional ingredients in this recipe. Leaving them out will result in a tasty scone that isn't spicy.", "img": "https://www.wikihow.com/images/thumb/e/ef/Make-Cheese-Scones-Step-12-Version-2.jpg/v4-460px-Make-Cheese-Scones-Step-12-Version-2.jpg"}, {"summary": "Roll and cut the dough.", "description": "Turn the dough out onto a lightly floured surface. With lightly floured hands, roll the dough out into a circle with a diameter of eight or nine inches (20 or 23 cm), and a thickness of about one inch (2.5 cm). Cut the dough in half horizontally, then again vertically. For smaller scones, cut each of those quarters into thirds, for a total of 12 scones. For larger scones, cut each quarter in half, for a total of eight scones.", "img": "https://www.wikihow.com/images/thumb/e/e7/Make-Cheese-Scones-Step-13-Version-2.jpg/v4-460px-Make-Cheese-Scones-Step-13-Version-2.jpg"}, {"summary": "Bake and serve.", "description": "Arrange the scones on the baking sheet, leaving at least one inch (2.5 cm) of space between them. Bake them for 20 to 23 minutes. They are ready when they turn golden brown and are firm to the touch. Remove the scones from the oven when they're cooked and serve immediately, as soon as they're cool enough to be touched without burning the hands. They can also be served warm or at room temperature. Place leftovers in an air-tight container and store at room temperature for up to a few days.", "img": "https://www.wikihow.com/images/thumb/6/6e/Make-Cheese-Scones-Step-14.jpg/v4-460px-Make-Cheese-Scones-Step-14.jpg"}]}}