{"conversation": [{"text": "Put the wood chips in the middle of a heavy-duty aluminium foil sheet.", "evidence": ["Place the wood chips in the middle of a sheet of heavy-duty aluminium foil."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have put the chips on the foil sheet, what should I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You should fold the ends of the foil together like a burrito to wrap the wood chips and please poke about 10 holes into the foil with a fork or knife, make sure you are careful not to injure yourself!", "evidence": ["Fold all the ends of the foil together so that it looks like a burrito, with the wood chips wrapped inside.", "poke about 10 holes in it with a fork or knife. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "That's a funny way to put it but why do I need to put holes in it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The holes will let the smoke escape from your 'burrito' (: Are you ready for the next step?", "evidence": ["This will let the smoke escape."], "id": "Agent", "dialog_act": "answer question"}, {"text": "That makes sense, I just finished making the holes so I'm ready, thank you!", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Great! Would you be able to lift up your grill grate and place the pouch directly onto the burner shield? If not, you are able to place the pouch directly onto the grate. Then, it's time to light your grill! Make sure the heat is on high (:", "evidence": ["Try lifting your grill grate and putting the pouch on the burner shield.", "simply put your pouch directly on the grate.", "Light your grill and turn the heat to high."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "The grill plate cannot move so I just put it on the grate, heat is on high, what's next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "When your pouch begins to smoke, it's time to turn off all the burners except the one under your pouch. Place the turkey legs on the grill, on the side without any flames, and make sure to leave the pouch inside or else you won't get your lovely smoked turkey legs!", "evidence": ["Turn off all the burners except one and put your meat on the grill.", "Leave the burner under the foil pouch on.", "Place the turkey legs on the side where the burner is turned off."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, flames are off and the meat is on! But how will the meat cook if there is no flames?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The heat from the flame under the pouch will allow the meat to smoke from the indirect heat. If you can, try to elevate the meat above the pouch to allow the smoke to circulate around the meat, although you did say that you were not able to move the plate so don't stress if you can't elevate the meat, it will still taste amazing! What does it smell like now? Does it smell nice and smoky?", "evidence": ["This way it will smoke with indirect heat", "try elevating your turkey legs off the rack so that they’re higher than the pouch", "lets the smoke circulate all around the meat", "Don’t worry if you can’t elevate the meat", "It will still taste good"], "id": "Agent", "dialog_act": "answer question"}, {"text": "That's ok, I can't move the plate so I'm glad it will still taste good! It smells smoky and like it might be starting to cook, how long do I need to smoke it for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Awesome, you will need to smoke the turkey legs for approximately 2.5-3.5 hours for best results, please close the lid and turn the heat down to medium. This ensures that the temperature of the grills remains between 245ºF (118ºC) and 260ºF (127ºC), but make sure that you smoke the legs until they reach an internal temperature of 165ºF (74ºC). Do you have a meat thermometer handy to keep an eye on the temperature?", "evidence": ["Smoke the turkey legs for about 2 ½ to 3 ½ hours", "Close the lid and turn the heat to medium", "Keep the temperature of the grill between 245 °F (118 °C) and 260 °F (127 °C", "Smoke the turkey legs until they reach an internal temperature of 165 °F (74 °C).", "Check them with a meat thermometer."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Temperature is down and meat thermometer is at the ready, but the smoke pouch has stopped smoking, what should I do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Please make sure you check every once in a while to ensure that it is still smoking, since you said that it has stopped, you should make a new pouch and place it on the heated burner! How does the turkey legs look? Are they nice and browned yet? It is almost the 3 hour mark, how's the temperature looking?", "evidence": ["Lift the lid and check once in a while to make sure that the foil pouch is still smoking", "If it’s stopped smoking, make a new one and place it on the heated burner."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I have made a new pouch and the legs are a bit brown but not dark yet, the temperature is 70ºC but I'm not sure when they should be done, what do you think?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Could you please describe the colour of the brown a bit more? We are looking for a deep brown with char marks, but we don't want it to burn! The internal temperature should be 74ºC before you take them off the grill, might I suggest leaving them on the grill for a few more minutes before checking again.", "evidence": [], "id": "Agent", "dialog_act": "answer question"}, {"text": "Oh, they aren't that dark, so I don't think they have burnt, but I can see the char marks! The internal temperature just hit 74ºC, what should I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Amazing! Now that they have hit 74ºC, it's time to let them rest. Please set the turkey legs aside for about 5 minutes and then it's time to dig in! Make sure you enjoy them warm for best results, if you have any left overs (but I don't expect you to as they are delicious), you can refrigerate the legs for up to 3-4 days or freeze them for 2-3 months. Please make sure you keep them in an airtight container or wrapped nice and tight with foil or plastic wrap. Is there anything else that I can assist you with?", "evidence": ["Set them aside on a plate for at least 5 minutes", " Eat them warm", "Refrigerate any leftovers for 3-4 days, or freeze them for 2-3 months", "airtight container or tightly wrapped in plastic wrap or aluminium foil"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Oh no, waiting 5 minutes will be torture but they smell delicious so I will wait. No thank you, I'm just waiting for them to rest so I can dig in! Don't think there will be any left overs but I will definitely keep that in mind. Thank you for your assistance!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Amazing, the wait will definitely be worth it! Enjoy your meal, it has been a pleasure working with you today (:", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you so much, have a great day!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You too, goodbye (:", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Goodbye, just about to dig in so I'll let you go!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Smoke Turkey Legs", "url": "https://www.wikihow.com/Smoke-Turkey-Legs", "category": ["Food and Entertaining", "Recipes", "Meat", "Poultry Recipes"], "procedure": [{"summary": "Consider soaking  1 cup (240 mL) of wood chips for 30 minutes.", "description": "Buy wood chips at your local box store or home improvement store. Soak them in a bowl of water and drain after about half an hour. Some people believe that soaking wood chips prevents them from burning up too fast, while others contend that they won't start smoldering until they dry out anyway. Experiment with soaked and unsoaked wood chips to see which you prefer using. Try apple wood chips for a good aroma pairing with poultry.", "img": "https://www.wikihow.com/images/thumb/2/2d/Smoke-Turkey-Legs-Step-9.jpg/v4-460px-Smoke-Turkey-Legs-Step-9.jpg"}, {"summary": "Fold the wood chips into an aluminium foil pouch with holes poked in it.", "description": "Place the wood chips in the middle of a sheet of heavy-duty aluminium foil. Fold all the ends of the foil together so that it looks like a burrito, with the wood chips wrapped inside. Flip the pouch over and poke about 10 holes in it with a fork or knife. This will let the smoke escape.", "img": "https://www.wikihow.com/images/thumb/5/5b/Smoke-Turkey-Legs-Step-10.jpg/v4-460px-Smoke-Turkey-Legs-Step-10.jpg"}, {"summary": "Put the foil pouch on the grill and light it.", "description": "Try lifting your grill grate and putting the pouch on the burner shield. If you can’t lift your grill grate, simply put your pouch directly on the grate. Light your grill and turn the heat to high. The grill is ready when the pouch begins to smoke.", "img": "https://www.wikihow.com/images/thumb/f/f6/Smoke-Turkey-Legs-Step-11.jpg/v4-460px-Smoke-Turkey-Legs-Step-11.jpg"}, {"summary": "Turn off all the burners except one and put your meat on the grill.", "description": "Leave the burner under the foil pouch on. Place the turkey legs on the side where the burner is turned off. This way it will smoke with indirect heat. If you’ve put your foil pouch directly on the grate, rather than underneath on the burner shield, try elevating your turkey legs off the rack so that they’re higher than the pouch. This lets the smoke circulate all around the meat. Use 2 bricks to lift a small oven rack a few inches off of the grill. Put the turkey legs on the rack. Don’t worry if you can’t elevate the meat above the smoke pouch, though. It will still taste good.", "img": "https://www.wikihow.com/images/thumb/5/52/Smoke-Turkey-Legs-Step-12.jpg/v4-460px-Smoke-Turkey-Legs-Step-12.jpg"}, {"summary": "Smoke the turkey legs for about 2 ½ to 3 ½ hours.", "description": "Use tongs to place the turkey legs on the grate. Close the lid and turn the heat to medium. Keep the temperature of the grill between 245 °F (118 °C) and 260 °F (127 °C). Smoke the turkey legs until they reach an internal temperature of 165 °F (74 °C). Check them with a meat thermometer. Lift the lid and check once in a while to make sure that the foil pouch is still smoking. If it’s stopped smoking, make a new one and place it on the heated burner.", "img": "https://www.wikihow.com/images/thumb/d/d6/Smoke-Turkey-Legs-Step-13.jpg/v4-460px-Smoke-Turkey-Legs-Step-13.jpg"}, {"summary": "Remove the turkey legs and let them rest briefly.", "description": "Set them aside on a plate for at least 5 minutes. Eat them warm. Refrigerate any leftovers for 3-4 days, or freeze them for 2-3 months. Make sure they’re in an airtight container or tightly wrapped in plastic wrap or aluminium foil.", "img": "https://www.wikihow.com/images/thumb/7/74/Smoke-Turkey-Legs-Step-14.jpg/v4-460px-Smoke-Turkey-Legs-Step-14.jpg"}]}}