{"conversation": [{"text": "Hello, are you ready to learn how to make a Roasted Veggie Pizza?", "evidence": ["Gather the ingredients.", "Gather the ingredients.", "Gather the ingredients."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Let me know when you are ready.", "evidence": [], "id": "User", "dialog_act": "other"}, {"text": "I am ready any time!", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "Alright, what do I do first to make this pizza?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "First, gather flour and dough. Store-bought or homemade dough will work well. Let the dough sit out for 20-30 minutes.", "evidence": ["Scatter flour onto a flat work surface. Remove the dough from its packaging and leave it sitting out for about 20 to 30 minutes until it's room temperature. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I have homemade dough and it's already been sitting out, but I'm not sure how long. How will I know it's ready?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The dough should be room temperature before you go further.", "evidence": ["leave it sitting out for about 20 to 30 minutes until it's room temperature."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Perfect, it is. What do I do next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Take your dough and roll it out until it is half an inch think. You can pinch the edges, using two hands and letting the dough hang to shape it into the size you want. When you're satisfied, place it on a baking sheet.", "evidence": ["Roll the dough into a circle that is approximately ½ inch thick. Grab and pinch one of the edges with both hands, letting the dough hang down. Slowly work your way around the circle, pinching, until the dough is the size you want. Place the crust on a baking sheet that you've oiled or sprinkled with corn meal to prevent sticking."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, I'm not sure how big to make it. How many servings does this recipe say it'll make? and will any baking sheet do?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "The recipe yields about 4 servings, so you can size it accordingly. Also, you should use sprinkled cornmeal or oil on the baking sheet so your pizza doesn't stick.", "evidence": ["The yield is approximately 4 servings.", "Place the crust on a baking sheet that you've oiled or sprinkled with corn meal to prevent sticking."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Does it go in the oven now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, but it is time to preheat the oven. Do you use fahrenheit or celsius ?", "evidence": ["Preheat the oven to 425°F (218°C)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I use celsius, but my oven is in fahrenheit.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Preheat your oven to 425 degrees F (218 degrees C).", "evidence": ["Preheat the oven to 425°F (218°C) and prepare the vegetables."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Now does it go in? It doesn't look ready.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we prepare the vegetables. You should gather your veggies, slice them thinly, and then place them into a strainer with some salt. Let them rest for 15 minutes.", "evidence": ["prepare the vegetables.", "Rinse and slice all of your vegetables on the diagonal to be about ¼-inch (6.35 mm) thick. Slicing on a diagonal means to slice them thinly, at a slant and length-wise. Place the slices into a large strainer. Sprinkle salt all over them and allow them to sit like that for about 15 minutes. This will extract some of the natural water from the vegetables. Rinse the salt off"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I want to make big slices, is that alright?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Using thinner, slanted slices will be better for roasting.", "evidence": ["Slicing on a diagonal means to slice them thinly, at a slant and length-wise", ". Extracting the water makes the vegetables roast better. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Why? And what's the point of the strainer too?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "This is so your vegetables will lose some of their water. Higher water will make them soggy if you try to roast them, but salting them and then letting them rest will make them crispier. Let me know when you're ready for the next step.", "evidence": ["Vegetables with high water content will roast soggily.", "This will extract some of the natural water from the vegetables. ", "Extracting the water gives you a crisper result."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I understand now. I will use tomatoes and zucchini. Okay, they're done resting, do they go on top now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "First, rinse the salt off and blot the veggies dry. Then we will be ready for the next step", "evidence": ["Rinse the salt off. Drain the veggies and use paper towels to blot them dry."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Done. What now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now we roast the veggies for 15 to 20 minutes. Drizzle olive oil and minced garlic over the veggies in a baking sheet. You'll know they're ready when they're tender and darkened.", "evidence": ["Roast the vegetables.", "When they are tender and darkened around the edges, they’re ready.", "Drizzle olive oil over them and sprinkle the minced garlic", "Place the baking sheet in the oven and roast them for about 15 to 20 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Can I slice them smaller now that they're out?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should wait till they're cooled.", "evidence": ["Once they’ve cooled, feel free to slice the vegetables slightly thinner, if you prefer smaller pieces for toppings."], "id": "Agent", "dialog_act": "answer question"}, {"text": "They're all ready. Now do they go on the pizza?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yes, it's time! Place your ricotta first, then arrange them over top. The final touches are drizzling olive oil and adding parsley on top", "evidence": ["Sprinkle mozzarella cheese over the veggies. ", "drizzle the 2 tablespoons of olive oil you reserved over the pizza and top with the parsley.", "Arrange the roasted vegetables on top of the thin layer of ricotta"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "I made it into a pattern. It looks beautiful. The oven is preheated. Is there anything left to do before it goes in?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "That's it! Let it bake for 15 minutes.", "evidence": ["Lastly, drizzle the 2 tablespoons of olive oil you reserved over the pizza and top with the parsley."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Should I make a salad while I wait for it to finish? Or would ice cream be a better side?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Salad will be a delicious side. Red wine will pair nicely as well, if you wish", "evidence": ["Serve with a tossed salad and a nice red wine (optional)."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yum. It's been 15 minutes! It look golden brown, is that right?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yes, that means it's done. You can take it out and slice it now, it is ready to serve.", "evidence": ["You’ll know its read when the cheese has fully melted and the crust has become golden brown. ", "Remove the pizza from the oven and slice it into wedges with a pizza cutter. Serve immediately."], "id": "Agent", "dialog_act": "answer question"}, {"text": "I'm on it. Thanks for the help, it smells great!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "You're welcome, enjoy.", "evidence": [], "id": "Agent", "dialog_act": "other"}, {"text": "I will", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make a Roasted Veggie Pizza", "url": "https://www.wikihow.com/Make-Vegetable-Pizza", "category": ["Food and Entertaining", "Recipes", "Vegetarian"], "procedure": [{"summary": "Gather the ingredients.", "description": "This recipe makes use of store-bought pizza dough. However, feel free to use a homemade pizza crust, if you prefer. Using a store-bought crust, this pizza can be cooked and served in about 60 minutes. The yield is approximately 4 servings. Scatter flour onto a flat work surface. Remove the dough from its packaging and leave it sitting out for about 20 to 30 minutes until it's room temperature. Roll the dough into a circle that is approximately ½ inch thick. Grab and pinch one of the edges with both hands, letting the dough hang down. Slowly work your way around the circle, pinching, until the dough is the size you want. Place the crust on a baking sheet that you've oiled or sprinkled with corn meal to prevent sticking.", "img": "https://www.wikihow.com/images/thumb/5/51/Make-Vegetable-Pizza-Step-6-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-6-Version-3.jpg"}, {"summary": "Preheat the oven to 425°F (218°C) and prepare the vegetables.", "description": "Rinse and slice all of your vegetables on the diagonal to be about ¼-inch (6.35 mm) thick. Slicing on a diagonal means to slice them thinly, at a slant and length-wise. Place the slices into a large strainer. Sprinkle salt all over them and allow them to sit like that for about 15 minutes. This will extract some of the natural water from the vegetables. Rinse the salt off. Drain the veggies and use paper towels to blot them dry. Extracting the water makes the vegetables roast better. Vegetables with high water content will roast soggily. Extracting the water gives you a crisper result.", "img": "https://www.wikihow.com/images/thumb/e/e4/Make-Vegetable-Pizza-Step-7-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-7-Version-3.jpg"}, {"summary": "Roast the vegetables.", "description": "Spread the vegetables out in one layer on a baking sheet. Drizzle olive oil over them and sprinkle the minced garlic. Reserve 2 tablespoons (30 milliliters) of the oil. Place the baking sheet in the oven and roast them for about 15 to 20 minutes. When they are tender and darkened around the edges, they’re ready. Once they’ve cooled, feel free to slice the vegetables slightly thinner, if you prefer smaller pieces for toppings.", "img": "https://www.wikihow.com/images/thumb/8/82/Make-Vegetable-Pizza-Step-8-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-8-Version-3.jpg"}, {"summary": "Spread the ricotta cheese over the pizza crust dough.", "description": "Arrange the roasted vegetables on top of the thin layer of ricotta. Sprinkle mozzarella cheese over the veggies. Lastly, drizzle the 2 tablespoons of olive oil you reserved over the pizza and top with the parsley.", "img": "https://www.wikihow.com/images/thumb/1/15/Make-Vegetable-Pizza-Step-9-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-9-Version-3.jpg"}, {"summary": "Bake the pizza for 15 minutes.", "description": "Place the baking sheet into your oven and allow the pizza to cook for about 15 minutes. You’ll know its read when the cheese has fully melted and the crust has become golden brown. Remove the pizza from the oven and slice it into wedges with a pizza cutter. Serve immediately. Serve with a tossed salad and a nice red wine (optional).", "img": "https://www.wikihow.com/images/thumb/9/93/Make-Vegetable-Pizza-Step-10-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-10-Version-3.jpg"}]}}