{"conversation": [{"text": "I will teach you to make Rice Kheer today.", "evidence": ["Kheer is just one name for a rice pudding-like dessert "], "id": "Agent", "dialog_act": "other"}, {"text": "What exactly is Rice Kheer?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Kheer is a rice-pudding like dish served in a number of southeast Asian countries. Often Kheer is individual to the family, with variation between regions. Often Kheer will be topped with spices or nuts.", "evidence": [" rice pudding-like dessert that is often made in southeast Asian countries like India, Nepal and Pakistan", "special occasions", " topped with any number of things"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What is the first step in making Kheer?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Start off with the ingredients. These may need to be sourced from a  speciality food store. You'll need overcooked rice, which you will then add milk, sugar, raisins, pistachios, almonds, cardamon and saffron to.", "evidence": ["need to gather the ingredients for kheer", "specialty food store for ingredients if your local supermarket doesn’t carry them"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Tasty! I have all my ingredients. What should I do now?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "What type of rice do you have? Usually it is best to avoud jasmine or coconut rice. I recommend long grained or basmati rice.", "evidence": ["any type of rice", "best to not use flavored rice like jasmine or coconut"], "id": "Agent", "dialog_act": "ask question"}, {"text": "I have long grained. I also overcooked it - is that okay?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, that is perfect. Did you have any other questions before we start?", "evidence": ["best to overcook it a little bit to mimic the texture of leftover rice."], "id": "Agent", "dialog_act": "answer question"}, {"text": "No. What should I do now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "You will start with preparing the spices and raisins. Put the raisins in a little water to puff them up, this makes them more enjoyable to eat. I also like to gently heat my pan on a medium heat and, whilst that is heating up, I grind the saffron with a pinch of sugar.", "evidence": [" Put the raisins in a little bit of water to puff them up", "Heat the pan over a medium gas flame or electric stove setting.", "grind the saffron and a pinch of sugar with a mortar and pestle"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Sounds good. What should I grind my saffron in?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "I use a mortar and pestle. Do you own one?", "evidence": ["grind the saffron and a pinch of sugar with a mortar and pestle"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Yes. I'll use that. What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "We will cook the kheer. I like to have my kheer smooth, so I mash the rice slightly before adding it into the pan with the milk. If you prefer it thicker, leave it alone. Then add in the saffron and sugar and gently stir. Taste it - is it sweet?", "evidence": ["Add the cup of slightly overcooked rice and 2 cups of whole milk to your heated pan", "mash the rice slightly before adding it to the milk", "saffron and sugar to the milk and rice in the pan."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Yes, quite fragrent as well with the saffron. I'd like a little more texture though.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "This is really up to you. Remember you are adding some texture in with the toppings. We now just stir the mixture, so if you want it thicker then cook it for longer. Some people prefer it to be more like a soup.", "evidence": ["you can decide how thick it gets", "people like their kheer thinner like a creamy soup "], "id": "Agent", "dialog_act": "other"}, {"text": "Yes, I think I'd like it thicker. When do I add my toppings, how do I know the right time?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add in the toppings when you have reached the ideal consistency. As I like mine thick, I let my kheer thicken up first. It's dependent on your preference, but when you are happy with it add in the sugar first, then the raisins and nuts.", "evidence": ["hould let the mixture thicken over the heat", "desired consistency", "he 3 tablespoons sugar and the raisins and mixed nuts"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Should I taste it? What am I looking for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes. Add the kheer after adding the sugar, before the other toppings. It is important to decide whether you are happy with the sweetness. Then you can drain and add the raisins, pistachios and almonds. Do you like the taste of it?", "evidence": ["You might want to taste the kheer at this point to see if it needs more sugar"], "id": "Agent", "dialog_act": "answer question"}, {"text": "I do, it's just right for me. Do we add the spices now? I feel like it needs a little more depth.", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Exactly that! Make sure to remove the kheer from the heat, then just stir in the cardamon. How do you like to eat rice pudding? Hot or cold?", "evidence": ["Remove the pan from the heat and add the 1/8 teaspoon powdered cardamom."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Usually hot.", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "You can actually eat Kheer hot or cold. Often the eating style depends on the time of the year. Make sure to add any further toppings before eating though - I like to add some mixed nuts.", "evidence": ["ou can serve the dish either hot or cold, depending on your taste and the time of year"], "id": "Agent", "dialog_act": "other"}, {"text": "I think I'll add pistachios. Is it finished?", "chosenReferece": "", "id": "User", "dialog_act": "answer question"}, {"text": "Yes, all finished. Are you happy with it?", "evidence": ["The time has come for you to enjoy your kheer!"], "id": "Agent", "dialog_act": "other"}, {"text": "Yes, I am. I think I'll try it cold when I make it again.", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "It's delicious cold too. Enjoy!", "evidence": ["You can serve the dish either hot or cold,"], "id": "Agent", "dialog_act": "other"}, {"text": "Thank you :)", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Rice Kheer", "url": "https://www.wikihow.com/Make-Kheer", "category": ["Food and Entertaining", "Recipes", "World Cuisines", "Indian Cuisine", "Indian Desserts"], "procedure": [{"summary": "Learn about kheer.", "description": "Kheer is just one name for a rice pudding-like dessert that is often made in southeast Asian countries like India, Nepal and Pakistan for special occasions. Kheer is a year-round favorite that can be served topped with any number of things from chopped nuts like pistachios or almonds to spices such as cardamom and saffron. There is no one standard recipe for kheer. Each family and geographic region makes kheer using some variation of the recipe. Kheer is also known by different names including khir, payasam, payasa or kheeri.", "img": "https://www.wikihow.com/images/thumb/e/e5/Make-Kheer-Step-1-Version-2.jpg/v4-460px-Make-Kheer-Step-1-Version-2.jpg"}, {"summary": "Gather supplies.", "description": "You’ll need to gather the ingredients for kheer before you start cooking it. The recipe is fairly simple, but you may need to go to a specialty food store for ingredients if your local supermarket doesn’t carry them. For kheer that serves four people you’ll need the following ingredients: 1 cup of slightly overcooked rice, 2 cups of whole milk, 3 tablespoons sugar, 1 tablespoon raisins, 1 tablespoon chopped pistachios, 1 tablespoon chopped almonds, 1/8 teaspoon powdered cardamom, and a pinch of saffron. You can use any type of rice, such as long grained or basmati, for this recipe. It’s probably best to not use flavored rice like jasmine or coconut. If you have leftover rice from another dish, you can use it to make kheer. If you are making the rice just for kheer, it’s best to overcook it a little bit to mimic the texture of leftover rice.", "img": "https://www.wikihow.com/images/thumb/8/8d/Make-Kheer-Step-2-Version-2.jpg/v4-460px-Make-Kheer-Step-2-Version-2.jpg"}, {"summary": "Prepare the pan and your ingredients.", "description": "Before you start cooking kheer, heat the pan and prepare the saffron and raisins so that they’re ready to use as you cook. It’s important to do this before you begin cooking so that your kheer doesn’t burn while you mix the ingredients. Put the raisins in a little bit of water to puff them up. Use any small or medium heavy bottomed pan that you have to cook the kheer. Heat the pan over a medium gas flame or electric stove setting. While the pan is heating up, grind the saffron and a pinch of sugar with a mortar and pestle. Set it to the side.", "img": "https://www.wikihow.com/images/thumb/b/b7/Make-Kheer-Step-3-Version-2.jpg/v4-460px-Make-Kheer-Step-3-Version-2.jpg"}, {"summary": "Cook your kheer.", "description": "Once you’ve preheated the pan and done the prep work, you’re ready to cook your kheer. Make sure to not leave the pan at this stage so that your kheer doesn’t burn. Add the cup of slightly overcooked rice and 2 cups of whole milk to your heated pan. Lightly stir this mixture. If you like a smoother texture, mash the rice slightly before adding it to the milk. Add your mixture of saffron and sugar to the milk and rice in the pan.", "img": "https://www.wikihow.com/images/thumb/2/27/Make-Kheer-Step-4-Version-2.jpg/v4-460px-Make-Kheer-Step-4-Version-2.jpg"}, {"summary": "Stir the mixture over the heat.", "description": "You’ll need to make sure that you don’t leave the mixture in the pan at this point to keep it from burning. Keep stirring the pan until the mixture reaches a consistency that you wish. You should let the mixture thicken over the heat, but you can decide how thick it gets. Some people like their kheer thinner like a creamy soup while others like their kheer thick like oatmeal.", "img": "https://www.wikihow.com/images/thumb/6/66/Make-Kheer-Step-5-Version-2.jpg/v4-460px-Make-Kheer-Step-5-Version-2.jpg"}, {"summary": "Add the sugar and remaining ingredients.", "description": "Once your kheer has reached the desired consistency, add the 3 tablespoons sugar and the raisins and mixed nuts. Fold these ingredients into the mixture. Add the sugar before the raisins and mixed nuts. You might want to taste the kheer at this point to see if it needs more sugar. Drain the raisins and add them to the mixture along with the 1 tablespoon chopped pistachios and 1 tablespoon chopped almonds. Remove the pan from the heat and add the 1/8 teaspoon powdered cardamom.", "img": "https://www.wikihow.com/images/thumb/b/b3/Make-Kheer-Step-6.jpg/v4-460px-Make-Kheer-Step-6.jpg"}, {"summary": "Serve and enjoy!", "description": "The time has come for you to enjoy your kheer! You can serve the dish either hot or cold, depending on your taste and the time of year. Consider topping your kheer with a few chopped pistachios or almonds for the visual effect.", "img": "https://www.wikihow.com/images/thumb/0/06/Make-Kheer-Step-7.jpg/v4-460px-Make-Kheer-Step-7.jpg"}]}}