{"conversation": [{"text": "The first step in the recipe is to preheat your oven to 375 F if using a baking pan, or 350 F if using a muffin tin.", "evidence": ["Preheat your oven to 375 °F (191 °C).", "If you'll be using a muffin tin, then do 350 °F (177 °C) instead"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Should I butter the baking tin?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, you should grease the tin to stop it sticking. You can use, olive oil, butter, or nonstick spray, whatever you have handy.", "evidence": ["You can use olive oil, butter, or a nonstick cooking spray"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, I've greased the tin. Should I crack the eggs now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yes, it's time to beat together ten eggs, and then add to them 470ml of milk, 1 tsp of salt and 1/4tsp of black pepper.", "evidence": ["Crack 10 eggs into a large mixing bowl, then pour in 2 cups (470 mL) of milk", "Add 1 teaspoon of salt and up to 1/4 teaspoon of freshly-ground black pepper"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Ok, I've beaten that together. What's the next step.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Before we move on, have the yolks broken? Is everything fully combined? This is important to get fluffier eggs at the end", "evidence": ["Whisk everything together until the yolks break"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yes, it's all fully incorporated. Should I add anything else to the mixture.", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yep, you can add whatever ingredients you like here. Traditionally this would be parmesan, ham and parsley but you could also add onion, peppers or mushrooms.", "evidence": ["Add some cheese, cooked ham, and parsley, if desired.", "For a traditional dish, use 1 cup (100 g) of grated Parmesan cheese, 1 cup (150 g) of diced, cooked ham, and 1/4 cup (5 g) finely-chopped, fresh, flat-leaf parsley", "You can also try other fillings too, such as diced onion, bell peppers, mushrooms, etc"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "OK, I want to add mushrooms, should I just put them in raw?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, if you want to add mushrooms you should fry them first. This goes for onions and peppers too.", "evidence": ["With the exception of herbs, be sure to fry or sauté everything before adding it into the eggs"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Ok, I've fried mushrooms and added them to the mixture. Should I pour onto the tray now?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Yep, it's time to pour them into the pan. If you're using a muffin tin, you should use a ladle to make it easier.", "evidence": ["Pour the mixture into your greased pan", " you are filling a muffin tin, consider using a soup ladle to transfer the egg mixture into the wells"], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long should I bake it for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "You should bake them for 45 minutes.", "evidence": ["Bake the scrambled eggs for 45 minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "OK, I've baked for 45 minutes, can I take them out now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Is the top golden? Have you poked them with a knife to check they're set in the middle? If they're cooked, the knife will come out clean.", "evidence": ["They are ready when the top is golden", "Another way to test them is to poke the middle with a knife; if it comes out clean, the eggs are ready"], "id": "Agent", "dialog_act": "ask question"}, {"text": "Yep, they're set in the middle. How long should I cool them for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Cool them for 5 minutes, and then cut them into 6 portions and enjoy!", "evidence": ["Allow the eggs to cool for 5 minutes before serving them.", "Once they have cooled, but them to 6 portions, then serve them with a spatula"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Thank you!", "chosenReferece": "", "id": "User", "dialog_act": "other"}, {"text": "Serve up and tuck in.", "evidence": ["serve them individually"], "id": "Agent", "dialog_act": "other"}, {"text": "They are delicious.", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Scrambled Eggs", "url": "https://www.wikihow.com/Bake-Eggs", "category": ["Food and Entertaining", "Recipes", "Eggs and Dairy", "Egg Basics"], "procedure": [{"summary": "Preheat your oven to 375 °F (191 °C).", "description": "This is only if you're going to use a baking pan. If you'll be using a muffin tin, then do 350 °F (177 °C) instead.", "img": "https://www.wikihow.com/images/thumb/5/5b/Bake-Eggs-Step-13-Version-2.jpg/v4-460px-Bake-Eggs-Step-13-Version-2.jpg"}, {"summary": "Grease a 9 by 13 in (23 by 33 cm) baking pan.", "description": "You can use olive oil, butter, or a nonstick cooking spray for this. Set the pan aside when you are done. You can also use a muffin tin. You have enough egg mixture to fill 5 standard-sized wells. Grease each well, but skip the paper liner.", "img": "https://www.wikihow.com/images/thumb/c/cd/Bake-Eggs-Step-14-Version-2.jpg/550px-nowatermark-Bake-Eggs-Step-14-Version-2.jpg"}, {"summary": "Beat the eggs, milk, salt, and pepper together.", "description": "Crack 10 eggs into a large mixing bowl, then pour in 2 cups (470 mL) of milk. Add 1 teaspoon of salt and up to 1/4 teaspoon of freshly-ground black pepper. Whisk everything together until the yolks break. The more you beat the eggs, the fluffier and lighter they will become once baked.", "img": "https://www.wikihow.com/images/thumb/a/a7/Bake-Eggs-Step-15-Version-2.jpg/550px-nowatermark-Bake-Eggs-Step-15-Version-2.jpg"}, {"summary": "Add some cheese, cooked ham, and parsley, if desired.", "description": "For a traditional dish, use 1 cup (100 g) of grated Parmesan cheese, 1 cup (150 g) of diced, cooked ham, and 1/4 cup (5 g) finely-chopped, fresh, flat-leaf parsley. Give the mixture another stir to mix everything together. You can also try other fillings too, such as diced onion, bell peppers, mushrooms, etc. With the exception of herbs, be sure to fry or sauté everything before adding it into the eggs.", "img": "https://www.wikihow.com/images/thumb/0/0a/Bake-Eggs-Step-16-Version-2.jpg/550px-nowatermark-Bake-Eggs-Step-16-Version-2.jpg"}, {"summary": "Pour the mixture into your greased pan.", "description": "If you are filling a muffin tin, consider using a soup ladle to transfer the egg mixture into the wells. This will ensure that each well gets the same amount.", "img": "https://www.wikihow.com/images/thumb/1/14/Bake-Eggs-Step-17-Version-2.jpg/550px-nowatermark-Bake-Eggs-Step-17-Version-2.jpg"}, {"summary": "Bake the scrambled eggs for 45 minutes.", "description": "They are ready when the top is golden. Another way to test them is to poke the middle with a knife; if it comes out clean, the eggs are ready. If you're baking the eggs in a muffin tin, then check the eggs after about 12 to 15 minutes; they should be just set.", "img": "https://www.wikihow.com/images/thumb/c/c6/Bake-Eggs-Step-18-Version-2.jpg/v4-460px-Bake-Eggs-Step-18-Version-2.jpg"}, {"summary": "Allow the eggs to cool for 5 minutes before serving them.", "description": "Once they have cooled, but them to 6 portions, then serve them with a spatula. If you made the eggs in a muffin tin, then slide them out of the tin with a fork or spoon, and serve them individually.", "img": "https://www.wikihow.com/images/thumb/b/b5/Bake-Eggs-Step-19-Version-2.jpg/550px-nowatermark-Bake-Eggs-Step-19-Version-2.jpg"}]}}