{"conversation": [{"text": "Hello. We will follow a recipe to make vegetable pizza. To begin, you must gather your ingredients, including a home-made or store-bought pizza crust (your choice).", "evidence": ["Gather the ingredients."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How much longer does home-made dough take to make?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "It will take an extra hour and a half.", "evidence": ["If you opt to make the homemade crust, you will need an additional hour and a half."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, I will make the home-made dough! what next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Wash your vegetables before we move on!", "evidence": [" Make sure to always wash your vegetables well before using them on your pizza."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Great, what is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Prepare your dough by sprinkling flour onto the surface and on the flour. Then, allow the dough to reach room temperature by letting it sit for 20 to 30 minutes.", "evidence": ["Sprinkle flour generously onto a flat work surface. Remove the dough from your refrigerator and give it a light dusting of flour. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "Okay, I have done that. Is there anything else I should do with the floured dough?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes. Flour your rolling pin, and roll the dough into a circle of about 1/2 an inch thick. Pinch one of the edges whilst holding the dough with both hands, and slowly work your way around the circle of dough whilst doing this, until the dough is the right size!", "evidence": ["Roll the dough into a circle that is approximately ½ inch thick.", "Take the dough in both hands and pinch one of the edges, letting the dough hang down. ", "Slowly work your way around the circle, pinching, until the dough is the size you want."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, shall I just leave the dough here?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "No, put it onto a greased baking sheet.", "evidence": ["ou'll need to grease the baking sheet with cooking spray/oil before placing the crust on it.", "ou'll need to grease the baking sheet with cooking spray/oil before placing the crust on it."], "id": "Agent", "dialog_act": "answer question"}, {"text": "How should I grease the baking sheet?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "With cooking spray or oil, or even by sprinkling corn meal if you have it!", "evidence": ["cooking spray/oil ", "corn meal "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Great. What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Next we make the sauce. To start, place a strainer over a microwave proof bowl and put the tomatoes into this. Crush the tomatoes with your hand so the juice naturally goes through the strainer. Then, microwave the juice on high.", "evidence": ["Place a strainer over a large microwave proof bowl. Dump the tomatoes into the strainer and crush them with your hands. ", "Place the microwavable bowl full of tomato juice into your microwave and set them to cook on high for 20 to 25 minutes."], "id": "Agent", "dialog_act": "teach new step"}, {"text": "How long should I microwave the juice for?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Around 20-25 minutes.", "evidence": ["20 to 25 minutes"], "id": "Agent", "dialog_act": "answer question"}, {"text": "What next?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Add the remaining crushed pulp into this juice, which should now be thickened, and allow the creation to cool to room temperature.", "evidence": ["Pour the crushed tomato pulp into the thickened juice. ", "Allow this to cool down to room temperature. "], "id": "Agent", "dialog_act": "answer question"}, {"text": "Is there a way to do this with the stovetop?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes. You should simmer the tomatoes in a pan over the stovetop for around 30 minutes until it thickens, but make sure you are stirring frequently!", "evidence": ["simmer the tomatoes in a medium sized pan for about 30 minutes, stirring frequently, until it thickens."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Good to know! What is the next step?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Now for the toppings. Cut vegetables to your preferred size. Then, coat them with oil and season them.", "evidence": ["Chop the vegetables into your preferred size. Coat the chopped veggies with olive oil and season them with salt and pepper. "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "What oil should I use and what seasoning?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Olive oil, salt and pepper.", "evidence": ["olive oil", "salt and pepper", "salt and pepper"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, what now?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Grill for about 10 minutes, to tender but firm. Remove from the grill and set them aside - use however many you like!", "evidence": ["Grill them for about 10 minutes, until they are tender but still firm", "Remove the vegetables from the grill and set them aside", "omit or limit the use of any that you don’t like."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Now we shall move onto assembly?", "chosenReferece": "", "id": "User", "dialog_act": "ask to move on"}, {"text": "Exactly! But first, preheat your oven.", "evidence": ["Preheat the oven to its highest setting, ", "Preheat the oven to its highest setting, "], "id": "Agent", "dialog_act": "teach new step"}, {"text": "To what temperature?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Usually between 500 and 550 Fahrenheit, which is between 260 and 288 Celsius.", "evidence": ["usually between 500 and 550°F (260°C and 288°C)"], "id": "Agent", "dialog_act": "answer question"}, {"text": "Okay, and then what?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Put the cold sauce onto the dough and spread evenly. Top this with the vegetable toppings we prepared.", "evidence": [" Spoon the cooled sauce over the pizza crust dough and spread it evenly. Top with the grilled sliced vegetables "], "id": "Agent", "dialog_act": "answer question"}, {"text": "How shall I assemble the vegetables?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "However you like!", "evidence": ["arrange them however you like."], "id": "Agent", "dialog_act": "answer question"}, {"text": "And are we adding cheese? This is a pizza, after all!", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, top with mozzarella cheese and bake for around 10 to 12 minutes. You will know the pizza is ready when the cheese is melted, bubbly and lightly browned on top.", "evidence": ["Top with mozzarella cheese. Bake the pizza for about 10 to 12 minutes."], "id": "Agent", "dialog_act": "answer question"}, {"text": "Once removed from the oven, shall I cut the pizza?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Yes, cut it into wedges!", "evidence": ["Slice the pizza into wedges"], "id": "Agent", "dialog_act": "answer question"}, {"text": "And when shall I serve it?", "chosenReferece": "", "id": "User", "dialog_act": "ask question"}, {"text": "Immediately, please!", "evidence": ["serve immediately"], "id": "Agent", "dialog_act": "answer question"}, {"text": "All done! Thank you for your help!", "chosenReferece": "", "id": "User", "dialog_act": ""}, {"text": "Congratulations! You have successfully completed this cooking task.", "evidence": [], "id": "Agent", "dialog_act": ""}, {"text": "Thank you, it was fun!", "chosenReferece": "", "id": "User"}], "recipe": {"title": "How to Make Vegetable Pizza", "url": "https://www.wikihow.com/Make-Vegetable-Pizza", "category": ["Food and Entertaining", "Recipes", "Vegetarian"], "procedure": [{"summary": "Gather the ingredients.", "description": "This recipe makes use of store-bought pizza dough. However, feel free to use a homemade pizza crust, if you prefer. Using a store-bought crust, this pizza can be on the table in about 45 minutes. If you opt to make the homemade crust, you will need an additional hour and a half. The yield is approximately 4 servings. Store-bought produce usually isn't pre-rinsed. Make sure to always wash your vegetables well before using them on your pizza.", "img": "https://www.wikihow.com/images/thumb/d/dd/Make-Vegetable-Pizza-Step-1-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-1-Version-3.jpg"}, {"summary": "Prepare the store-bought pizza dough.", "description": "Sprinkle flour generously onto a flat work surface. Remove the dough from your refrigerator and give it a light dusting of flour. Allow the dough to sit on your work surface for 20 to 30 minutes, so that it becomes room temperature. Dust your rolling pin with flour. Roll the dough into a circle that is approximately ½ inch thick. Take the dough in both hands and pinch one of the edges, letting the dough hang down. Slowly work your way around the circle, pinching, until the dough is the size you want. To prevent the crust from sticking, you'll need to grease the baking sheet with cooking spray/oil before placing the crust on it. You can also sprinkle corn meal on a baking sheet to prevent this.", "img": "https://www.wikihow.com/images/thumb/2/2b/Make-Vegetable-Pizza-Step-2-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-2-Version-3.jpg"}, {"summary": "Make the sauce.", "description": "Place a strainer over a large microwave proof bowl. Dump the tomatoes into the strainer and crush them with your hands. Push the pulp into the bottom of the strainer so that the juices go through the sieve. Place the microwavable bowl full of tomato juice into your microwave and set them to cook on high for 20 to 25 minutes. This will thicken the juice into a consistency much like ketchup. Pour the crushed tomato pulp into the thickened juice. Allow this to cool down to room temperature. If you prefer using the stovetop, simmer the tomatoes in a medium sized pan for about 30 minutes, stirring frequently, until it thickens.", "img": "https://www.wikihow.com/images/thumb/d/d8/Make-Vegetable-Pizza-Step-3-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-3-Version-3.jpg"}, {"summary": "Prepare the toppings.", "description": "Chop the vegetables into your preferred size. Coat the chopped veggies with olive oil and season them with salt and pepper. Spread the vegetables out evenly on a hot grill or grill pan. Grill them for about 10 minutes, until they are tender but still firm. Remove the vegetables from the grill and set them aside. Feel free to customize the vegetables – omit or limit the use of any that you don’t like.", "img": "https://www.wikihow.com/images/thumb/b/b0/Make-Vegetable-Pizza-Step-4-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-4-Version-3.jpg"}, {"summary": "Assemble the pizza.", "description": "Preheat the oven to its highest setting, which is usually between 500 and 550°F (260°C and 288°C). Spoon the cooled sauce over the pizza crust dough and spread it evenly. Top with the grilled sliced vegetables – arrange them however you like. Top with mozzarella cheese. Bake the pizza for about 10 to 12 minutes. You'll know it's ready when the cheese is melted, bubbly and lightly browned on top. Slice the pizza into wedges and serve immediately.", "img": "https://www.wikihow.com/images/thumb/e/e9/Make-Vegetable-Pizza-Step-5-Version-3.jpg/v4-460px-Make-Vegetable-Pizza-Step-5-Version-3.jpg"}]}}