{"index": 0, "history": "[user] Where should I put the jujubes? [system] Line a rimmed baking sheet with foil and set out the jujubes on it [user] How should the jujubes be arranged on the sheet? Should they be close together or spread apart? [system] The jujubes should be spread quite far apart so they can dry properly. More than one baking sheet can be used. [user] Should I dispose of the sugar syrup or can it be used for something else? [system] The syrup can be boiled down to 1 1/3 cups and put into a glass bottle and stored in the fridge. It can then be used as syrup on pancakes or waffles. [user] What should I do with the jujubes now? Where should I store them? [system] The jujubes now need to be dried in the oven. [user] How hot should the oven be? [system] The oven should be preheated to 275 F or 135 C. The jujubes should be turned every so often to ensure the other side dries.", "user_utt": "How long should I keep the jujubes in the oven?", "intent": "req_duration;"}
{"index": 1, "history": "[user] Okay. What do I do with these cake crumbs? [system] Move the crumbs into a bowl, then add a dollop of frosting. Mix them. [user] How long should I mix the crumbs and the frosting? [system] Stir until the dough becomes the consistency of clay. [user] Ok, what do I do next? [system] Move the dough to an airtight space and chill it in a fridge overnight. [user] Is there a reason I can't go into the next step without chilling the dough first? [system] You can move on to the next step without waiting overnight, but the dough will not be as cooperative. If you choose you can instead move the dough to the freezer for an hour. [user] Okay I'll do that instead. I'll come back in an hour. What would my next step be? [system] Use your hands to mold the dough into eggs. Set them aside for 30 minutes so they can warm up.", "user_utt": "It's been an hour and now I've done this step. What should I do after molding the eggs and waiting 30 minutes?", "intent": "confirm; req_instruction;"}
{"index": 2, "history": "[user] How long should I let them simmer? [system] The jujubes should simmer for 30 minutes without the lid on [user] What should I do once the jujubes have simmered? [system] Now it is time to remove the jujubes from the saucepan [user] What should I use to remove the jujubes? Do I need to pour them with the water? [system] Use a slotted spoon to remove the jujubes [user] Where should I put the jujubes? [system] Line a rimmed baking sheet with foil and set out the jujubes on it [user] How should the jujubes be arranged on the sheet? Should they be close together or spread apart? [system] The jujubes should be spread quite far apart so they can dry properly. More than one baking sheet can be used.", "user_utt": "Should I dispose of the sugar syrup or can it be used for something else?", "intent": "req_confirmation;"}
{"index": 3, "history": "[system] Hi! What do you want to cook?", "user_utt": "Black pudding.", "intent": "confirm;"}
{"index": 4, "history": "[system] Hi! Today you'll be learning how to sour milk if you're up for that! [user] Perfect! What do I do to begin? [system] Firstly you want to fill a measuring cup with 1 cup of whole milk, minus about 1 or 2 tablespoons. Instead you should add 1 tablespoon of fresh lemon juice or white vinegar, whichever you prefer!", "user_utt": "I've done that. What shall I do next?", "intent": "confirm; req_instruction;"}
{"index": 5, "history": "[system] Hello, I am here to assist you with making Fry Sauce.", "user_utt": "Okay - great. First of all, what ingredients do I need?", "intent": "req_ingredient;"}
{"index": 6, "history": "[user] Yes, it can. [system] Good. Then place the pudding into the water whole. [user] Just did. Can I move on? [system] Are you simmering or boiling the sausages? [user] Simmering the pudding. [system] Then you need to turn the pudding every few minutes to cook through it. [user] Sure. What now? [system] Simmer the pudding for 6-8 minutes. [user] Okay. How can I check if it's ready? [system] You can squeeze the pudding lightly with a pair of tongs. If most of its firmness has given way and it has a soft texture, it's ready.", "user_utt": "Thanks! I have finished it.", "intent": "thank; confirm;"}
{"index": 7, "history": "[system] Hi! Today you'll be cooking peppers. [user] Ooh, sounds delicious. What should I do to get started? [system] They're great! Firstly you're going to need to prepare a baking sheet by lining it with aluminum foil. If using large bell peppers preheat an over to 425 degrees F, while if using smaller peppers preheat a broiler for 5-10 mins on high.", "user_utt": "I've got some large bell peppers at home, so I'll be using those. I just preheated the oven and prepped the baking sheet. What next?", "intent": "confirm; req_instruction;"}
{"index": 8, "history": "[system] Hello, I am here to assist you with making Fry Sauce. [user] Okay - great. First of all, what ingredients do I need? [system] You don't actually necessarily need too many ingredients. We can make this with as few ingredients as just ketchup and mayonnaise. However, we can also make substitutions (like ketchup with barbeque sauce, or mayonaise with miracle whip). Also optional are ground spices, hot sauce, vinegar, and pickle juice if you have it. [user] Okay, well I've got ketchup and mayo for sure. I also have some garlic powder, paprika, and tobasco. Can you show me how to make fry sauce using just these ingredients? [system] Yes, we can absolutely make a fry sauce using only these ingredients. Are you ready to begin?", "user_utt": "I am absolutely ready. Please tell me what to do first!", "intent": "affirm; req_instruction;"}
{"index": 9, "history": "[user] Yes, I think that'd be quite nice! [system] In that case, add the hot sauce you mentioned having earlier. I'd also ask you to double check your cupboards and see if you have any ground spices that may impart heat, such as cayenne pepper or hot chili powder, for example. [user] Oh! Yeah, I do have hot chili powder as well as tobasco. I'll add both. Should I target a specific amount? [system] It is difficult and perhaps meaningless to provide a specific amount since what is \"right\" will depend on your tastes and preferences. Just to try have fun and estimate based on your own spiciness tolerance. I'd recommend erring on the side of caution. You can always add more hot sauce to taste later on, but you won't be able to take it out! [user] Oh, that's a good point. Okay. I'll just add a tiny bit of tobasco and hot chili powder. Done. Now what? [system] Now just mix everything together! [user] Wow! I can't believe it's that easy! I can't wait to try this out. Uh, what do you think I can use this for, anyway? [system] That's entirely up to you - but in general, anything that you would add ketchup to, you can add your special fry sauce to! E.g., hamburgers, hot dogs [user] Great! I can't wait to try this out with some potato patties. I think it'll taste really good. Thanks again! [system] You're welcome :) Anything else I can help you with?", "user_utt": "Nope - I think I've got it all figured out. Thanks again! Goodbye!", "intent": "negate; confirm; goodbye;"}
{"index": 10, "history": "[system] Hi! What do you want to cook? [user] Black pudding. [system] First, you need to remove the plastic wrap from the black pudding, but do not slice it or remove the skin. [user] Why can't I slice it? [system] Because the black pudding would absorb water and become soggy.", "user_utt": "I see. What's next?", "intent": "req_instruction;"}
{"index": 11, "history": "[user] What is the next step to take? [system] If the consistency of the barley texture and taste is good, drain the water from the pot [user] How long does it take to reach consistency? [system] No exact time but check every 5 minutes to make sure of it [user] The consistency of the taste and texture is fine now. [system] To prevent sticking, stir the barley while it is still on the pot to prevent the grain from sticking due to starch being released. [user] How do I confirm no sticking of grains? [system] The grains should not stick so much to each other. [user] The grains look fine and not sticky. [system] Next, dish and store your leftover barley in an airtight container in the fridge.", "user_utt": "How long can I keep the barley stored?", "intent": "req_duration;"}
{"index": 12, "history": "[user] Okay, what should I do next? [system] Now wait for the jujubes in the saucepan to cool to room temperature. Then cover the pan with a lid and chill in the fridge overnight [user] Alright, once the jujubes have cooled what should I do? [system] Now it is time to reheat the jujubes [user] Should I reheat them in the saucepan with the sugar water? [system] Correct. Place the pan on the stove, take off the lid and bring to a boil over medium to medium-high heat. Once they begin boiling reduce the heat to let them simmer [user] How long should I let them simmer? [system] The jujubes should simmer for 30 minutes without the lid on [user] What should I do once the jujubes have simmered? [system] Now it is time to remove the jujubes from the saucepan", "user_utt": "What should I use to remove the jujubes? Do I need to pour them with the water?", "intent": "req_tool; req_confirmation;"}
{"index": 13, "history": "[user] Oh! Yeah, I do have hot chili powder as well as tobasco. I'll add both. Should I target a specific amount? [system] It is difficult and perhaps meaningless to provide a specific amount since what is \"right\" will depend on your tastes and preferences. Just to try have fun and estimate based on your own spiciness tolerance. I'd recommend erring on the side of caution. You can always add more hot sauce to taste later on, but you won't be able to take it out! [user] Oh, that's a good point. Okay. I'll just add a tiny bit of tobasco and hot chili powder. Done. Now what? [system] Now just mix everything together! [user] Wow! I can't believe it's that easy! I can't wait to try this out. Uh, what do you think I can use this for, anyway? [system] That's entirely up to you - but in general, anything that you would add ketchup to, you can add your special fry sauce to! E.g., hamburgers, hot dogs [user] Great! I can't wait to try this out with some potato patties. I think it'll taste really good. Thanks again! [system] You're welcome :) Anything else I can help you with? [user] Nope - I think I've got it all figured out. Thanks again! Goodbye! [system] Congratulations! You have successfully completed this cooking task.", "user_utt": "Awesome! How do I exit this thing now...", "intent": "goodbye;"}
{"index": 14, "history": "[user] Thankyou, I can't wait to make this! What do I need to make this? [system] You just need black pudding, its really cheap to buy [user] Great! What do I need to do first? [system] How many slices should I cut this in to? [user] As many slices as you wish, tr to cut them into 1cm thick pieces [system] Next, you need to remove the skin of the sausage. [user] How do I remove the skin? Is the skin not edible? [system] Be careful not to pierce the sausage as you remove the skin [user] What do I do next? [system] Place your chopped sausage into a hot pan that is already pre heated.", "user_utt": "How hot does my pan need to be? Do I need oil in my pan?", "intent": "req_temperature; req_confirmation;"}
{"index": 15, "history": "[system] What would you like to make? [user] I have a great black pudding recipe, its easy and delicious! [system] Here is the recipe [user] Thankyou, I can't wait to make this! What do I need to make this? [system] You just need black pudding, its really cheap to buy", "user_utt": "Great! What do I need to do first?", "intent": "req_instruction;"}
